{
  "narrative": "About a month ago see we were going to a church league softball game...  They'd had the games all scheduled for the diamond at Homestead High School.  You know where that's at?  Well we're going up Twenty­-four, and getting ready to turn there, at Ranch Eggs, and I was slowing down, got my turn signal on, and as I was slowing down, there's this guy sitting over here to the right, coming on to Twenty­-four.  Looked like he's about in his middle fifties.  And he starts creeping out onto Twenty-four and he's blocking off the lane, and he's heading for the same spot that I'm going.  You know how you sit there and wait for the traffic to get by?  Right there in the median?  This guy starts, pulls out in the lane, I thought \"you jerk\"...  but I hurried up and got in there ahead of him.  And he sits there and waits on.  Mean he's got Twenty­-four blocked.  He's sitting there right in the middle of the highway.  Got it blocked.  So we went on across as soon as traffic cleared, and we're headed up there towards that diamond, and it's about ... maybe mile, two miles... north of Twenty­-four on Aboite Center, and this guy's following us see, as we're going up there this little hill right there.  At Ranch Eggs.  We're going up this hill, and this guy's right on my tail.  And Lisa was with me, and she said “That guy is right on your tail!”  I looked in the mirror and sure enough he's right up there practically bumper to bumper, and I'm trying to keep an eye on him, make sure he doesn't slam into me or anything.  He starts weaving back and forth, couldn't keep it in one lane.  Really ...bad news. And all the time this is going on...  I'm thinking how drunk driving is the number one killer of kids and all this business.  How it's everybody's responsibility.  So I was trying to make up my mind what to do.  I was pretty sure he was drunk...  at least he appeared that way...  so I figured that when we get up to this stop sign I'm going to go back and find out what his problem is, 'cause I'm thinking he's drunk, and I know I oughta do something about it, but at the same time if he's sick, like maybe he's having a heart attack or something, you know.  You gotta do something.  I'd really feel bad if I read the papers the next day that the guy, some guy died with a heart attack and there I was thinking he was drunk.  And I didn't really want to get involved to be honest with you.  But I had made up my mind that I was going to, so we pulled up to the stop at this sign, and right across the road stopped a sheriff's car.  So I motion for him to come over, and they whip across the road, and I got out the car, walked over there, and said to this deputy “This guy behind me is either sick or he's drunk, but he's got a problem.  He can't keep his car on one side of the road.”  And I said “He's got a definite problem...”  So they started down there.  And as soon as he sees me get out of the car and walk over there to the police car, the guy stops way far away from the intersection.  He stops, and he throws his car into reverse, and starts backing up.  When the cops went down there to check him out, he starts backing up going backwards down that road.  Pretty soon they catch up with him, and he starts forward again, and they make a U­-turn in the road and start following him, and he's just driving real slow and careful.  Ha ha it's pretty comical...  I don't know if they ever stopped him or not.",
  "recalls": {
    "0": "Someone and their partner were drive on Twenty Four to a softball game at the church, when they noticed a guy was tailing their car. They tried to lose him, but he continued tailing him. However, the other guy crashed his car, and he didn't move. Not wanting to leave the man to die, though, they called the police, who turned up soon enough. The other man drove off and was never caught. ",
    "1": "A man was in the car with a woman named Lisa, going to watch a softball game driving down the Twenty-Four. A man in his mid fifties was pulling in from somewhere blocking the road with his car on the Twenty-Four when the driver in the car with Lisa drove in and overtook him. The man in his mid fifties began following their car bumper to bumper, swaying between the two lanes on the road. The driver and Lisa thought the man was either drunk, which led him to think about how drunk driving is a major killer of young people on the roads, or the man was either sick having a heart attack or something similar. The driver didn't want to somehow read the papers the next day and find out the mid fifties man had actually suffered a heart attack and died as a result, thinking he was actually just drunk driving. Soon they see a Sheriff nearby while driving and so he waves to the sheriff to get his attention and pull over and tells him about the mid fifties man following them and that he's either sick or drunk and to go check on him. As soon as the deputy approaches the mid fifties man's car he begins to put his car in reverse and go backwards as quickly as possible. The driver and Lisa appear humoured and not knowing whether the police had ever caught or reached the man in his fifties.",
    "2": "About a week ago I was headed to a softball game at Homestead Diamond put on by my church. I was driving down Twenty-Four and was waiting to turn, but a car started going for the spot at the same time. I quickly drove past him and he just stayed stopped blocking the highway. Then the driver started following us. I was with my friend Lisa and she said the vehicle was right on my tail, like almost bumper to bumper. And he was driving all over the place and not staying in his lane. I thought for sure he was drunk, and that I should turn around and confront him. But then I thought that he could also have a medical problem, like maybe he was having a heart attack, and I didn't want to read the news the next day and see that someone died while having a heart attack and I could have done something to help them. Part of me also didn't want to do anything but by then, I had already made up my mind to confront him. Then I saw a sheriff on the other side of the road, so I stopped and motioned for him to come over. I told the sheriff that the man behind me was driving erratically and couldn't stay on one side of the road, and that he was either drunk or having a heart attack, but was having some kind of problem. When I stopped to talk to the sheriff the driver of the vehicle stopped a ways down the road. Then when the sheriff drove after him, he started driving the road in reverse. Then the driver turned the car around and started driving the right way, with the sheriff following. He was driving really slow and it was such a funny thing to witness. I'm not sure if the sheriff ever stopped the driver of the vehicle.",
    "3": "",
    "4": "About a month ago a man was going to play softball near a church and was travelling with his wife in their car when they turned on highway 24 a man in a car behind them was also trying to turn at the same time and was following them and weaving about in the road behind them.He thought the man was drunk or ill and was going to go back to the car behind him when they stopped at the next junction. he saw a police car and waved the officers over and told them about the man and they went down the road to investigate and the driver turned his car around and the police followed him and the man did not know if the man was caught by the police or not.",
    "5": "On their way to a softball event at the diamonds, the main character was driving on 24 lane or road. He has a girl named lisa in the car. Another man stops at the intersection and blocks off traffic. The main character goes past and the man follows. The driver behind them is driving weirdly so the main character assumes he is drunk. Then he assumes he is maybe sick and should check him out in case the newspaper says a man had a heart attack and the main character couldve helped. The MC stops the car, spots a sherifs car and calls them over. He tells the deputy to check the other driver out. When the driver saw the mc talking to the police, he reversed, the police followed. Then he went forward and the police had to make a u-turn. The mc thought this was comical. He wasn't sure if the other driver was caught or not. ",
    "6": "We were going up to twenty four when this guy around the age of 50 starts following me bumper to bumper, at first I didn't take it serious but he was too close that I was worried that he might hit me. I decided that at the next intersection I am going to confront him, I mean what if he is drunk and major accidents are caused by drunk driving and he can't even keep to one lane. I didn't want to get involved but I have to, also what if he is having a heart attack, I don't want to read on the news that he died while I could have done something about it. At the next stop sight I jumped out and informed a sheriff about him, \"that man is either drunk or is having a health problem, he has been following me for a while now and he cant keep on his lane\". Seeing that I was talking to the police he stopped way far and started reversing and the police started chasing him. ",
    "7": "A driver and their passenger named Lisa are driving to a baseball game on Egg Ranch Hill. On the way, another driver attempts to cut them off on the 24 highway. The other driver proceeds to drive erratically behind them - at first, the driver assumes he is drunk and it's his responsibility to report it. The driver then considers he may be sick, possibly having a heart attack. The driver fears he will regret not doing anything if the man is sick and he hears about it after-the-fact and decides to stop and confront him. When only a few miles from the baseball diamond, the driver spots a sheriff and stops to speak with him. He addresses his issues with the other driver. As the other driver nears, he spies the sheriff and turns his car, driving away. The sheriff proceeds after him, the other driver now driving cautiously. The driver does not know what happened after that.   ",
    "8": "a person was driving, and turned right at the egg road house. \nthen noticed a person was driving poorly behind them and they started to either think, this guy is drunk or having a heart attack. \nsince they didn't want to read the news paper tomorrow and see 'man died of heart attack' she flagged down the cops to let them know that 'this guy has a problem' and then the , poor driver started to drive backwards and eventually the police caught up to them. not sure what happened to the guy in the end though, but it was funny!",
    "9": "All I can remember is drink driving number 24 he was blocking with his car and that drink driving is the main cause  of driving related deaths ",
    "10": "A venacular encounter in the USA with a possibly drunk driver, involving the police. There was no conclusion.",
    "11": "Someone and a girl named Lisa are on their way to a church softball game. They're near highway 24 and there's a man in his mid fifties that is edging out and blocking the intersection. The guy and Lisa manage to get out ahead of him. Then they notice that the older man is behind them and he is driving really close to them and cannot maintain a lane. They think that he is either drunk or sick. He doesn't really want to stop but also doesn't want to hear about a man dying \nbecause he was sick and he didn't help them. So they're about to pull over and they see a sheriff's car which they wave down. They tell the Sheriff that that man behind them is either sick or drunk. When the man behind them sees the Sheriff he puts his car in reverse and starts backing away. Then he drives away with the Sheriff after him. The story teller and Lisa never found out if the man was caught. And there was something about Ranch Eggs which I didn't understand. ",
    "12": "They were going to a church diamond league softball game at the high school and they were going up 24 and  they were getting ready to turn at the ranch eggs. They put on their turn signals and went over. There was a guy in his mid fifties who was blocking the lane and headed to the same spot as they were going and they said you jerk and they got ahead of him and they guy who was blocking the lane starts following them and Lisa the friend said, \"This guy is on your tail\". He starts weaving back and forth and this lead him to thinking the guy could be a drunk driver and how it is the number 1 killer of kids and that it is everyone's responsibility to report drunk driving. Then he thinks maybe they were having a heart attack and that he would feel guilty if he read the paper and saw a man had died of a heart attack and then he motioned at the police to come towards him. He then tells the police that they guy behind him is either drunk or sick. As the police moved towards him, the guy started backing away. The police pursued him but don't know what the result was.   ",
    "13": "The driver was driving somewhere, with someone called Lisa, and there was another car ahead, blocking the junction, holding up the traffic. Somehow the driver of this car ended up behind the first driver and he was weaving in and out.  The first driver was concerned that the other driver was drunk, or ill, and he was concerned about an accident happening.  He pulled up by some police officers (sherrifs)and told them what had happened.  They then went back down the road to speak to this other driver but he then reversed his car back down the road, did a u-turn and then proceeded to drive very slowly.  The first driver found this funny and wondered whether the police ever got to speak to the other driver. ",
    "14": "Going to the baseball diamond on ranch eggs. Took the twenty four. There was an erratic driver swerving and blocking traffic in the median. Went to report him and once the sheriffs started following him he started driving ,ore carefully.",
    "15": "I was driving and a person was driving erratically and I thought the person was drunk but then thought maybe they're having a medical emergency. I got the sherifs attention and it was pretty comical",
    "16": "When I was going to a church football game I saw a guy driving a car. He stopped at a junction and blocked it. He could not seem to keep on one side of the road. I thought he must be drunk and wanted to get away from him, then I thought, what if he is sick? I would feel terrible to read in the newspaper tomorrow that he had died from a heart attack and I had done nothing about it. Just then I spotted a sheriff's car, so I went over to him and told him that the guy in the car down the road was either drunk or sick as he could not keep his car on one side of the road. As soon as the guy in the car saw me walking over to the sheriff's car he started reversing. The sheriff drove towards him. The guy started driving carefully. The sheriff followed him. I have not idea if they ever stopped him or not.",
    "17": "There was a person driving on the freeway and heading to a hill when they noticed a suspicious driver. He started by attempting to cut the driver off however they managed to get in before him. Once further ahead the passenger noticed the driver tailing them closely. After a while they notice a police car and gesture them to come over to the car they share the information that the driver is either unwell or drunk. The police make the decision to follow the mysterious driver while he slowly drives away. ",
    "18": "We were going to the baseball diamond, and the High School.  And we were driving up 25th, and we come to an intersection where this guy is coming from 24th.  And he tries to get in right in the median, where people turn from you know.  And I think \"you jerk\" but I manage to get in front of him.  Then we head up 25th, up the hill, by Egg Ranch.  And this guy, looks to be middle fifties, is right on my tail.  Lisa looked back there and said \"He's right on your tail!\"  And sure enough, we're basically bumper to bumper.  And he can't keep his truck straight, in and out of the lane.  So I think he must be drunk.  And all I can think is how drunk driving is the number one killer on the roads.  And how it's everyone's responsibility.  That or maybe he's having a medical problem, like a heart attack.  I just know it would kill me if I read in the papers the next day about a guy dying from a heart attack on the road.  He could be having a heart attack and here I am thinking he's drunk.  So I feel like I have to do something.  We're coming up to a stop sign and I decide that when I stop, I'm going to get out and go see what's going on.  Either he's drunk or having a medical problem, and I decided I needed to help.  I don't really want to get involved but I feel like I have to.  So I stop at the stop sign.  And across the intersection, a police car has pulled up.  So I wave him over, and I get out of the car.  And I tell the deputy that either this guy behind me is drunk or having a definite medical problem because he's swerving across the lanes.  But the driver saw me get out and talk to the deputy, and now he's stopped way back, far back from my car.  Ha ha.  Then as the deputy is walking down there to talk to him, he starts backing up.  And then he pulls a u turn, and the police car follows him.  But he's going real slow and careful down the road.  It was quite comical.  I don't know if they ever managed to pull him over.",
    "19": "A guy and his friend, Lisa, were driving to a ball game. They were on Highway 24. While on the highway, a guy pulls out in front of the into the median of the road. He completely blocks the highway. The driver manages to get around him, and then Lisa says he is right on their tail. The driver sees that he is driving erratically. They are near \"Ranch Eggs\" when the driver sees a stop sign ahead. He sees that there is a cop car ahead and figures he will get the attention of the cop. He is concerned that the driver might be drunk and that this it is everyone's responsibility to take action. He really didn't want to get involved but he decided he was going to anyway. He thought maybe the driver was drunk or sick, perhaps having a heart attack. He didn't want to hear on the news that a person died of a heart attack and that he did nothing. He calls the cop over to his car and tells him the other driver has a problem and could be drunk or sick. The other driver had stopped a ways back from his car. The cops approach the other car and they guy does a u-turn and drives cautiously away. The police followed. The guy didn't know if he was ever caught but found the whole thing funny.",
    "20": "About a month ago, the protagonist was heading to a church league softball game near Homestead High School. While driving, a man in his 50s pulled out and nearly blocked his lane. The guy then followed closely, weaving erratically. The protagonist suspected he might be drunk or sick, so when they reached a stop sign and spotted a sheriff, he reported the man. The driver tried to back up when the cops approached, but they chased him. Not sure if they ever caught him.\n\n\n\n\n\n\n",
    "21": "They were on their way to a church baseball game at diamond. A car was blocking the road and people had to go around the car. When they finally got to go around the car, the car that was blocking the road started following them. They were riding the cars butt and swerving all over the road. The driver thought that maybe the other driver was drunk or something bad was happening like him having a heart attack. The driver decided that at the stop sign he was going to get out and see what the other drivers problem was. When he got to the stop sign he noticed a police officer and waved him over. He told the cop that the car behind him was either drunk or something was wrong with him. The other driver then started to back away and tried to get away from the cops. ",
    "22": "Driver with Melanie was driving on a highway , somewhere near twenty four when a guy was blocking the highway, he then proceeded to follow them and driver was concerned as to whether he was drunk or having a heart attack so stopped the sheriff . ",
    "23": "There is a lady driving in the road with her friend Lisa. they recall that two months ago they were supposed to go and watch a softball game. As they are driving they realize that someone is driving suspiciously close to them. Lisa even said he was on their tail. He was very close such that it was bumper to bumper. They continued on the road and turned onto the road called twenty-four and the man followed them still. They realized that he was weaving and could not keep to one side of the road, he was nor keeping to his lane. At this point they thought the he was either drunk or sick for example having a heart-attack. They called the cops on him and as he saw police approaching his car he had parked at a distance, he started driving on reverse. The cops started chasing him and this is were the story ends as the two ladies also never got to know if the police caught up with the driver.",
    "24": "something about a guy on his way to a game and hes stuck in traffic, then something about a driver driving erratically. Narrator is wondering whether he is drunk or having a medical emergency. Ends up talking to a cop about it.",
    "25": "I was driving to a baseball game with Lisa when a middle-aged man pulled up into the lane beside me.  He was angry I did not let him into my lane so he blocked a lane and then proceeded to tailgate me for several miles.  As we approached our destination I got to a stop sign and saw a police car.  When I got out of my car to tell the police about his erratic driving the other driver backed up down the road.  The police chased the other driver but I am not sure they ever caught up with him.",
    "26": "they were going to a baseball game with Lisa..a car stopped in the middle of the highway and almost rear-ended them...then at first they thought maybe he was drunk because of how he was driving..then he felt bad and thought he may be having a heart attack. The guy was reversing into them now -They called the police and told them he was either drunk or having a heart attack as first he was on their bumper then he was reversing into them.\n\nThe police arrive and the car in question now slows down and drives normal -",
    "27": "I was heading to the church softball field ... \n\nTo be honest, all I can remember is that they were driving to the game. A guy pulled out and blocked traffic on 24 highway and they went around. He started following them and got right up on his bumper but he was weaving in and out of the lane. The first driver thought he should stop at the next stop sign and find out what the other drivers problem was. He thought he was either drunk or sick. Once he stopped, he noticed a sherriff in his car and signaled him over. He told the officer what was going on and the officer started towards the other car. The driver of that car threw it in reverse and started backing down the road with the officer following him. He then slammed on his brakes and changed gears and moved forward. The officer did a U-turn and continued to follow the driver. By the way, there was a girl named Lisa in the car with the original driver.",
    "28": "The speaker and a woman are in a car driving. They pass by a car that is stopped at an intersection at a stop sign on 24th street. A man around his 50s is driving the car. The man and woman pass the other driver and keep driving. The car then comes up behind them and the woman tells the speaker that the other car is driving really close, bumper-to-bumper. Also the other car is also swaying side to side, very dangerously. The speaker recalls thinking that the driver of the car behind them might be drunk, or maybe having a medical emergency. So the speaker decides to confront them the next time they come up to a stop sign. When they arrive at an intersection, the driver spots a police car on the other side of the road. The speaker gets out of the car and catches the police's attention and explains to them the reckless driving the other car is doing. The other car is suddenly going very slowly, and then starts reversing when the speaker is speaking to the police. The police then go back to their car and try to catch up to the reckless driver. The speaker doesn't know if the police every caught the reckless driver or not.",
    "29": "Heading to a baseball game in a church league, I'm heading down 24 headed to Ranch Eggs diamond and this car starts to pull out onto the highway.  He eventually blocks the entire highway and I get around him.  Eventually he's tailgating me and following me really close like bumper to bumper.  Even Lisa says \"He's trying really close to you.\"  He also begins to weave around the road and I think at this point that he's probably drunk. I was about to dismiss them but then I think that maybe they're sick or having a heart attack.  I'd to read the paper the next day and realize he died because he had a heart attack.\n\nAs soon as we reach the next intersection at a stop sign I see a sheriff's car across the road and get out to tell them that I think the guy behind me is either drunk or sick as he was weaving all over the road while tailgating me.  The sheriff starts walking to the car behind me and he slowly starts reversing back down the highway.  The sheriff gets in their car and starts down the road, and the other driver put his car in drive and starts slowly moving forward.  The sheriff does a U-turn and at that point I'm not sure what happened with the driver.",
    "30": "A guy is heading to a church softball game at Homestead School with his friend Lisa when he encounters a person driving poorly and sometimes following him on the 24.He is concerned this person may be drunk or possibly sick, maybe even a heart attack. When coming across a sherrif car he informs them.The sherrif attempts to follow as the suspect drives slowly and true. The man did not ever find out what the situation was.",
    "31": "You were driving to the softball league along highway 24. This guy starts weaving between traffic and starts to follow you. Your friend Lisa is in the car who also thinks that this guy is following you. You don't know if he is drunk or having a heart attack so you decide to stop and check it out. As you stop you notice a police sheriff so you get him to come over and explain to him. They then notice that the guy has reversed slowly down the road and as they follow he starts to drive normally. \n",
    "32": "This is a story about how there were these two individuals who were going to a church softball game(not sure if I am right). They were in the car on their way to the game when they had issues on the road with an elderly man who seemed to have been drunk driving or sick? The man could not stay in one lane and was going over towards their car. The narrator talks about trying to get away from the man by going up a hill. The man seems to follow them to the point he was bumper to bumper with them. The narrator talks to the passanger called lisa and tells her that they suspect that the man is drunk or might be experiencing a heart attack. The narrator thinks of ways to help this man as they did not want the man to get hurt or appear in the headlines as someone who got hurt. They look around and see a sherriff' car not too far. They try to go towards the sherriff. The narrator gets out the car and tells the sherriff what is going on. They see the car of the man slowing down,the sherriff goes into their car and chases after the man and the story ends there. ",
    "33": "Someone was on their way to a softball game a highschool, something to do with a twenty fourth? They were waiting for a space but there was bad traffic and someone cut them up. THey drove on and the person that cut them up started following them, driving dangerously and tailing them. They thought this person was either drunk or sick so decided at the next traffic light they would stop and get out and check. When they hit the next light there was a police car there so they called the police over and explained what was happening. THe car that was tailing them saw the police and reversed to go the other way, driving overly slowly and overly cautiously now they knew they were being watched. The story teller never found out whether they were stopped by the police or not. ",
    "34": "A couple were at a baseball game and then left. They went to highway 44 and came across a strange driver who tailgated them.when they had a chance to hail a police car they did. The police then investigated.",
    "35": "They were going to a church baseball game at the diamond and were on Highway 24. A guy blocked the highway and the narrator moved into the median before the guy. The guy then followed the narrator down the road to the diamond about a mile or two past Ranch Eggs. The guy was swerving and the narrator thought he was drunk or sick. Lisa pointed out the guy was really close. The narrator stopped at a stop sign and motioned the cops over.",
    "36": "There were driving to a church softball league game at the Diamond at Homestead High. They were driving up 22 and were about to make a turn near Egg Ranch (?) when a guy pulled across into the median and started blocking the 24. They noticed that the guy must have a problem. They first thought he must be drunk but then thought he might be sick - having a heart attack or something. They didn't want to read in the paper that a guy had died of a heart attack when they could have done something by checking so they decided they would check out what was happening even though they didn't want to get involved. They said to Lisa who was in the car that the guy behind them had some problem and couldn't stay on one side of the road. They made a decision to stop at the stop sign a mile or 2 down the road and get out the car and see what was happening in the car behind. When they got to the stop sign a police patrol car pulled up on the opposite side at the same time so they waved the Deputy over. They explained to the Deputy that the guy in the car behind seemed to either be drunk or sick as they were unable to keep their vehicle on one side of the road. When they got out the car to speak to the Deputy they noticed the other car had stopped a ways back and was now slowing reversing back down the road away from them. The police car then drove towards them and they pulled a U turn and drove away faster. The story narrator never found out what happened to them. ",
    "37": "We were on our way to a softball league game. Pulling up twenty four interstate. They see another driver behind them who they suspect was ill or drunk. Call the sheriffs over to try and stop they man as they didnt want to be known as the person who did nothing. The sheriff trys to signal them down but they go into reverse and then forward after it was comical.",
    "38": "Driving to a softball game, I came across another car driving erratically. I wasn't sure if the driver was drunk or sick, but I knew I had to do something. I spoke to the police who headed towards the other car which had stopped in the road. The other car noticed and started reversing before turning around and driving away slowly and carefully while being followed by the police. I don't know what became of that car, or its driver.",
    "39": "two months ago on a Sunday i was driving for a game and we passed a car He was sitting right there in the middle of the highway so when the traffic cleared i went ahead and was getting near diamond close to twenty four, then we noticed he was following us bumper to bumper. I didn't notice at first but my friend Lisa drew my attention to it. \nI kept my eye on him so that he doesn't bump into me. He kept driving crazy, moving from one lane to another. I had a lot of thoughts about drunk driving and how it can cause accidents and i thoughts he is definitely drunk. However, my mind kept bugging me and i though again , he could be ill or having a heart attack. either ways i need to check on him to prevent any mishap. I didn't want to feel guilty if something happened so i made up my mind to truely check. \nSuddenly i saw the sheriffs car and i signal them to come over. when they did i told them that something was wrong with the guy behind me. \nlike he was drunk or ill.\napparently when i stopped he also stopped a few miles behind me. \nwhen hey were approaching him he reversed, the kept following him and he kept reversing until they had him backed in a corner, when he realized he was being cornered he started driving forward , they had to do a U-turn and start a pursuit of him. \nTill date i don't know if they stopped or caught him. \n",
    "40": "It's the story of a guy that's driving to go attend a softball game. While he's driving on road Twenty-Four, he meets another driver driving very dangerously. That driver is constantly moving between the lanes and following his car too closely. The guy isn't sure if the dangerous driver is drunk or sick, and if he is sick he would feel bad if something bad happened to him. So he goes to see the cops for help and they start chasing the dangerous driver. The person telling the story doesn't know if they ever caught him.",
    "41": "About a month ago see we were going to a church league softball game Theyd had the games all scheduled for the diamond at Homestead High School You know where that's at? Well we're going up Twentyfour and getting ready to turn there, at Ranch Eggs, and I was slowing down, got my turn signal on, and as I was slowing down, there's this guy sitting over here to the right, coming on to Twentyfour Looked like he's about in his middle fifties And he starts creeping out onto Twenty-four and he's blocking off the lane and he's heading for the same spot that I'm going You know how you sit there and wait for the traffic to get by Right there in the median? This guy starts, pulls out in the lane, I thought you jerk but I hurried up and got in there ahead of him And he sits there and waits on Mean he's got Twenty-four blocked He's sitting there right in the middle of the highway Got it blocked So we went on across as soon as traffic cleared, and we're headed up there towards that diamond, and it's about maybe mile, two miles north of Twenty-four on Aboite Center, and this guy's following us see, as we're going up there this hill there At Ranch Eggs We're going up this hill and this guy's right on my tail And Lisa was with me and she said That guy is right on your tail I looked in the mirror and sure enough he's right up there practically bumper to bumper, and I'm trying to keep an eye on him, make sure he doesn't slam into me or anything He starts weaving back and forth, couldn't keep it in one lane Reallybad news And all the time this is going on I'm thinking how drunk driving is the number one killer of kids and all this business How it everybodys responsibility So I was trying to make up my mind what to do I was pretty sure he was drunk at least he appeared that way so I figured that when we get up to this stop sign I'm going to go back and find out what his problem is cause I'm thinking hes drunk and I know I oughta do something about it, but at the same time if he's sick, like maybe he's having a heart attack or something, you know You gotta do something I'd really feel bad if I read the papers the next day that the guy, some guy died with a heart attack and there I was thinking he was drunk And I didn't really want to get involved to be honest with you But I had made up my mind that I was going to, so we pulled up to the stop at this sign, and right across the road stopped a sheriff's car So I motion for him to come over, and they whip across the road, and I got out the car, walked over there, and said to this deputy This guy behind me is either sick or he's drunk, but he's got a problem He can't keep his car on one side of the road And I said He's got a definite problem So they started down there And as soon as he sees me get out of the car and walk over there to the police car, the guy stops way far away from the intersection He stops, and he throws his car into reverse, and starts backing up When the cops went down there to check him out, he starts backing up going backwards down that road Pretty soon they catch up with him, and he starts forward again, and they make a U-turn in the road and start following him and hes just driving real slow and careful Haha it's pretty funny I don't know if they ever stopped him or not",
    "42": "There is an individual driving on the road with someone named lisa. They are headed to a baseball game. They are on road 24 when the see a driver in his 50s driving strangely. The driver appears to change lanes at some point and ended up tailgaiting the person witnessing. The main character is concerned of whether the driver is drunk or has a health issue. He spots a sheriff and explains the situation. The driver then reverses and avoids the cop. The sheriff follows after him.",
    "43": "Some people went to see a league softball game. A guy in his 50s came and blocked, I presume some traffic. It was linked to ranch eggs. Them the guy was near them, bumper to bumper. A driver thought he was drunk and was worried he may get a heart attack. A police car is then seen.",
    "44": "About a month ago we were driving up to the Junior baseball game, up Twenty-Four, there is this guy trying to turn left turn left onto the road. So we wait for him to turn but he gets about half way across before the lights change and he's stuck in the middle of the road, right on the median. Anyways we drive through quickly to get ahead of him and when the traffic starts again he begins to follow us real close up Twenty-Four. Lisa was in the car with me and she says \"that guy is following real close\", and I look back in the rear-view mirror and she's right. He's weaving this way and that across the lanes and sticking real close to us all the way up Twenty-Four. We go a mile, maybe two and I'm starting to think about drunk drivers and how they're the biggest cause of death to kids and whatnot, because I'm thinking this guy must be drunk to be driving like this. I think I'll stop at the next light and get out and go back there and see what'a up, give him a piece of mind, but then I wonder if he's actually sick and if I want a confrontation after all. I'd hate it to read the paper the next day and hear about a guy dying of a heart attack on the highway and I had done nothing about it. Anyway, my mind was made up and I was going to go back there when we pull up at a stop sign and there's a police car on the other wide of the road, so I call them over. They swing across the road and I get out and say \"that guy back there is either drunk or sick, but he can't keep his car in his lane at all\". They turn the cruiser around and head over to him, and he has stopped a ways up the road. He starts to back up slowly when he sees the police coming towards him, then he starts forward again and drives real slow like back along the road. I don't know whether they ever caught him or what was what haha but it sure was a strange thing.",
    "45": "A driver and her companion, Lisa, were going to a baseball game a month or so ago. They were driving along HWY 24. As they drove, another car began tailgating them. This car was weaving and at one point it stopped in the middle of the road, blocking all the cars that were behind it. The original driver thought she had gotten away from the tailgater but he reappeared. She feared he was either drunk or having a heart attack and stopped her car, concerned. A police (sheriff) car was across the road. She approached asking for the sheriff's help. He, in turn, went after the other car which backed away. The sheriff did a U turn and the other car began driving forward in a careful manner. The original driver was amused seeing how well the tailgater was now driving, as he was being followed by the sheriff. She did not find out what transpired afterwards.",
    "46": "Someone was driving trying to merge onto the highway when a driver pulled out and blocked him and then started driving erratically, following too close and appearing to be either drunk or sick. The storyteller stopped, and told a sherrif what was happening and the bad driver, went in reverse and drove away slowly",
    "47": "Some people were driving and saw a potentially drunk driver cut in to traffic and drive erratically.  ",
    "48": "About a month a go a guy ..came through and we passed coming on to twenty four looked about turning to fifty and he knew he was heading where I wanted to park. So he is sitting there right there in the middle of the road so he went on across as soon as traffic cleared and we headed up two miles and the guy followed us. The guy is on my tail bumper to bumper I'm watching him to make sure he doesn't back on me and he is stuck really bad. All of the time this is happening I was trying to make up my mind and I was going to go back and figure his mind because he seemed drunk. I really felt bad reading that the guy had to die with a heart attack, I walked out of the car and reported that this guy was drunk and he couldn't keep his car. The cops went there to check him out ,they checked out on him he was just driving pretty slow and that was bad news....",
    "49": "i was going to church someone was driving drunk look like in his fifty look ",
    "50": "While driving to a church league softball game, the narrator encountered a driver who appeared to be intoxicated. After observing the driver blocking traffic and weaving dangerously close behind them, they decided to alert law enforcement. Upon reaching a stop sign, they saw a sheriff's car and informed the deputy about the erratic driver. As the police approached, the suspect noticed and began to back away from the intersection, leading to a slow chase as the officers followed him. The situation highlighted concerns about drunk driving and the narrator's internal conflict about intervening for safety reasons.\n",
    "51": "They were heading to an event for the diamond at Homestead High School, going on twenty-four. They spot a strange man on the road, creeping around and acting strange. They then realised that this man was following them, and was almost touching their bumper just a mile or two away from Ranch Eggs. They spot a nearby sherif and tell them about this guy, how he has a problem and could be drunk. The guy sees them approach the sherif and backs up, reversing the car away and driving off. The sherif hops into their car and starts to chase after them. After the guy did previously speed away, they start to act normal and drive normally. They never found out if they pulled him over or not. ",
    "52": "Someone was driving with someone named Lisa down the highway (Twenty-four?), going to a baseball game. They had a driver blocking the highway as they wait to turn. They go first, the driver is behind them, swerving back and forth. The speaker thinks the guy is either drunk or having a heart attack so they go slow and see a cop. They call the cop over and tell them the vehicle behind them may be drunk so the cops go off towards the car. The car reverses down the road, then does a U-turn and drives slow and careful. ",
    "53": "\nthe story was about a man who was followed by a car that drove as if the driver was drunk or having a heart attack",
    "54": "A man was with a woman named Lisa. He was driving on highway 24 on the way to a church softball league game at Homestead High School. On the way there, near Ranch Eggs, the man encountered what appeared to be a drunk driver or a man that was having a heart attack. The alleged drunk driver pulled out into the middle of the highway median. After the man going to the softball game passed the drunk driver, the drunk driver appeared to be following him down the high way and swerving in the lanes. Eventually the man found a sherif and told them what was going on. However, from far back, the drunk driver saw the police and tried to reverse from them. Then the police made a u-turn and the drunk driver started going forward. The main character from the story wasn't sure what ended up happening to the drunk driver after that.",
    "55": "I was going to the church leads football game and a man in his mid thirties is blocking the lines. His tail to tail and bumper to bumper. I think he is drunk but he might be having a heart attack. I don't want to accuse him of being drive and then finding out when reading the news he was having a heart attack. When reaching the stop sign, I saw a sherrif and called him over and told him that this man is either drunk or having a heart attack he is swerving in both lanes. The sherrif follows him.",
    "56": "There was a game we were heading to at a school Homestead High. A vehicle cut infront of us on the highway he was driving recklessly, heading the same way we went. I thought to myself I have to do something about the way this guy was driving.There were many reports of kids dying because of drunk driver. Turns out he was having a heart attack and not driving drunk.",
    "57": "The couple, man and wife Lisa are heading to a softball game at the diamond.  Whilst driving near the church a man is driving eratically,blocking the highway.  They overtake him, but he starts to tailgate them, weaving in and out of lanes. They think he might be drunk but are not 100% sure.  They flag a police patrol car, when the driver of the erratic car notices, he reverses and takes a minor road to try escape.  The police car heads in pursuit, but the behaviour of the car changes and it stops driving eratically.",
    "58": "About month ago, Well we are going twenty four, Coming on to twenty four, and he's lending for the same place, I am hurried got in the waits, got it blocked, there maybe mile or two, at ranch eggs, and Lisa was with me, and I'm trying to keep, couldn't keep in lane, how it's everybody responsibility, so I figured Ii out, you gotta do something, he's gotta go",
    "59": "Going to some baseball games at Homestead High school, going on the 24. Theres a guy waiting to pull out who wants to edge out. I sneak ahead of him at the intersection and head on up the hill. He pulls into the lane behind me and then is riding my tail. Lisa who is in the car with me, says he's right on your tail. I think he might be drunk. He then starts weaving, and I'm not sure whats going on. I decided I'm going to stop and check it out at the next stop sign. We stop, there's a sheriff and i motion him over. Say this guy is drunk or sick. The guy starts backing up, turns around and drives off slwoly. The cops follow.",
    "60": "Headed to a church league baseball game. Started driving and going up the twenty four but there's a guy that that can't stay in his lane. Kept weaving in and out. With a friend named Lisa. Soon enough they're tailgating the speaker, almost bumper to bumper. They recall the number one cause of death in kids is drunk driving. The speaker is pretty sure he's drunk. Or otherwise very sick since he can't stay on one side of the road. They get off the twenty four and think that something should be done about that car, since they would feel horrible if the other driver wasn't drunk but instead was having a heart attack or were ill and found out about them in the news the next day. Found a sheriff's car and told them about the encounter. The suspected drunk driver saw them get off and speak with the people in the sheriff's car and stopped far away. Then reversed and started to go backwards. They then started to go very slowly. Never found out if the sheriff's car caught up with them and never heard about it again.",
    "61": "IT'S ABOUT A GUY WHO WAS BEING FOLLOWED BUMPER TO BUMPER BY ANOTHER CAR, HE INITIALLY THAUGHT THE GUY WAS EITHER SICK OR DRUNK CAUSE HE COULDN'T STAY IN HIS LANE SO HE STOPPED BY A SHERIFF WHERE HE EXPLAINED WHAT WAS GOING ON BUT WHEN THE POLICE STARTED GOING AFTER HIM HE STARTED DRIVING IN REVERSE.",
    "62": "You jerk\nRanch eggs\nGot twenty four blocked",
    "63": "The story is a about a suspected drunk driving incident where the initial interaction with the alleged drunk driver estimated to be in his mid-fifties pulls out and blocks the road on the highway. After realizing the drunk driver blocked the road, the storyteller then indicates they and their passenger, Lisa, waited for it to clear a bit before getting out of there from the situation with the drunk driver. As they were going along their way, Lisa indicates that the drunk driver is following them, to which the storyteller confirms. The suspected drunk driver started driving erratically. This was where the storyteller started suspecting the drunk driver to be drunk and made a comment about drunk driving needs to be the responsibility of all of us. The storyteller then starts to question if the person is truly a drunk driver and not someone who is in medical duress. The storyteller then chooses to intervene to ensure that if the other driver was indeed in medical duress, they did not deny them help through hasty judgement. The storyteller pulls up to the stop sign where there was a sheriff signaled the sheriff car over, got out of their car and made their way to the sheriff car to tell them what has been happening with the erratic driving behind them. As soon as the suspected drunk driver saw this, he stops far away from them and starts reversing away from the cops. The cops went for him and soon caught up with him. The drunk driver then threw his car car into drive and started going very slow, causing the cops to make a U-turn and go after him. The story teller says it was comical and does not know if the cops ever stopped the suspected drunk driver.",
    "64": "A group was on a route to a church league softball game about a month ago at Homestead High School. Driving down a highway called Twenty-four, they noticed a man in his fifties blocking the lane as he attempted to turn. After passing him, they noticed he was following them too closely, swerving back and forth. They became concerned that he might be drunk.\n\nGetting nervous, they decided to call a passing sheriff's car as they approached a stop sign. They told him what was going on, showing further back down the road, where the man was driving recklessly. In an instant, the man spotted the deputies and backed down the road, making it a silly scene. The deputies chased after him but weren't quite sure if they had any cause to actually arrest him or find out what the problem was.\n",
    "65": "Uhh. Some guy is going to a baseball game or something. He's at a intersection and another car is being weird. The other car is riding his bumper. He's got a woman named Lisa with him. He thinks the other guy is drunk or sick or something. He stops and tells a cop about it and then the guy pulls off and the cop starts chasing him.",
    "66": "About a month ago, we were heading to a church league softball game. The games were all set to be played at the diamond at Homestead High School. Do you know where that is? Well, we're driving up Route 24, getting ready to turn near Ranch Eggs, and I'm slowing down, signaling to turn. As I'm slowing down, there's this guy sitting off to the right, getting ready to merge onto Route 24. He looked like he was in his mid-fifties. He starts inching out onto the road, partially blocking the lane, aiming for the same spot I was headed to. You know how you wait in the median for traffic to pass? This guy pulls into the lane, and I thought, \"What a jerk...\" but I sped up and got in front of him. He stayed put, blocking Route 24, right in the middle of the road. Once the traffic cleared, we crossed over and continued toward the diamond, which is about a mile or two north of Route 24 on Aboite Center Road. But this guy starts following us. As we're heading up the slight hill by Ranch Eggs, he's tailing us closely. Lisa was with me, and she said, \"That guy is right on your bumper!\" I checked the rearview mirror, and sure enough, he was almost touching my car, so I kept an eye on him to make sure he didn’t hit us. He started swerving, unable to stay in one lane. It was pretty alarming. The whole time this was happening, I kept thinking about how drunk driving is the leading cause of deaths for kids and how everyone has a responsibility to do something. I was pretty sure the guy was drunk—or at least acting like it—so I decided that when we got to the stop sign, I was going to see what was going on. Maybe he was drunk, but then again, what if he was sick, like having a heart attack or something? I knew I had to act, but I didn’t want to get involved if I didn’t have to. Still, I made up my mind. When we pulled up to the stop sign, there happened to be a sheriff’s car parked across the road. I motioned for the officer to come over, and they quickly drove across. I got out of my car, walked over to the deputy, and said, \"The guy behind me is either sick or drunk, but he’s got a problem. He can't stay in his lane.\" I told him, \"Something’s definitely wrong.\" So they headed toward the guy. As soon as he saw me get out and walk to the police car, he stopped way back from the intersection, put his car in reverse, and started backing up. When the cops went to check on him, he kept backing down the road. Eventually, they caught up, and he started driving forward again. The officers made a U-turn to follow him, and now he was driving real slow and carefully. Ha ha, it was kind of funny... I don’t know if they ever caught him.",
    "67": "The story is about an observant driver who noticed another driver's erratic driving, while he was going for a league game. The observant driver notified the police- a sheriff's car, even though he was uncertain what could have caused the abnormal driving. The observant driver was not sure if it could be due to drunk-driving, or the erratic driver could be suffering from a heart attack. As the vehicle slowed down, and cops walked up to investigate what the problem was, the erratic driver suddenly put the vehicle in reverse and started moving down the road, and also stated moving forward but this time in a slow manner while he was being followed by police vehicles.",
    "68": "A young person was trying to get onto Twenty-four off the highway, when a car was blocking the way. Instead they decided to go another way to get to their destination, and all of a sudden the car that was blocking the road started to follow them. The car was constantly up their tail, bumper to bumper, borderline crashing into them. The person thought to themself, maybe he's drunk or having a heart attack. Suddenly, he sees a police car on the side of the road, and he stops and signals the police to come over. He states that the man who was following him was driving back and forth, and can't keep in the same lane. He states that he must have been drunk or sick. The car that was following them starts to slowly reverse back when they notice the police. The police begin to follow the retracting car, and the narrator doesn't know if they ever caught up to them.",
    "69": "a couple was going to a baseball game and on their way there was a car on highway 24 that was blocking the road by the median. The couple passed the car and the car followed them and tailgated them while swerving. The driver told his partner, Lisa, that he was going to stop at the stop sign up ahead and he was going to go back and approach the driver to see if he was either drunk or if he was sick (having a medical emergency). When the couple approached the stop sign they noticed a police officer and got out of their car to inform him of what had happened. The car behind them noticed this and stopped down the road. The police officer went down to speak to the driver but the driver started to reverse the car, until the police officer was able to catch up. Once the officer caught up the driver started driving forward again, really slow and really carefully in a very comical way.",
    "70": "A month ago, this guy was heading to his church's softball. As he drives a man in his fifties seems to be following him. This old man follows him bumper to bumper as the two women in the car agrees. As the guy is driving, the old mans drives from lane to lane and seems to be drunk. The driver is concerned and worried that the old man is maybe having a heart attack or something. The driver was hesitant but decided to stop and talk to a sheriff, who followed the old man. The old man made a U turn and ended up following the roads rules.",
    "71": "About a month ago we were going to a church league softball game. They'd had the games all scheduled for the diamond at Homestead High School. You know where that's at? well we're going up Twenty-four, and getting ready to turn there, at Ranch Eggs. You know how you sit there and wait for the traffic to get by? Right there in the median? This guy starts, pulls out in the lane, i thought \"you jerk\" but i hurried up and got in there ahead of him. Couldn't keep it one lane. I figured that when we get up to this stop sign I'm going to go back and find out what his problem is, 'cause i'm thinking he's drunk and i know i oughta do something about it but at the same time if he's sick, like maybe he's having a heart attack or something you know. you gotta do something. Pretty soon they catch up with him, and he starts forward again, and they make a U--turn in the road to follow him but he's just slowly driving and being careful. I don't know if they ever stopped him or not.",
    "72": "about a month ago we were going to see a church softball game, the games were near twenty-four, as we were on the way there was a guy who was in his middle fifties, he was blocking the highway. on the way there was a driver who was driving really close to me, basically bumper to bumper, he appeared to be drunk so i told a police officer about him, that he was either unwell or drunk",
    "73": "Some guy was going somewhere.. Homestead and he was driving and there was a guy in the median but he thought the he guy was drunk but what if he wasn't drunk and had a heart attack and the guy didn't want to hear on the news that he thought drunk guy was actually heart attack guy so he went back to check and lots of other words...omg",
    "74": "The story is about a guy and someone named Lisa. They were driving around, and I think they spotted a dangerous driver on the highway that they were driving on. He was driving, the erratic probably drunk driver all over the road, and in the median of the highway. He talked about, with some concern, that the driver, was driving all the road dangerously and that is perhaps the number one killer of children. Lisa was able to see the driver as well in the car. Also I think that the police were involved and pulled over the driver. He may have talked also to the guy describing his personal driving story. The person describing the story in the end seemed that he thought the incident that he viewed passing old high school, and on to the highway viewing the dangerous driver he though was a bit funny and concerning. This is what I can recall.   ",
    "75": "There was going to be a church softball game that a lady and her friend were going to, at the intersection a man started chasing them swirling all over the road and he couldn't keep the car straight. While all this is happening our lady driver(I can't recall her name)starts to think to herself that this man must be drunk or sick, and she thinks about how drunk driving is the number one cause of deaths on the road. She also thinks to herself that if the man is having a hard attack then she will feel bad for calling him a drunk. Deciding to take action and find out what the man's problem is she spotted the sheriff's car and decided to get them involved. The man had something to hide because he made a ridiculous attempt to get away from the police. We do not know if he was caught or not in the end.",
    "76": "They were heading to a baseball game, in a car, when some guy pulled out on them on the Twenty Four.  He appeared to be driving erratically which made them (the narrator and Lisa) think that the driver was either sick or drunk.  Concerned about the safety of others, particularly children, they stopped at an intersection and beckoned over a sheriff to check on the driver.  When the sheriff approached the vehicle, the drive first began to reverse away, and when caught, began to drive forward to evade the sheriffs.",
    "77": "On a sunny day the church baseball league went up the 24th at Meadowview",
    "78": "a lady was walking down the road and saw a guy following her was not sure if he was drunk or sick  and she made up her mind to approach him to ask what his problem was and just as she was about to do that, a sheriff's car stopped the guy and she told the Sheriff to check on the guy if his sick or drunk and she was scared in case his sick and having a heart attack and dies if she can hear this the following day about it then she would really feel bad knowing she could have done something about.",
    "79": "Driving in the car up to play softball up twenty four, sat waiting at a junction, this man in another car isn’t moving, then he basically blocks all of the intersection with his car, so I managed to get in front of him. \nDriving up twenty four, I can see him in the mirror swerving from side to side not being able to stay in the right lane. I keep looking back thinking that drunk drivers are the number one killers. Then I start to question if he’s drunk or poorly? Maybe sick? While driving and keeping an eye on the guy in the back, how am I going to stop him. When I get to the next Stop sign I’m going to get out and see if he’s okay. When I reach the stop sign I see a police car I ask them over and tell them about he guy behind and don’t know if he’s drunk driver or sick, the cop walks to his car and he puts it in reverse back down the hill.. the cops are after him I’m not sure if they caught him, I carried on my journey ",
    "80": "four people decided to attend a softball game and this writer comes across a drunk man and this lady could sense something was off about him. whilst she was driving she came across a sheriff car and informed them that the man was either very sick or very drunk the lady then recalled how much drink driving impacts drivers and victims",
    "81": "They were going to a softball game and they were going onto a highway and the guy started driving erratically in front of them. He came to a stop at one point and blocked the highway (I think it was 24) and meant that they couldn't get around him. He continued driving erratically and he was worried about the car crashing into him and causing an accident. He was initially convinced that he was drunk but then wondered if he was ill and felt guilty. He flagged down a nearby sheriff's car and explained the situation. They started following him and he initially stopped a way away. He then went into reverse and they had to do a U turn before he continued driving slowly and carefully.",
    "82": "my laptop froze",
    "83": "We were going to a church league soft ball game scheduled at Homestead  High School. You know where that is? We are going to Twenty Four, and also going at Ranch eggs getting ready. There is this guy seated on the right. On the median the guy starts. So we went across as soon  as traffic cleared we headed towards diamond. The guy kept following us .I was with Lisa and she said\" that guy is on your tail. I looked in the mirror. The guy seemed like he was drunk but he was having a heart attack",
    "84": "He was on his way to Homestead to play ball.  He went up Highway 24.  Another car was merging on to the highway and slowed down.  He managed to get ahead of the car, but the car stayed in the middle of the highway slowing down the traffic.  Then the slowed car sped up and he was on his tail.  His passenger was named Lisa and mentioned that the car was on his tail. He continued on Highway 24 towards the field.",
    "85": "A lady who went for a game observed that she's being followed by a man who she assumed is either sick or drunk. With her ongoing thought about causes of road accident and negative happenings on the road she was worried and concerned about the man's driving attitude. she explained to the local sheriff about this happening when she got her chance then the man/driver desist and take off leading to a chase.",
    "86": "Somebody was driving to a church league softball game, where they had to turn onto the 24. They went to pull out, but another car did at the same time. He beat them to the spot in traffic, and the other car was blocking the road. He then carries on driving and the car follows him, very close. Then he decides to stop and see what his deal was, in case he was drunk or sick. He beckons a sheriff over at the stop sign and the car reverse down the road, before going forward when the sheriff caught them. We don't know if they got pulled over.",
    "87": "a guy and his friend lisa are going to a softball game at the diamond. Whilst driving there a gentleman from the side road tries to jump in by pulling out but their car goes ahead filling the gap, meaning the other guys car is blocking opposing traffic on the 29th street. this guy then proceeds to follow their car very closly and is bumper to bumper with them. they notice he is also swerving between lanes. they consider the idea he is possibly drunk, the driver thinks of the amount of teenagers that die due to drink driving and also considers the driver may be having a medical issue. they decide at the next stop sign they will stop and see what the guys issue is. As he would feel bad if tomorrow he found out the guy passed due to a medical issue and they could have checked and helped. They find a sheriffs car parked opposite the road when they stop and so they approach the sherrif and inform them of the drivers driving and that they believe he may be having a medical issue or may be drunk. the second driver (the one who may be drunK) hasnt reached the same point as their car but sees them talkinig to the police and starts to reverse back down the road. the police cars follows down aand follows the car which has now slowed down and is driving at a suitable speed and a sensible manner.",
    "88": "A man is driving down 24, headed to a ball game, past an egg place.  He has a passenger named Lisa with him. A Driver in another vehicle is blocking traffic. The first vehicle passes him.  Then, the second driver approaches from behind at a fast pace.  He is swerving back and forth.  The first driver decides he is going to stop at a stop sign and approach the other driver to find out what his problem is.  He suspects either drunk driving or a medical problem.  Just then, a Sherriff stops across the road.  The driver in the first vehicle approaches the sheriff and explains the situation.  The sheriff then starts following the vehicle, which initially was going in reverse.  The vehicle then started going forward and the sheriff made a U-turn and continued pursuing the vehicle.  The man lost track of the pursuit after that.",
    "89": "About a month ago we were going to a church softball game. There's a driver blocking the intersection. This whole time I'm thinking, drunk driving is the number one killer of children. I saw the sheriff and told a deputy that the guy behind me is either sick or drunk but he has a problem. He can't keep his car in the lane. The deputy starts driving towards the man and the driver starts driving backwards down the hill. When the deputy gets near him, the driver starts going forward slowly. HAHA, it's pretty comical. I don't know if they ever stopped him or not.",
    "90": "We were driving to a little league baseball game at Homestead High on the 24 highway. I was expecting to turn at Ranch Eggs. I pulled to the median to wait for my turn and just then another guy in a car wanted to turn as well. There was no room for him on the median so I took my chance and made the turn ahead of him onto Aboite Road. For some reason, he followed me too closely, weaving behind me and staying close on my tail. Even my wife Lisa commented on this. There was obviously something wrong with him. Maybe he was ill, or drunk and he could be a danger to other people. I made up my mind to stop at the next Stop intersection coming up and get out of the car to try and discuss this with him. When I stopped, I noticed a police car on the other side of the road, and I motioned to them and expressed my concern. When the other driver saw the police, he started to back down the highway. The police followed him, saw him reverse again and progress very slowly ahead again. They followed him again and they all eventually disappeared. I never found out whether they caught up with him",
    "91": "I was driving down the highway to Homestead. As I was driving down the highway, I was about to turn right onto Twenty Four. When across from me, I saw a car with a man in his middle fifties. He was blocking the highway. Eventually he moved and I was able to turn right onto Twenty Four. Lisa was in the car with me, in the backseat, and she said \"He's tailing you!\" So I looked back, and sure enough, the man was behind me, bumper to bumper. I kept driving, while looking back to make sure the man didn't slam into me. The man was weaving left and right, he couldn't stay in one direction. So I thought, \"drunk driving is the number one killer of kids!\" I thought that the man might be drunk. I figured that when I reached the next stop sign, I would turn around and go back to see what that man's problem was. Because I wasn't sure if he was drunk or just sick. Maybe he was having a heart attack or something. I would've felt really bad if I saw in the news that a man died of a heart attack while driving and I didn't do anything to help even though I was there. When I reached the intersection I saw a police car parked at the other side of the street. I waved to the police car, and it drove over to me. I told the deputy, \"There's a man driving behind me, I don't know what his deal is, but I think he might be drunk or sick or something. Because he can't stay in one direction, he keeps driving into the opposite lane.\" The deputy went down the street to look for the man. When the man reached the intersection and saw me, he stopped his car and then started going in reverse. He began to drive forward again, with the police car following behind him. The man was driving slowly and carefully now. I'm not sure if the police car ever stopped him.",
    "92": "Two persons were going to a church softball game, the main character and Lisa. On the way there a guy was blocking the freeway with their car. Later another car was acting weird not staying in lane and tailgating. The main character was suspecting that they are either drunk or having a heartattack. So he stops to inform a sheriff about it but the car tailgating tries to avoid the cops.",
    "93": "I was on my way to a church league baseball game that was organised by a high school at the diamond and had to get on ranch eggs and the twenty four. I noticed a driver in the car behind me, he was middle aged around 50, and when I started driving he was behind me. I had Lisa in the car with me and she said the man was right on my tail. He was driving really close behind me and I thought that he might be drunk. I know drink driving is one of the biggest killers of kids and I knew I had to do something. But then I started to wonder if maybe he wasn't drunk but sick, that he might have a heart attack or something and I'd see in the papers he'd died. So I thought I had to do something. I saw a patrol car and stopped; I went over the the police and voiced my concerns about the driver. By this point the driver had stopped a way away and then began reversing slowly. The police started following him and he began to drive forward again in a comical way.",
    "94": "About a month ago while going to a church league softball game, it was at homestead high school up at twenty four. While trying to turn at ranch egg there was a guy sitting there. He's about his middle fifties and he blocks the lane. I thought you jerk and he got twenty four blocked. While the traffic cleared about a mile or 2 north of twenty four and this guy is following us as we're going up this little hill and my friend Lisa said this guy is on your tail and i looked in the mirror and saw him and he's following bumper to bumper and i make sure he doesn't hit me. He sways from one lane to the other and I think of how drunk driving is the number one killer of kids. I tried to make up my mind on what to do. He appeared drunk. When I get to the stop sign I'll try to find out. He may be drunk or having a heart attack. I knew i will feel bad if i saw the news that a man died in a heart attack while i thought he was drunk. We saw a deputy and i approached him and told him that driver is maybe drunk or sick. And when the man saw me walk up to the deputy, he reversed and went backwards and the deputy followed. Then he turned and the deputy did a u turn. Then he started driving slowly. I don't know if he was caught but it was really comical to watch. ",
    "95": "About a month ago we were going to church game. They had the game scheduled for the diamond at Homestead high school. We went up twenty four and getting ready to turn at ranch eggs slowing down for signal and this guy sitting on right coming to twenty four looking in middle fifties. He blocked the lane and heading for the spot I'm going. know how you sit waiting for traffic to get by. The guy starts pulling out in the lane and I thought \"you jerk\" but I hurried and got ahead of him. The guy sits in the middle of the highway blocked. we went down soon the traffic cleared heading towards the diamond about two miles north of twenty four anfd the guy is following us up the hill at ranch eggs. Lisa said the guy is right on my tail. I looked in the side mirror and the guy was there bumper to bumper and I tried to keep an eye on him making sure he doesn't slam on me. he waves back and forth unable to keep in one lane. all this time I think how drunk driving is the number one killer of people and how it's everybody's responsibility, trying to make up my mind on what to do. I was sure he was drunk on how he appeared and figured when we get to stop sigh I'm going back and find out his problem because I think he was drunk and I had to do something. or maybe he has heart attack you have to do something. it'd be bad if I see the papers of the guy died of heart attack. I had made up my mind so I pulled at the sign i walked and reported him. after he saw me going to police he throws his car and runs away.the police start chasing him",
    "96": "A person is on their way to the church softball game on 24th ave. On the way there, they notice a car blocking the highway, so they take a detour. Suddenly an eratic driver begins following them, tailgating very closely. This makes the driver nervous, so they pull over. Once pulled over the other driver does as well further back. A sheriff car is nearby, so the driver flags them down and tells them about the eratic driver, that they are possibly intoxicated or in need of medical assistance. Suddenly the eratic driver shifts it in reverse and takes off. The sheriff follows suit.",
    "97": "I heading to church to the softball game, as they have them all arranged and was driving down the twenty four, when a male in his mid 50's pulls onto the highway, we were stuck for a second whilst traffic cleared but when it did i pulled off into the right lane, the man followed me and he got really close to my bumper, and Lisa said how close he was to the bu,per, I thouht he was drunk because he couldn't keep his car straight he was weaving and really close, then there was a stop sign coming up and i thought i will get out at the stop sign and go and check on him because even though i think he's drunk and drink driving is the biggest killer i also thought he may be sick and i didn't want to read about a man having a heart attack in his car and not have done anything. When we approached the stop sign i saw a police car and waved the depty over, i got out my car and approached the police and told then he was weavng around and he's probably drunk and when the went to approach him he started reversing back down the hill and the police followed him and when they caught up he started driving foward real slow and sensible and they followed i wonder if they caught up with him. ",
    "98": "about a month ago see we were going to a church league we had scheduled for high school and i was slowing down to turn signal theres this guy to the right looked like hes about middle fitties and head heading for the same spot im going right there in the median but i hurried up and got there ahead of him sitting there right in the middle of the highway north of twenty four about centre at ranch eggs were going up this hill and this guys on my tail i looked in the mirror and sure enough hes right up it make sure he doesnt slam into me or anything im thinking how drunk driving is the number one killer of kids so i was trying to make my mind up what to do so i figured when we get up to this stop sign ill ask him what his problem like maybe hes having a heart attack or something some guy died with a heart attack and there i was thinking he was drunk but i had made up my mind that i was going to so we pulled up at the stop sign and seen the sheriff so i told him this guy behind me cant keep his car on the road his got a problem and as soon as he sees me call the sheriff he drives off when the cops went down there to check him out he starts backing up going backwards down the road and then starts forward again and just driving real slow i dont know if they ever stopped him or not",
    "99": "I was driving towards the church softball tournament with Lisa and we were driving along 24 when I saw this guy trying to pull out on me, well I wasn’t having that so I accelerated and managed to get in front of this guy who was now partially blocking the street. I carried on my way along 24 when I noticed this guy was now following me only he was weaving from lane to lane and driving very erratically. \nHe got me worried now and I commented on this to Lisa and figured the guy could be drunk and that’s pretty dangerous as the main cause of deaths among kids is drunk drivers. \nI saw a stop sign up ahead and thought to myself I’m going to stop here and see what’s going on with this guy. \nMy first thought was that he was drunk but he could be having a heart attack or be really sick and I’d feel pretty bald if I didn’t check on this guy and then read the news that a guy had collapsed and died and I could have done something to help him. \nSo I stop at the Stop sign and get out of my car and notice a sheriff’s vehicle on the other side of the intersection. \nI go over to the sheriff and explain the situation and tell him he needs to go and check on the guy behind me who is acting strange and is either drunk or sick. \nMeanwhile the guy behind saw me going to talk to the cop and starts backing down the road away from the cop, the cop keeps heading toward him and the guy keeps backing has car really slowly and carefully away from the cop. \nI never did find out what happened and if the cop ever managed to catch up with him.  ",
    "100": "People are driving to church softball game at Homestead High School. They are driving up twenty four and some vehicle in front of them starts trying to turn to where they are going but is blocking off the entire intersection. Eventually, they go past the vehicle, which then starts erratically following them, swerving all over the road. They dxecide to pull over and see a sheriff's vehicle, when they then call over and talk to about the other vehicle which is being driven erratically, mentioning that the driver mxight be drunk. The cops then chase the vehicle, which backs up in reverse, and then starts driving forwards, only to then switch back into reverse, etc. The narrator doesn't know if they ever caught the driver."
  },
  "segmentation": "1. About a month ago see we were going to a church league softball game...\n2. They'd had the games all scheduled for the diamond at Homestead High School.\n3. You know where that's at?\n4. Well we're going up Twenty­-four,\n5. and getting ready to turn there, at Ranch Eggs,\n6. and I was slowing down,\n7. got my turn signal on,\n8. and as I was slowing down,\n9. there's this guy sitting over here to the right,\n10. coming on to Twenty­-four.\n11. Looked like he's about in his middle fifties.\n12. And he starts creeping out onto Twenty-four\n13. and he's blocking off the lane,\n14. and he's heading for the same spot that I'm going.\n15. You know how you sit there and wait for the traffic to get by?\n16. Right there in the median?\n17. This guy starts,\n18. pulls out in the lane,\n19. I thought \"you jerk\"...\n20. but I hurried up and got in there ahead of him.\n21. And he sits there and waits on.\n22. Mean he's got Twenty­-four blocked.\n23. He's sitting there right in the middle of the highway.\n24. Got it blocked.\n25. So we went on across as soon as traffic cleared,\n26. and we're headed up there towards that diamond,\n27. and it's about ... maybe mile, two miles... north of Twenty­-four on Aboite Center,\n28. and this guy's following us see,\n29. as we're going up there this little hill right there.\n30. At Ranch Eggs.\n31. We're going up this hill,\n32. and this guy's right on my tail.\n33. And Lisa was with me,\n34. and she said “That guy is right on your tail!”\n35. I looked in the mirror and sure enough he's right up there practically bumper to bumper,\n36. and I'm trying to keep an eye on him,\n37. make sure he doesn't slam into me or anything.\n38. He starts weaving back and forth,\n39. couldn't keep it in one lane.\n40. Really ...bad news.\n41. And all the time this is going on...\n42. I'm thinking how drunk driving is the number one killer of kids and all this business.\n43. How it's everybody's responsibility.\n44. So I was trying to make up my mind what to do.\n45. I was pretty sure he was drunk...\n46. at least he appeared that way...\n47. so I figured that when we get up to this stop sign I'm going to go back and find out what his problem is,\n48. 'cause I'm thinking he's drunk,\n49. and I know I oughta do something about it,\n50. but at the same time if he's sick,\n51. like maybe he's having a heart attack or something,\n52. you know.\n53. You gotta do something.\n54. I'd really feel bad if I read the papers the next day that the guy,\n55. some guy died with a heart attack and there I was thinking he was drunk.\n56. And I didn't really want to get involved to be honest with you.\n57. But I had made up my mind that I was going to,\n58. so we pulled up to the stop at this sign,\n59. and right across the road stopped a sheriff's car.\n60. So I motion for him to come over,\n61. and they whip across the road,\n62. and I got out the car,\n63. walked over there,\n64. and said to this deputy “This guy behind me is either sick or he's drunk,\n65. but he's got a problem.\n66. He can't keep his car on one side of the road.”\n67. And I said “He's got a definite problem...”\n68. So they started down there.\n69. And as soon as he sees me get out of the car and walk over there to the police car,\n70. the guy stops way far away from the intersection.\n71. He stops,\n72. and he throws his car into reverse,\n73. and starts backing up.\n74. When the cops went down there to check him out,\n75. he starts backing up going backwards down that road.\n76. Pretty soon they catch up with him,\n77. and he starts forward again,\n78. and they make a U­-turn in the road and start following him,\n79. and he's just driving real slow and careful.\n80. Ha ha it's pretty comical...\n81. I don't know if they ever stopped him or not.",
  "recalls segmented": {
    "0": "1. Someone and their partner were driving on Twenty Four\n2. to a softball game at the church,\n3. when they noticed a guy was tailing their car.\n4. They tried to lose him,\n5. but he continued tailing them.\n6. However, the other guy crashed his car,\n7. and he didn't move.\n8. Not wanting to leave the man to die,\n9. though, they called the police,\n10. who turned up soon enough.\n11. The other man drove off\n12. and was never caught.",
    "1": "1. A man was in the car\n2. with a woman named Lisa,\n3. going to watch a softball game\n4. driving down the Twenty-Four.\n5. A man in his mid fifties was pulling in\n6. from somewhere\n7. blocking the road\n8. with his car on the Twenty-Four\n9. when the driver in the car with Lisa drove in\n10. and overtook him.\n11. The man in his mid fifties began following their car\n12. bumper to bumper,\n13. swaying between the two lanes on the road.\n14. The driver and Lisa thought the man was either drunk,\n15. which led him to think about how drunk driving is a major killer of young people on the roads,\n16. or the man was either sick\n17. having a heart attack or something similar.\n18. The driver didn't want to somehow read the papers the next day\n19. and find out the mid fifties man had actually suffered a heart attack\n20. and died as a result,\n21. thinking he was actually just drunk driving.\n22. Soon they see a Sheriff nearby while driving\n23. and so he waves to the sheriff to get his attention\n24. and pull over\n25. and tells him about the mid fifties man following them\n26. and that he's either sick or drunk\n27. and to go check on him.\n28. As soon as the deputy approaches the mid fifties man's car\n29. he begins to put his car in reverse\n30. and go backwards as quickly as possible.\n31. The driver and Lisa appear humoured\n32. and not knowing whether the police had ever caught or reached the man in his fifties.",
    "2": "1. About a week ago I was headed to a softball game at Homestead Diamond put on by my church.\n2. I was driving down Twenty-Four\n3. and was waiting to turn,\n4. but a car started going for the spot at the same time.\n5. I quickly drove past him\n6. and he just stayed stopped blocking the highway.\n7. Then the driver started following us.\n8. I was with my friend Lisa\n9. and she said the vehicle was right on my tail, like almost bumper to bumper.\n10. And he was driving all over the place\n11. and not staying in his lane.\n12. I thought for sure he was drunk,\n13. and that I should turn around and confront him.\n14. But then I thought that he could also have a medical problem, like maybe he was having a heart attack,\n15. and I didn't want to read the news the next day\n16. and see that someone died while having a heart attack\n17. and I could have done something to help them.\n18. Part of me also didn't want to do anything\n19. but by then, I had already made up my mind to confront him.\n20. Then I saw a sheriff on the other side of the road,\n21. so I stopped and motioned for him to come over.\n22. I told the sheriff that the man behind me was driving erratically\n23. and couldn't stay on one side of the road,\n24. and that he was either drunk or having a heart attack,\n25. but was having some kind of problem.\n26. When I stopped to talk to the sheriff\n27. the driver of the vehicle stopped a ways down the road.\n28. Then when the sheriff drove after him, he started driving the road in reverse.\n29. Then the driver turned the car around\n30. and started driving the right way,\n31. with the sheriff following.\n32. He was driving really slow\n33. and it was such a funny thing to witness.\n34. I'm not sure if the sheriff ever stopped the driver of the vehicle.",
    "3": "",
    "4": "1. About a month ago a man was going to play softball near a church\n2. and was travelling with his wife in their car\n3. when they turned on highway 24\n4. a man in a car behind them was also trying to turn at the same time\n5. and was following them\n6. and weaving about in the road behind them.\n7. He thought the man was drunk or ill\n8. and was going to go back to the car behind him\n9. when they stopped at the next junction.\n10. He saw a police car\n11. and waved the officers over\n12. and told them about the man\n13. and they went down the road to investigate.\n14. The driver turned his car around\n15. and the police followed him.\n16. The man did not know if the man was caught by the police or not.",
    "5": "1. On their way to a softball event at the diamonds,\n2. the main character was driving on 24 lane or road.\n3. He has a girl named Lisa in the car.\n4. Another man stops at the intersection\n5. and blocks off traffic.\n6. The main character goes past\n7. and the man follows.\n8. The driver behind them is driving weirdly\n9. so the main character assumes he is drunk.\n10. Then he assumes he is maybe sick\n11. and should check him out in case the newspaper says a man had a heart attack\n12. and the main character could've helped.\n13. The MC stops the car,\n14. spots a sheriff’s car,\n15. and calls them over.\n16. He tells the deputy to check the other driver out.\n17. When the driver saw the MC talking to the police,\n18. he reversed,\n19. the police followed.\n20. Then he went forward\n21. and the police had to make a u-turn.\n22. The MC thought this was comical.\n23. He wasn't sure if the other driver was caught or not.",
    "6": "1. We were going up to twenty four\n2. when this guy around the age of 50 starts following me\n3. bumper to bumper,\n4. at first I didn't take it serious\n5. but he was too close that I was worried\n6. that he might hit me.\n7. I decided that at the next intersection I am going to confront him,\n8. I mean what if he is drunk\n9. and major accidents are caused by drunk driving\n10. and he can't even keep to one lane.\n11. I didn't want to get involved\n12. but I have to,\n13. also what if he is having a heart attack,\n14. I don't want to read on the news that he died\n15. while I could have done something about it.\n16. At the next stop sight I jumped out\n17. and informed a sheriff about him,\n18. \"that man is either drunk or is having a health problem,\n19. he has been following me for a while now\n20. and he can't keep on his lane.\"\n21. Seeing that I was talking to the police\n22. he stopped way far\n23. and started reversing\n24. and the police started chasing him.",
    "7": "1. A driver and their passenger named Lisa are driving to a baseball game on Egg Ranch Hill.\n2. On the way, another driver attempts to cut them off on the 24 highway.\n3. The other driver proceeds to drive erratically behind them.\n4. At first, the driver assumes he is drunk.\n5. It's his responsibility to report it.\n6. The driver then considers he may be sick.\n7. Possibly having a heart attack.\n8. The driver fears he will regret not doing anything if the man is sick.\n9. He hears about it after-the-fact.\n10. He decides to stop and confront him.\n11. When only a few miles from the baseball diamond, the driver spots a sheriff.\n12. He stops to speak with him.\n13. He addresses his issues with the other driver.\n14. As the other driver nears, he spies the sheriff.\n15. He turns his car, driving away.\n16. The sheriff proceeds after him.\n17. The other driver now driving cautiously.\n18. The driver does not know what happened after that.",
    "8": "1. A person was driving\n2. and [they] turned right at the Egg Road house.\n3. Then [they] noticed a person was driving poorly behind them\n4. and they started to either think\n5. ‘this guy is drunk’\n6. or ‘[this guy is] having a heart attack.’\n7. Since they didn't want to read the newspaper tomorrow\n8. and see ‘man died of heart attack’\n9. she flagged down the cops\n10. to let them know that ‘this guy has a problem’\n11. and then the poor driver started to drive backwards\n12. and eventually the police caught up to them.\n13. [I am] not sure what happened to the guy in the end\n14. though, but it was funny!",
    "9": "1. All I can remember is drink driving\n2. number 24\n3. he was blocking with his car\n4. and that drink driving is the main cause\n5. of driving related deaths",
    "10": "1. A vernacular encounter in the USA\n2. with a possibly drunk driver,\n3. involving the police.\n4. There was no conclusion.",
    "11": "1. Someone and a girl named Lisa are on their way to a church softball game.\n2. They're near highway\n24.\n3. There's a man in his mid-fifties.\n4. That is edging out.\n5. And blocking the intersection.\n6. The guy and Lisa manage to get out ahead of him.\n7. Then they notice that the older man is behind them.\n8. And he is driving really close to them.\n9. And cannot maintain a lane.\n10. They think that he is either drunk or sick.\n11. He doesn't really want to stop.\n12. But also doesn't want to hear about a man dying.\n13. Because he was sick.\n14. And he didn't help them.\n15. So they're about to pull over.\n16. And they see a sheriff's car.\n17. Which they wave down.\n18. They tell the Sheriff that the man behind them is either sick or drunk.\n19. When the man behind them sees the Sheriff.\n20. He puts his car in reverse.\n21. And starts backing away.\n22. Then he drives away.\n23. With the Sheriff after him.\n24. The storyteller and Lisa never found out if the man was caught.\n25. And there was something about Ranch Eggs.\n26. Which I didn't understand.",
    "12": "1. They were going to a church diamond league softball game at the high school\n2. and they were going up 24\n3. and they were getting ready to turn at the ranch eggs.\n4. They put on their turn signals\n5. and went over.\n6. There was a guy in his mid fifties\n7. who was blocking the lane\n8. and headed to the same spot as they were going\n9. and they said you jerk\n10. and they got ahead of him.\n11. The guy who was blocking the lane starts following them\n12. and Lisa the friend said, \"This guy is on your tail.\"\n13. He starts weaving back and forth\n14. and this lead him to thinking the guy could be a drunk driver\n15. and how it is the number 1 killer of kids\n16. and that it is everyone's responsibility to report drunk driving.\n17. Then he thinks maybe they were having a heart attack\n18. and that he would feel guilty if he read the paper\n19. and saw a man had died of a heart attack\n20. and then he motioned at the police to come towards him.\n21. He then tells the police that the guy behind him is either drunk or sick.\n22. As the police moved towards him,\n23. the guy started backing away.\n24. The police pursued him\n25. but don't know what the result was.",
    "13": "1. The driver was driving somewhere,\n2. with someone called Lisa,\n3. and there was another car ahead,\n4. blocking the junction,\n5. holding up the traffic.\n6. Somehow the driver of this car ended up behind the first driver\n7. and he was weaving in and out.\n8. The first driver was concerned that the other driver was drunk,\n9. or ill,\n10. and he was concerned about an accident happening.\n11. He pulled up by some police officers (sheriffs)\n12. and told them what had happened.\n13. They then went back down the road\n14. to speak to this other driver\n15. but he then reversed his car back down the road,\n16. did a u-turn\n17. and then proceeded to drive very slowly.\n18. The first driver found this funny\n19. and wondered whether the police ever got to speak to the other driver.",
    "14": "1. Going to the baseball diamond\n2. on ranch eggs.\n3. Took the twenty four.\n4. There was an erratic driver\n5. swerving and blocking traffic\n6. in the median.\n7. Went to report him\n8. and once the sheriffs started following him\n9. he started driving more carefully.",
    "15": "1. I was driving\n2. and a person was driving erratically\n3. and I thought the person was drunk\n4. but then thought maybe they're having a medical emergency.\n5. I got the sheriff's attention\n6. and it was pretty comical.",
    "16": "1. When I was going to a church football game\n2. I saw a guy driving a car.\n3. He stopped at a junction and blocked it.\n4. He could not seem to keep on one side of the road.\n5. I thought he must be drunk\n6. and wanted to get away from him,\n7. then I thought, what if he is sick?\n8. I would feel terrible to read in the newspaper tomorrow\n9. that he had died from a heart attack\n10. and I had done nothing about it.\n11. Just then I spotted a sheriff's car,\n12. so I went over to him\n13. and told him that the guy in the car down the road was either drunk or sick\n14. as he could not keep his car on one side of the road.\n15. As soon as the guy in the car saw me walking over to the sheriff's car\n16. he started reversing.\n17. The sheriff drove towards him.\n18. The guy started driving carefully.\n19. The sheriff followed him.\n20. I have no idea if they ever stopped him or not.",
    "17": "1. There was a person driving on the freeway\n2. and [they were] heading to a hill\n3. when they noticed a suspicious driver.\n4. He started by attempting to cut the driver off\n5. however they managed to get in before him.\n6. Once further ahead,\n7. the passenger noticed the driver tailing them closely.\n8. After a while,\n9. they notice a police car\n10. and gesture [to] them to come over.\n11. [To] the car they share the information that the driver is either unwell or drunk.\n12. The police make the decision to follow the mysterious driver\n13. while he slowly drives away.",
    "18": "1. We were going to the baseball diamond,\n2. and the High School.\n3. And we were driving up 25th,\n4. and we come to an intersection where this guy is coming from 24th.\n5. And he tries to get in right in the median,\n6. where people turn from you know.\n7. And I think \"you jerk\"\n8. but I manage to get in front of him.\n9. Then we head up 25th,\n10. up the hill,\n11. by Egg Ranch.\n12. And this guy, looks to be middle fifties, is right on my tail.\n13. Lisa looked back there and said \"He's right on your tail!\"\n14. And sure enough, we're basically bumper to bumper.\n15. And he can't keep his truck straight,\n16. in and out of the lane.\n17. So I think he must be drunk.\n18. And all I can think is how drunk driving is the number one killer on the roads.\n19. And how it's everyone's responsibility.\n20. That or maybe he's having a medical problem, like a heart attack.\n21. I just know it would kill me if I read in the papers the next day about a guy dying from a heart attack on the road.\n22. He could be having a heart attack and here I am thinking he's drunk.\n23. So I feel like I have to do something.\n24. We're coming up to a stop sign\n25. and I decide that when I stop,\n26. I'm going to get out\n27. and go see what's going on.\n28. Either he's drunk or having a medical problem,\n29. and I decided I needed to help.\n30. I don't really want to get involved\n31. but I feel like I have to.\n32. So I stop at the stop sign.\n33. And across the intersection, a police car has pulled up.\n34. So I wave him over,\n35. and I get out of the car.\n36. And I tell the deputy that either this guy behind me is drunk or having a definite medical problem\n37. because he's swerving across the lanes.\n38. But the driver saw me get out and talk to the deputy,\n39. and now he's stopped way back, far back from my car.\n40. Ha ha.\n41. Then as the deputy is walking down there to talk to him, he starts backing up.\n42. And then he pulls a u turn,\n43. and the police car follows him.\n44. But he's going real slow and careful down the road.\n45. It was quite comical.\n46. I don't know if they ever managed to pull him over.",
    "19": "1. A guy and his friend, Lisa, were driving to a ball game.\n2. They were on Highway\n24.\n3. While on the highway, a guy pulls out in front of them.\n4. He completely blocks the highway.\n5. The driver manages to get around him.\n6. Lisa says he is right on their tail.\n7. The driver sees that he is driving erratically.\n8. They are near \"Ranch Eggs\" when the driver sees a stop sign ahead.\n9. He sees that there is a cop car ahead.\n10. He figures he will get the attention of the cop.\n11. He is concerned that the driver might be drunk.\n12. He is concerned that this is everyone's responsibility to take action.\n13. He really didn't want to get involved.\n14. He decided he was going to anyway.\n15. He thought maybe the driver was drunk or sick.\n16. He thought perhaps he was having a heart attack.\n17. He didn't want to hear on the news that a person died of a heart attack.\n18. He didn't want to hear that he did nothing.\n19. He calls the cop over to his car.\n20. He tells him the other driver has a problem.\n21. He tells him the other driver could be drunk or sick.\n22. The other driver had stopped a ways back from the car.\n23. The cops approach the other car.\n24. The guy does a u-turn.\n25. The guy drives cautiously away.\n26. The police followed.\n27. The guy didn't know if he was ever caught.\n28. The guy found the whole thing funny.",
    "20": "1. About a month ago,\n2. the protagonist was heading to a church league softball game near Homestead High School.\n3. While driving,\n4. a man in his 50s pulled out\n5. and nearly blocked his lane.\n6. The guy then followed closely,\n7. weaving erratically.\n8. The protagonist suspected\n9. he might be drunk or sick,\n10. so when they reached a stop sign\n11. and spotted a sheriff,\n12. he reported the man.\n13. The driver tried to back up\n14. when the cops approached,\n15. but they chased him.\n16. Not sure if they ever caught him.",
    "21": "1. They were on their way to a church baseball game at diamond.\n2. A car was blocking the road.\n3. People had to go around the car.\n4. When they finally got to go around the car,\n5. the car that was blocking the road started following them.\n6. They were riding the car's butt.\n7. [They were] swerving all over the road.\n8. The driver thought that maybe the other driver was drunk.\n9. [The driver thought that] something bad was happening like him having a heart attack.\n10. The driver decided that at the stop sign he was going to get out.\n11. [The driver decided] to see what the other driver's problem was.\n12. When he got to the stop sign,\n13. he noticed a police officer.\n14. [He] waved him over.\n15. He told the cop that the car behind him was either drunk.\n16. [He told the cop that] something was wrong with him.\n17. The other driver then started to back away.\n18. [The other driver] tried to get away from the cops.",
    "22": "1. Driver with Melanie was driving on a highway,\n2. somewhere near twenty four\n3. when a guy was blocking the highway,\n4. he then proceeded to follow them\n5. and driver was concerned\n6. as to whether he was drunk or having a heart attack\n7. so stopped the sheriff.",
    "23": "1. There is a lady driving in the road\n2. with her friend Lisa.\n3. They recall that two months ago\n4. they were supposed to go and watch a softball game.\n5. As they are driving\n6. they realize that someone is driving suspiciously close to them.\n7. Lisa even said he was on their tail.\n8. He was very close\n9. such that it was bumper to bumper.\n10. They continued on the road\n11. and turned onto the road called twenty-four\n12. and the man followed them still.\n13. They realized that he was weaving\n14. and could not keep to one side of the road,\n15. he was not keeping to his lane.\n16. At this point they thought\n17. that he was either drunk or sick\n18. for example having a heart-attack.\n19. They called the cops on him\n20. and as he saw police approaching his car\n21. he had parked at a distance,\n22. he started driving in reverse.\n23. The cops started chasing him\n24. and this is where the story ends\n25. as the two ladies also never got to know\n26. if the police caught up with the driver.",
    "24": "1. Something about a guy\n2. on his way to a game\n3. and he's stuck in traffic,\n4. then something about a driver\n5. driving erratically.\n6. Narrator is wondering\n7. whether he is drunk\n8. or having a medical emergency.\n9. Ends up talking\n10. to a cop\n11. about it.",
    "25": "1. I was driving to a baseball game with Lisa\n2. when a middle-aged man pulled up into the lane beside me.\n3. He was angry\n4. I did not let him into my lane\n5. so he blocked a lane\n6. and then proceeded to tailgate me for several miles.\n7. As we approached our destination\n8. I got to a stop sign\n9. and saw a police car.\n10. When I got out of my car to tell the police about his erratic driving\n11. the other driver backed up down the road.\n12. The police chased the other driver\n13. but I am not sure\n14. they ever caught up with him.",
    "26": "1. they were going to a baseball game with Lisa\n2. a car stopped in the middle of the highway\n3. and almost rear-ended them\n4. then at first they thought maybe he was drunk\n5. because of how he was driving\n6. then he felt bad\n7. and thought he may be having a heart attack\n8. The guy was reversing into them now\n9. They called the police\n10. and told them he was either drunk or having a heart attack\n11. as first he was on their bumper\n12. then he was reversing into them\n13. The police arrive\n14. and the car in question now slows down\n15. and drives normal",
    "27": "1. I was heading to the church softball field\n2. To be honest, all I can remember is that they were driving to the game\n3. A guy pulled out and blocked traffic on 24 highway\n4. and they went around\n5. He started following them\n6. and got right up on his bumper\n7. but he was weaving in and out of the lane\n8. The first driver thought he should stop at the next stop sign\n9. and find out what the other driver's problem was\n10. He thought he was either drunk or sick\n11. Once he stopped, he noticed a sheriff in his car\n12. and signaled him over\n13. He told the officer what was going on\n14. and the officer started towards the other car\n15. The driver of that car threw it in reverse\n16. and started backing down the road\n17. with the officer following him\n18. He then slammed on his brakes\n19. and changed gears\n20. and moved forward\n21. The officer did a U-turn\n22. and continued to follow the driver\n23. By the way, there was a girl named Lisa in the car with the original driver",
    "28": "1. The speaker and a woman are in a car driving.\n2. They pass by a car that is stopped at an intersection at a stop sign on 24th street.\n3. A man around his 50s is driving the car.\n4. The man and woman pass the other driver and keep driving.\n5. The car then comes up behind them,\n6. and the woman tells the speaker that the other car is driving really close, bumper-to-bumper.\n7. Also, the other car is also swaying side to side,\n8. very dangerously.\n9. The speaker recalls thinking that the driver of the car behind them might be drunk,\n10. or maybe having a medical emergency.\n11. So the speaker decides to confront them the next time they come up to a stop sign.\n12. When they arrive at an intersection,\n13. the driver spots a police car on the other side of the road.\n14. The speaker gets out of the car\n15. and catches the police's attention\n16. and explains to them the reckless driving the other car is doing.\n17. The other car is suddenly going very slowly,\n18. and then starts reversing when the speaker is speaking to the police.\n19. The police then go back to their car\n20. and try to catch up to the reckless driver.\n21. The speaker doesn't know if the police ever caught the reckless driver or not.",
    "29": "1. Heading to a baseball game in a church league,\n2. I'm heading down 24 headed to Ranch Eggs diamond\n3. and this car starts to pull out onto the highway.\n4. He eventually blocks the entire highway\n5. and I get around him.\n6. Eventually he's tailgating me\n7. and following me really close like bumper to bumper.\n8. Even Lisa says \"He's trying really close to you.\"\n9. He also begins to weave around the road\n10. and I think at this point that he's probably drunk.\n11. I was about to dismiss them\n12. but then I think that maybe they're sick or having a heart attack.\n13. I'd to read the paper the next day\n14. and realize he died because he had a heart attack.\n15. As soon as we reach the next intersection at a stop sign\n16. I see a sheriff's car across the road\n17. and get out to tell them that I think the guy behind me is either drunk or sick\n18. as he was weaving all over the road while tailgating me.\n19. The sheriff starts walking to the car behind me\n20. and he slowly starts reversing back down the highway.\n21. The sheriff gets in their car\n22. and starts down the road,\n23. and the other driver put his car in drive\n24. and starts slowly moving forward.\n25. The sheriff does a U-turn\n26. and at that point I'm not sure what happened with the driver.",
    "30": "1. A guy is heading to a church softball game\n2. at Homestead School\n3. with his friend Lisa\n4. when he encounters a person\n5. driving poorly\n6. and sometimes following him\n7. on the\n24.\n8. He is concerned\n9. this person may be drunk\n10. or possibly sick,\n11. maybe even a heart attack.\n12. When coming across a sheriff car\n13. he informs them.\n14. The sheriff attempts to follow\n15. as the suspect drives slowly\n16. and true.\n17. The man did not ever find out\n18. what the situation was.",
    "31": "1. You were driving to the softball league along highway\n24.\n2. This guy starts weaving between traffic.\n3. [He] starts to follow you.\n4. Your friend Lisa is in the car.\n5. [Lisa] also thinks that this guy is following you.\n6. You don't know if he is drunk.\n7. [You don't know if] he is having a heart attack.\n8. [So] you decide to stop.\n9. [You decide] to check it out.\n10. As you stop, you notice a police sheriff.\n11. [So] you get him to come over.\n12. [You] explain [it] to him.\n13. They then notice that the guy has reversed slowly down the road.\n14. As they follow, [he] starts to drive normally.",
    "32": "1. This is a story about how there were these two individuals\n2. who were going to a church softball game (not sure if I am right).\n3. They were in the car\n4. on their way to the game\n5. when they had issues on the road\n6. with an elderly man\n7. who seemed to have been drunk driving or sick.\n8. The man could not stay in one lane\n9. and was going over towards their car.\n10. The narrator talks about trying to get away from the man\n11. by going up a hill.\n12. The man seems to follow them\n13. to the point he was bumper to bumper with them.\n14. The narrator talks to the passenger called Lisa\n15. and tells her that they suspect that the man is drunk or might be experiencing a heart attack.\n16. The narrator thinks of ways to help this man\n17. as they did not want the man to get hurt\n18. or appear in the headlines as someone who got hurt.\n19. They look around\n20. and see a sheriff's car not too far.\n21. They try to go towards the sheriff.\n22. The narrator gets out of the car\n23. and tells the sheriff what is going on.\n24. They see the car of the man slowing down,\n25. the sheriff goes into their car\n26. and chases after the man\n27. and the story ends there.",
    "33": "1. Someone was on their way to a softball game at high school,\n2. something to do with a twenty-fourth.\n3. They were waiting for a space,\n4. but there was bad traffic,\n5. and someone cut them up.\n6. They drove on,\n7. and the person that cut them up started following them,\n8. driving dangerously,\n9. and tailing them.\n10. They thought this person was either drunk or sick,\n11. so decided at the next traffic light they would stop,\n12. and get out,\n13. and check.\n14. When they hit the next light,\n15. there was a police car there,\n16. so they called the police over,\n17. and explained what was happening.\n18. The car that was tailing them saw the police,\n19. and reversed to go the other way,\n20. driving overly slowly,\n21. and overly cautiously now they knew they were being watched.\n22. The story teller never found out whether they were stopped by the police or not.",
    "34": "1. A couple were at a baseball game\n2. and then left.\n3. They went to highway 44\n4. and came across a strange driver\n5. who tailgated them.\n6. When they had a chance\n7. to hail a police car\n8. they did.\n9. The police then investigated.",
    "35": "1. They were going to a church baseball game at the diamond\n2. and were on Highway\n24.\n3. A guy blocked the highway\n4. and the narrator moved into the median before the guy.\n5. The guy then followed the narrator down the road to the diamond\n6. about a mile or two past Ranch Eggs.\n7. The guy was swerving\n8. and the narrator thought he was drunk or sick.\n9. Lisa pointed out the guy was really close.\n10. The narrator stopped at a stop sign\n11. and motioned the cops over.",
    "36": "1. There were driving to a church softball league game at the Diamond at Homestead High.\n2. They were driving up 22\n3. and were about to make a turn near Egg Ranch (?)\n4. when a guy pulled across into the median\n5. and started blocking the\n24.\n6. They noticed that the guy must have a problem.\n7. They first thought he must be drunk\n8. but then thought he might be sick -\n9. having a heart attack or something.\n10. They didn't want to read in the paper that a guy had died of a heart attack\n11. when they could have done something by checking\n12. so they decided they would check out what was happening\n13. even though they didn't want to get involved.\n14. They said to Lisa who was in the car that the guy behind them had some problem\n15. and couldn't stay on one side of the road.\n16. They made a decision to stop at the stop sign a mile or 2 down the road\n17. and get out the car\n18. and see what was happening in the car behind.\n19. When they got to the stop sign a police patrol car pulled up on the opposite side at the same time\n20. so they waved the Deputy over.\n21. They explained to the Deputy that the guy in the car behind seemed to either be drunk or sick\n22. as they were unable to keep their vehicle on one side of the road.\n23. When they got out the car to speak to the Deputy\n24. they noticed the other car had stopped a ways back\n25. and was now slowing reversing back down the road away from them.\n26. The police car then drove towards them\n27. and they pulled a U-turn\n28. and drove away faster.\n29. The story narrator never found out what happened to them.",
    "37": "1. We were on our way to a softball league game.\n2. Pulling up twenty four interstate.\n3. They see another driver behind them.\n4. Who they suspect was ill or drunk.\n5. Call the sheriffs over.\n6. To try and stop the man.\n7. As they didn't want to be known as the person who did nothing.\n8. The sheriff tries to signal them down.\n9. But they go into reverse.\n10. And then forward.\n11. After it was comical.",
    "38": "1. Driving to a softball game,\n2. I came across another car driving erratically.\n3. I wasn't sure if the driver was drunk or sick,\n4. but I knew I had to do something.\n5. I spoke to the police\n6. who headed towards the other car\n7. which had stopped in the road.\n8. The other car noticed\n9. and started reversing\n10. before turning around\n11. and driving away slowly and carefully\n12. while being followed by the police.\n13. I don't know what became of that car,\n14. or its driver.",
    "39": "1. Two months ago on a Sunday,\n2. I was driving for a game\n3. and we passed a car.\n4. He was sitting right there in the middle of the highway,\n5. so when the traffic cleared,\n6. I went ahead\n7. and was getting near diamond close to twenty-four,\n8. then we noticed he was following us bumper to bumper.\n9. I didn't notice at first\n10. but my friend Lisa drew my attention to it.\n11. I kept my eye on him\n12. so that he doesn't bump into me.\n13. He kept driving crazy,\n14. moving from one lane to another.\n15. I had a lot of thoughts about drunk driving\n16. and how it can cause accidents\n17. and I thought he is definitely drunk.\n18. However, my mind kept bugging me\n19. and I thought again,\n20. he could be ill or having a heart attack.\n21. Either way, I need to check on him\n22. to prevent any mishap.\n23. I didn't want to feel guilty if something happened\n24. so I made up my mind to truly check.\n25. Suddenly, I saw the sheriff's car\n26. and I signaled them to come over.\n27. When they did,\n28. I told them that something was wrong with the guy behind me,\n29. like he was drunk or ill.\n30. Apparently, when I stopped,\n31. he also stopped a few miles behind me.\n32. When they were approaching him,\n33. he reversed,\n34. they kept following him\n35. and he kept reversing\n36. until they had him backed in a corner.\n37. When he realized he was being cornered,\n38. he started driving forward,\n39. they had to do a U-turn\n40. and start a pursuit of him.\n41. Till date I don't know\n42. if they stopped or caught him.",
    "40": "1. It's the story of a guy\n2. that's driving to go attend a softball game.\n3. While he's driving on road Twenty-Four,\n4. he meets another driver driving very dangerously.\n5. That driver is constantly moving between the lanes\n6. and following his car too closely.\n7. The guy isn't sure\n8. if the dangerous driver is drunk\n9. or sick,\n10. and if he is sick\n11. he would feel bad\n12. if something bad happened to him.\n13. So he goes to see the cops for help\n14. and they start chasing the dangerous driver.\n15. The person telling the story doesn't know\n16. if they ever caught him.",
    "41": "1. About a month ago\n2. see\n3. we were going to a church league softball game\n4. They'd had the games all scheduled for the diamond at Homestead High School\n5. You know where that's at?\n6. Well\n7. we're going up Twenty-four\n8. and getting ready to turn there, at Ranch Eggs\n9. and I was slowing down\n10. got my turn signal on\n11. and as I was slowing down\n12. there's this guy sitting over here to the right\n13. coming on to Twenty-four\n14. Looked like he's about in his middle fifties\n15. And he starts creeping out onto Twenty-four\n16. and he's blocking off the lane\n17. and he's heading for the same spot that I'm going\n18. You know how you sit there and wait for the traffic to get by\n19. Right there in the median?\n20. This guy starts\n21. pulls out in the lane\n22. I thought you jerk\n23. but I hurried up\n24. and got in there ahead of him\n25. And he sits there\n26. and waits on\n27. Mean he's got Twenty-four blocked\n28. He's sitting there\n29. right in the middle of the highway\n30. Got it blocked\n31. So we went on across\n32. as soon as traffic cleared\n33. and we're headed up there towards that diamond\n34. and it's about maybe mile, two miles north of Twenty-four on Aboite Center\n35. and this guy's following us\n36. see, as we're going up there this hill there\n37. At Ranch Eggs\n38. We're going up this hill\n39. and this guy's right on my tail\n40. And Lisa was with me\n41. and she said\n42. That guy is right on your tail\n43. I looked in the mirror\n44. and sure enough\n45. he's right up there\n46. practically bumper to bumper\n47. and I'm trying to keep an eye on him\n48. make sure he doesn't slam into me or anything\n49. He starts weaving back and forth\n50. couldn't keep it in one lane\n51. Really bad news\n52. And all the time this is going on\n53. I'm thinking how drunk driving is the number one killer of kids\n54. and all this business\n55. How it everybodys responsibility\n56. So I was trying to make up my mind what to do\n57. I was pretty sure he was drunk\n58. at least he appeared that way\n59. so I figured that when we get up to this stop sign\n60. I'm going to go back and find out what his problem is\n61. cause\n62. I'm thinking he's drunk\n63. and I know I oughta do something about it\n64. but at the same time\n65. if he's sick, like maybe he's having a heart attack or something\n66. you know\n67. You gotta do something\n68. I'd really feel bad if I read the papers the next day\n69. that the guy\n70. some guy\n71. died with a heart attack\n72. and there I was thinking he was drunk\n73. And I didn't really want to get involved\n74. to be honest with you\n75. But I had made up my mind\n76. that I was going to\n77. so we pulled up to the stop\n78. at this sign\n79. and right across the road\n80. stopped a sheriff's car\n81. So I motion for him to come over\n82. and they whip across the road\n83. and I got out the car\n84. walked over there\n85. and said to this deputy\n86. This guy behind me is either sick or he's drunk\n87. but he's got a problem\n88. He can't keep his car on one side of the road\n89. And I said\n90. He's got a definite problem\n91. So they started down there\n92. And as soon as he sees me get out of the car\n93. and walk over there to the police car\n94. the guy stops\n95. way far away from the intersection\n96. He stops\n97. and he throws his car into reverse\n98. and starts backing up\n99. When the cops went down there to check him out\n100. he starts backing up\n101. going backwards down that road\n102. Pretty soon they catch up with him\n103. and he starts forward again\n104. and they make a U-turn in the road\n105. and start following him\n106. and he's just driving real slow\n107. and careful\n108. Haha\n109. it's pretty funny\n110. I don't know if they ever stopped him or not",
    "42": "1. There is an individual driving on the road\n2. with someone named Lisa.\n3. They are headed to a baseball game.\n4. They are on road 24\n5. when they see a driver in his 50s driving strangely.\n6. The driver appears to change lanes\n7. at some point\n8. and ends up tailgating the person witnessing.\n9. The main character is concerned\n10. of whether the driver is drunk\n11. or has a health issue.\n12. He spots a sheriff\n13. and explains the situation.\n14. The driver then reverses\n15. and avoids the cop.\n16. The sheriff follows after him.",
    "43": "1. Some people went to see a league softball game.\n2. A guy in his 50s came\n3. and blocked, I presume, some traffic.\n4. It was linked to ranch eggs.\n5. Then the guy was near them,\n6. bumper to bumper.\n7. A driver thought he was drunk\n8. and was worried he may get a heart attack.\n9. A police car is then seen.",
    "44": "1. About a month ago we were driving up to the Junior baseball game, up Twenty-Four,\n2. there is this guy trying to turn left onto the road.\n3. So we wait for him to turn\n4. but he gets about half way across before the lights change\n5. and he's stuck in the middle of the road,\n6. right on the median.\n7. Anyways we drive through quickly to get ahead of him\n8. and when the traffic starts again he begins to follow us real close up Twenty-Four.\n9. Lisa was in the car with me\n10. and she says \"that guy is following real close\",\n11. and I look back in the rear-view mirror\n12. and she's right.\n13. He's weaving this way and that across the lanes\n14. and sticking real close to us all the way up Twenty-Four.\n15. We go a mile, maybe two\n16. and I'm starting to think about drunk drivers\n17. and how they're the biggest cause of death to kids and whatnot,\n18. because I'm thinking this guy must be drunk to be driving like this.\n19. I think I'll stop at the next light\n20. and get out\n21. and go back there\n22. and see what's up,\n23. give him a piece of my mind,\n24. but then I wonder if he's actually sick\n25. and if I want a confrontation after all.\n26. I'd hate it to read the paper the next day\n27. and hear about a guy dying of a heart attack on the highway\n28. and I had done nothing about it.\n29. Anyway, my mind was made up\n30. and I was going to go back there\n31. when we pull up at a stop sign\n32. and there's a police car on the other side of the road,\n33. so I call them over.\n34. They swing across the road\n35. and I get out\n36. and say \"that guy back there is either drunk or sick, but he can't keep his car in his lane at all\".\n37. They turn the cruiser around\n38. and head over to him,\n39. and he has stopped a ways up the road.\n40. He starts to back up slowly when he sees the police coming towards him,\n41. then he starts forward again\n42. and drives real slow like back along the road.\n43. I don't know whether they ever caught him\n44. or what was what haha\n45. but it sure was a strange thing.",
    "45": "1. A driver and her companion, Lisa, were going to a baseball game a month or so ago.\n2. They were driving along HWY\n24.\n3. As they drove, another car began tailgating them.\n4. This car was weaving and at one point it stopped in the middle of the road, blocking all the cars that were behind it.\n5. The original driver thought she had gotten away from the tailgater but he reappeared.\n6. She feared he was either drunk or having a heart attack and stopped her car, concerned.\n7. A police (sheriff) car was across the road.\n8. She approached asking for the sheriff's help.\n9. He, in turn, went after the other car which backed away.\n10. The sheriff did a U turn and the other car began driving forward in a careful manner.\n11. The original driver was amused seeing how well the tailgater was now driving, as he was being followed by the sheriff.\n12. She did not find out what transpired afterwards.",
    "46": "1. Someone was driving\n2. trying to merge onto the highway\n3. when a driver pulled out\n4. and blocked him\n5. and then started driving erratically,\n6. following too close\n7. and appearing to be either drunk or sick.\n8. The storyteller stopped,\n9. and told a sheriff what was happening\n10. and the bad driver\n11. went in reverse\n12. and drove away slowly",
    "47": "1. Some people were driving\n2. and saw a potentially drunk driver\n3. cut in to traffic\n4. and drive erratically.",
    "48": "1. About a month ago a guy came through\n2. and we passed coming on to twenty-four\n3. looked about turning to fifty\n4. and he knew he was heading where I wanted to park.\n5. So he is sitting there right there in the middle of the road\n6. so he went on across as soon as traffic cleared\n7. and we headed up two miles\n8. and the guy followed us.\n9. The guy is on my tail\n10. bumper to bumper\n11. I'm watching him to make sure he doesn't back on me\n12. and he is stuck really bad.\n13. All of the time this is happening\n14. I was trying to make up my mind\n15. and I was going to go back\n16. and figure his mind because he seemed drunk.\n17. I really felt bad reading that the guy had to die with a heart attack,\n18. I walked out of the car\n19. and reported that this guy was drunk\n20. and he couldn't keep his car.\n21. The cops went there to check him out,\n22. they checked out on him\n23. he was just driving pretty slow\n24. and that was bad news.",
    "49": "1. I was going to church\n2. Someone was driving drunk\n3. [He] look[ed] like [he was] in his fifty[ies]",
    "50": "1. While driving to a church league softball game,\n2. the narrator encountered a driver\n3. who appeared to be intoxicated.\n4. After observing the driver\n5. blocking traffic\n6. and weaving dangerously close behind them,\n7. they decided to alert law enforcement.\n8. Upon reaching a stop sign,\n9. they saw a sheriff's car\n10. and informed the deputy about the erratic driver.\n11. As the police approached,\n12. the suspect noticed\n13. and began to back away from the intersection,\n14. leading to a slow chase\n15. as the officers followed him.\n16. The situation highlighted concerns about drunk driving\n17. and the narrator's internal conflict\n18. about intervening for safety reasons.",
    "51": "1. They were heading to an event for the diamond at Homestead High School,\n2. going on twenty-four.\n3. They spot a strange man on the road,\n4. creeping around and acting strange.\n5. They then realised that this man was following them,\n6. and was almost touching their bumper just a mile or two away from Ranch Eggs.\n7. They spot a nearby sherif\n8. and tell them about this guy,\n9. how he has a problem\n10. and could be drunk.\n11. The guy sees them approach the sherif\n12. and backs up,\n13. reversing the car away\n14. and driving off.\n15. The sherif hops into their car\n16. and starts to chase after them.\n17. After the guy did previously speed away,\n18. they start to act normal\n19. and drive normally.\n20. They never found out if they pulled him over or not.",
    "52": "1. Someone was driving with someone named Lisa down the highway.\n2. (Twenty-four?)\n3. [They were] going to a baseball game.\n4. They had a driver blocking the highway.\n5. [They] wait to turn.\n6. They go first.\n7. The driver is behind them.\n8. [The driver is] swerving back and forth.\n9. The speaker thinks the guy is either drunk or having a heart attack.\n10. So they go slow.\n11. [They] see a cop.\n12. They call the cop over.\n13. [They] tell them the vehicle behind them may be drunk.\n14. The cops go off towards the car.\n15. The car reverses down the road.\n16. [The car] then does a U-turn.\n17. [The car] drives slow and careful.",
    "53": "1. the story was about a man\n2. who was followed by a car\n3. that drove as if the driver was drunk\n4. or having a heart attack",
    "54": "1. A man was with a woman named Lisa.\n2. He was driving on highway\n24.\n3. [He was driving] on the way to a church softball league game.\n4. [The game was] at Homestead High School.\n5. On the way there, near Ranch Eggs,\n6. the man encountered what appeared to be a drunk driver or a man that was having a heart attack.\n7. The alleged drunk driver pulled out into the middle of the highway median.\n8. After the man going to the softball game passed the drunk driver,\n9. the drunk driver appeared to be following him down the highway.\n10. [the drunk driver appeared to be] swerving in the lanes.\n11. Eventually, the man found a sheriff.\n12. [The man] told them what was going on.\n13. However, from far back, the drunk driver saw the police.\n14. [The drunk driver] tried to reverse from them.\n15. Then, the police made a u-turn.\n16. [Then] the drunk driver started going forward.\n17. The main character from the story wasn't sure what ended up happening to the drunk driver after that.",
    "55": "1. I was going to the church leaders' football game,\n2. and a man in his mid-thirties is blocking the lines.\n3. It's tail to tail and bumper to bumper.\n4. I think he is drunk,\n5. but he might be having a heart attack.\n6. I don't want to accuse him of being drunk,\n7. and then finding out when reading the news that he was having a heart attack.\n8. When reaching the stop sign,\n9. I saw a sheriff\n10. and called him over,\n11. and told him that this man is either drunk or having a heart attack,\n12. and that he is swerving in both lanes.\n13. The sheriff follows him.",
    "56": "1. There was a game\n2. we were heading to\n3. at a school Homestead High.\n4. A vehicle cut in front of us\n5. on the highway\n6. he was driving recklessly,\n7. heading the same way\n8. we went.\n9. I thought to myself\n10. I have to do something\n11. about the way this guy was driving.\n12. There were many reports\n13. of kids dying\n14. because of drunk drivers.\n15. Turns out\n16. he was having a heart attack\n17. and not driving drunk.",
    "57": "1. The couple, man and wife Lisa are heading to a softball game at the diamond.\n2. Whilst driving near the church,\n3. a man is driving erratically,\n4. blocking the highway.\n5. They overtake him,\n6. but he starts to tailgate them,\n7. weaving in and out of lanes.\n8. They think he might be drunk\n9. but are not 100% sure.\n10. They flag a police patrol car,\n11. when the driver of the erratic car notices,\n12. he reverses\n13. and takes a minor road to try to escape.\n14. The police car heads in pursuit,\n15. but the behaviour of the car changes\n16. and it stops driving erratically.",
    "58": "1. About a month ago,\n2. Well, we are going twenty-four,\n3. Coming on to twenty-four,\n4. and he's lending for the same place,\n5. I am hurried,\n6. got in the waits,\n7. got it blocked,\n8. there maybe a mile or two,\n9. at ranch eggs,\n10. and Lisa was with me,\n11. and I'm trying to keep,\n12. couldn't keep in lane,\n13. how it's everybody's responsibility,\n14. so I figured it out,\n15. you gotta do something,\n16. he's gotta go.",
    "59": "1. Going to some baseball games at Homestead High school,\n2. going on the 24th.\n3. There's a guy waiting to pull out who wants to edge out.\n4. I sneak ahead of him at the intersection\n5. and head on up the hill.\n6. He pulls into the lane behind me\n7. and then is riding my tail.\n8. Lisa, who is in the car with me, says, \"he's right on your tail.\"\n9. I think he might be drunk.\n10. He then starts weaving,\n11. and I'm not sure what's going on.\n12. I decided I'm going to stop\n13. and check it out at the next stop sign.\n14. We stop,\n15. there's a sheriff\n16. and I motion him over.\n17. [I] Say, \"this guy is drunk or sick.\"\n18. The guy starts backing up,\n19. turns around\n20. and drives off slowly.\n21. The cops follow.",
    "60": "1. Headed to a church league baseball game.\n2. Started driving and going up the twenty four\n3. But there's a guy that that can't stay in his lane.\n4. Kept weaving in and out.\n5. With a friend named Lisa.\n6. Soon enough they're tailgating the speaker, almost bumper to bumper.\n7. They recall the number one cause of death in kids is drunk driving.\n8. The speaker is pretty sure he's drunk.\n9. Or otherwise very sick since he can't stay on one side of the road.\n10. They get off the twenty four\n11. And think that something should be done about that car,\n12. Since they would feel horrible if the other driver wasn't drunk but instead was having a heart attack or were ill\n13. And found out about them in the news the next day.\n14. Found a sheriff's car\n15. And told them about the encounter.\n16. The suspected drunk driver saw them get off and speak with the people in the sheriff's car\n17. And stopped far away.\n18. Then reversed\n19. And started to go backwards.\n20. They then started to go very slowly.\n21. Never found out if the sheriff's car caught up with them\n22. And never heard about it again.",
    "61": "1. IT'S ABOUT A GUY\n2. WHO WAS BEING FOLLOWED BUMPER TO BUMPER\n3. BY ANOTHER CAR.\n4. HE INITIALLY THOUGHT\n5. THE GUY WAS EITHER SICK OR DRUNK\n6. CAUSE HE COULDN'T STAY IN HIS LANE.\n7. SO HE STOPPED\n8. BY A SHERIFF.\n9. WHERE HE EXPLAINED WHAT WAS GOING ON\n10. BUT WHEN THE POLICE STARTED GOING AFTER HIM\n11. HE STARTED DRIVING IN REVERSE.",
    "62": "1. You jerk\n2. Ranch eggs\n3. Got twenty four blocked",
    "63": "1. The story is about a suspected drunk driving incident\n2. where the initial interaction with the alleged drunk driver estimated to be in his mid-fifties\n3. pulls out and blocks the road on the highway.\n4. After realizing the drunk driver blocked the road,\n5. the storyteller then indicates they and their passenger, Lisa,\n6. waited for it to clear a bit\n7. before getting out of there from the situation with the drunk driver.\n8. As they were going along their way,\n9. Lisa indicates that the drunk driver is following them,\n10. to which the storyteller confirms.\n11. The suspected drunk driver started driving erratically.\n12. This was where the storyteller started suspecting the drunk driver to be drunk\n13. and made a comment about drunk driving needs to be the responsibility of all of us.\n14. The storyteller then starts to question if the person is truly a drunk driver\n15. and not someone who is in medical duress.\n16. The storyteller then chooses to intervene\n17. to ensure that if the other driver was indeed in medical duress,\n18. they did not deny them help through hasty judgement.\n19. The storyteller pulls up to the stop sign\n20. where there was a sheriff signaled the sheriff car over,\n21. got out of their car\n22. and made their way to the sheriff car\n23. to tell them what has been happening with the erratic driving behind them.\n24. As soon as the suspected drunk driver saw this,\n25. he stops far away from them\n26. and starts reversing away from the cops.\n27. The cops went for him\n28. and soon caught up with him.\n29. The drunk driver then threw his car into drive\n30. and started going very slow,\n31. causing the cops to make a U-turn\n32. and go after him.\n33. The storyteller says it was comical\n34. and does not know if the cops ever stopped the suspected drunk driver.",
    "64": "1. A group was on a route to a church league softball game\n2. about a month ago at Homestead High School.\n3. Driving down a highway called Twenty-four,\n4. they noticed a man in his fifties blocking the lane\n5. as he attempted to turn.\n6. After passing him,\n7. they noticed he was following them too closely,\n8. swerving back and forth.\n9. They became concerned that he might be drunk.\n10. Getting nervous,\n11. they decided to call a passing sheriff's car\n12. as they approached a stop sign.\n13. They told him what was going on,\n14. showing further back down the road,\n15. where the man was driving recklessly.\n16. In an instant,\n17. the man spotted the deputies\n18. and backed down the road,\n19. making it a silly scene.\n20. The deputies chased after him\n21. but weren't quite sure if they had any cause\n22. to actually arrest him\n23. or find out what the problem was.",
    "65": "1. Uhh.\n2. Some guy is going to a baseball game or something.\n3. He's at an intersection.\n4. Another car is being weird.\n5. The other car is riding his bumper.\n6. He's got a woman named Lisa with him.\n7. He thinks the other guy is drunk or sick or something.\n8. He stops.\n9. [He] tells a cop about it.\n10. Then the guy pulls off.\n11. The cop starts chasing him.",
    "66": "1. About a month ago, we were heading to a church league softball game.\n2. The games were all set to be played at the diamond at Homestead High School.\n3. Do you know where that is?\n4. Well, we were driving up Route 24, getting ready to turn near Ranch Eggs,\n5. and I was slowing down,\n6. signaling to turn.\n7. As I was slowing down,\n8. there was this guy sitting off to the right,\n9. getting ready to merge onto Route\n24.\n10. He looked like he was in his mid-fifties.\n11. He starts inching out onto the road,\n12. partially blocking the lane,\n13. aiming for the same spot I was headed to.\n14. You know how you wait in the median for traffic to pass?\n15. This guy pulls into the lane,\n16. and I thought, \"What a jerk...\"\n17. but I sped up and got in front of him.\n18. He stayed put,\n19. blocking Route 24,\n20. right in the middle of the road.\n21. Once the traffic cleared,\n22. we crossed over\n23. and continued toward the diamond,\n24. which is about a mile or two north of Route 24 on Aboite Center Road.\n25. But this guy starts following us.\n26. As we were heading up the slight hill by Ranch Eggs,\n27. he was tailing us closely.\n28. Lisa was with me,\n29. and she said, \"That guy is right on your bumper!\"\n30. I checked the rearview mirror,\n31. and sure enough, he was almost touching my car,\n32. so I kept an eye on him to make sure he didn’t hit us.\n33. He started swerving,\n34. unable to stay in one lane.\n35. It was pretty alarming.\n36. The whole time this was happening,\n37. I kept thinking about how drunk driving is the leading cause of deaths for kids\n38. and how everyone has a responsibility to do something.\n39. I was pretty sure the guy was drunk—or at least acting like it—\n40. so I decided that when we got to the stop sign,\n41. I was going to see what was going on.\n42. Maybe he was drunk,\n43. but then again,\n44. what if he was sick, like having a heart attack or something?\n45. I knew I had to act,\n46. but I didn’t want to get involved if I didn’t have to.\n47. Still, I made up my mind.\n48. When we pulled up to the stop sign,\n49. there happened to be a sheriff’s car parked across the road.\n50. I motioned for the officer to come over,\n51. and they quickly drove across.\n52. I got out of my car,\n53. walked over to the deputy,\n54. and said, \"The guy behind me is either sick or drunk, but he’s got a problem.\n55. He can't stay in his lane.\"\n56. I told him, \"Something’s definitely wrong.\"\n57. So they headed toward the guy.\n58. As soon as he saw me get out and walk to the police car,\n59. he stopped way back from the intersection,\n60. put his car in reverse,\n61. and started backing up.\n62. When the cops went to check on him,\n63. he kept backing down the road.\n64. Eventually, they caught up,\n65. and he started driving forward again.\n66. The officers made a U-turn to follow him,\n67. and now he was driving real slow and carefully.\n68. Ha ha, it was kind of funny...\n69. I don’t know if they ever caught him.",
    "67": "1. The story is about an observant driver\n2. who noticed another driver's erratic driving\n3. while he was going for a league game.\n4. The observant driver notified the police-\n5. a sheriff's car,\n6. even though he was uncertain what could have caused the abnormal driving.\n7. The observant driver was not sure\n8. if it could be due to drunk-driving,\n9. or the erratic driver could be suffering from a heart attack.\n10. As the vehicle slowed down,\n11. and cops walked up to investigate what the problem was,\n12. the erratic driver suddenly put the vehicle in reverse\n13. and started moving down the road,\n14. and also started moving forward\n15. but this time in a slow manner\n16. while he was being followed by police vehicles.",
    "68": "1. A young person was trying to get onto Twenty-four off the highway,\n2. when a car was blocking the way.\n3. Instead they decided to go another way to get to their destination,\n4. and all of a sudden the car that was blocking the road started to follow them.\n5. The car was constantly up their tail,\n6. bumper to bumper,\n7. borderline crashing into them.\n8. The person thought to themself,\n9. maybe he's drunk or having a heart attack.\n10. Suddenly, he sees a police car on the side of the road,\n11. and he stops\n12. and signals the police to come over.\n13. He states that the man who was following him was driving back and forth,\n14. and can't keep in the same lane.\n15. He states that he must have been drunk or sick.\n16. The car that was following them starts to slowly reverse back\n17. when they notice the police.\n18. The police begin to follow the retracting car,\n19. and the narrator doesn't know if they ever caught up to them.",
    "69": "1. A couple was going to a baseball game\n2. and on their way\n3. there was a car on highway 24\n4. that was blocking the road by the median.\n5. The couple passed the car\n6. and the car followed them\n7. and tailgated them\n8. while swerving.\n9. The driver told his partner, Lisa,\n10. that he was going to stop at the stop sign up ahead\n11. and he was going to go back\n12. and approach the driver\n13. to see if he was either drunk\n14. or if he was sick\n15. (having a medical emergency).\n16. When the couple approached the stop sign\n17. they noticed a police officer\n18. and got out of their car\n19. to inform him of what had happened.\n20. The car behind them noticed this\n21. and stopped down the road.\n22. The police officer went down\n23. to speak to the driver\n24. but the driver started to reverse the car,\n25. until the police officer was able to catch up.\n26. Once the officer caught up\n27. the driver started driving forward again,\n28. really slow\n29. and really carefully\n30. in a very comical way.",
    "70": "1. A month ago, this guy was heading to his church's softball.\n2. As he drives, a man in his fifties seems to be following him.\n3. This old man follows him bumper to bumper.\n4. The two women in the car agree.\n5. As the guy is driving, the old man drives from lane to lane.\n6. The old man seems to be drunk.\n7. The driver is concerned.\n8. The driver is worried that the old man is maybe having a heart attack or something.\n9. The driver was hesitant.\n10. The driver decided to stop.\n11. The driver talked to a sheriff.\n12. The sheriff followed the old man.\n13. The old man made a U turn.\n14. The old man ended up following the road's rules.",
    "71": "1. About a month ago we were going to a church league softball game.\n2. They'd had the games all scheduled for the diamond at Homestead High School.\n3. You know where that's at?\n4. Well, we're going up Twenty-four,\n5. and getting ready to turn there,\n6. at Ranch Eggs.\n7. You know how you sit there and wait for the traffic to get by?\n8. Right there in the median?\n9. This guy starts,\n10. pulls out in the lane,\n11. i thought \"you jerk\"\n12. but i hurried up and got in there ahead of him.\n13. Couldn't keep it one lane.\n14. I figured that when we get up to this stop sign\n15. I'm going to go back\n16. and find out what his problem is,\n17. 'cause i'm thinking he's drunk\n18. and i know i oughta do something about it\n19. but at the same time if he's sick,\n20. like maybe he's having a heart attack or something\n21. you know.\n22. you gotta do something.\n23. Pretty soon they catch up with him,\n24. and he starts forward again,\n25. and they make a U-turn in the road to follow him\n26. but he's just slowly driving and being careful.\n27. I don't know if they ever stopped him or not.",
    "72": "1. about a month ago we were going to see a church softball game,\n2. the games were near twenty-four,\n3. as we were on the way there was a guy who was in his middle fifties,\n4. he was blocking the highway.\n5. on the way there was a driver who was driving really close to me,\n6. basically bumper to bumper,\n7. he appeared to be drunk\n8. so I told a police officer about him,\n9. that he was either unwell or drunk",
    "73": "1. Some guy was going somewhere.\n2. Homestead and he was driving\n3. and there was a guy in the median\n4. but he thought the guy was drunk\n5. but what if he wasn't drunk\n6. and had a heart attack\n7. and the guy didn't want to hear on the news\n8. that he thought drunk guy was actually heart attack guy\n9. so he went back to check\n10. and lots of other words...omg",
    "74": "1. The story is about a guy and someone named Lisa.\n2. They were driving around,\n3. and I think they spotted a dangerous driver on the highway\n4. that they were driving on.\n5. He was driving\n6. the erratic probably drunk driver all over the road\n7. and in the median of the highway.\n8. He talked about, with some concern,\n9. that the driver was driving all the road dangerously\n10. and that is perhaps the number one killer of children.\n11. Lisa was able to see the driver as well in the car.\n12. Also I think that the police were involved\n13. and pulled over the driver.\n14. He may have talked also to the guy\n15. describing his personal driving story.\n16. The person describing the story in the end\n17. seemed that he thought the incident\n18. that he viewed passing old high school,\n19. and on to the highway viewing the dangerous driver\n20. he though was a bit funny and concerning.\n21. This is what I can recall.",
    "75": "1. There was going to be a church softball game\n2. that a lady and her friend were going to,\n3. at the intersection a man started chasing them\n4. swirling all over the road\n5. and he couldn't keep the car straight.\n6. While all this is happening,\n7. our lady driver (I can't recall her name) starts to think to herself\n8. that this man must be drunk or sick,\n9. and she thinks about how drunk driving is the number one cause of deaths on the road.\n10. She also thinks to herself\n11. that if the man is having a heart attack\n12. then she will feel bad for calling him a drunk.\n13. Deciding to take action and find out what the man's problem is,\n14. she spotted the sheriff's car\n15. and decided to get them involved.\n16. The man had something to hide\n17. because he made a ridiculous attempt to get away from the police.\n18. We do not know if he was caught or not in the end.",
    "76": "1. They were heading to a baseball game\n2. in a car\n3. when some guy pulled out on them on the Twenty Four.\n4. He appeared to be driving erratically\n5. which made them (the narrator and Lisa) think that the driver was either sick or drunk.\n6. Concerned about the safety of others, particularly children,\n7. they stopped at an intersection\n8. and beckoned over a sheriff to check on the driver.\n9. When the sheriff approached the vehicle,\n10. the drive first began to reverse away,\n11. and when caught,\n12. began to drive forward to evade the sheriffs.",
    "77": "1. On a sunny day\n2. the church baseball league went up\n3. the 24th at Meadowview.",
    "78": "1. A lady was walking down the road\n2. and saw a guy following her\n3. [she] was not sure if he was drunk or sick\n4. and she made up her mind to approach him\n5. to ask what his problem was\n6. and just as she was about to do that,\n7. a sheriff's car stopped the guy\n8. and she told the sheriff to check on the guy\n9. if he's sick or drunk\n10. and she was scared\n11. in case he's sick\n12. and having a heart attack\n13. and dies\n14. if she can hear this the following day about it,\n15. then she would really feel bad\n16. knowing she could have done something about [it].",
    "79": "1. Driving in the car up to play softball up twenty four,\n2. sat waiting at a junction,\n3. this man in another car isn’t moving,\n4. then he basically blocks all of the intersection with his car,\n5. so I managed to get in front of him.\n6. Driving up twenty four,\n7. I can see him in the mirror swerving from side to side\n8. not being able to stay in the right lane.\n9. I keep looking back\n10. thinking that drunk drivers are the number one killers.\n11. Then I start to question if he’s drunk or poorly?\n12. Maybe sick?\n13. While driving and keeping an eye on the guy in the back,\n14. how am I going to stop him.\n15. When I get to the next Stop sign\n16. I’m going to get out and see if he’s okay.\n17. When I reach the stop sign\n18. I see a police car\n19. I ask them over and tell them about he guy behind\n20. and don’t know if he’s drunk driver or sick,\n21. the cop walks to his car\n22. and he puts it in reverse back down the hill.\n23. the cops are after him\n24. I’m not sure if they caught him,\n25. I carried on my journey",
    "80": "1. Four people decided to attend a softball game\n2. This writer comes across a drunk man\n3. This lady could sense something was off about him\n4. Whilst she was driving\n5. She came across a sheriff car\n6. She informed them that the man was either very sick or very drunk\n7. The lady then recalled\n8. How much drink driving impacts drivers and victims",
    "81": "1. They were going to a softball game\n2. and they were going onto a highway\n3. and the guy started driving erratically in front of them.\n4. He came to a stop at one point\n5. and blocked the highway\n6. (I think it was 24)\n7. and meant that they couldn’t get around him.\n8. He continued driving erratically\n9. and he was worried about the car crashing into him\n10. and causing an accident.\n11. He was initially convinced that he was drunk\n12. but then wondered if he was ill\n13. and felt guilty.\n14. He flagged down a nearby sheriff’s car\n15. and explained the situation.\n16. They started following him\n17. and he initially stopped a way away.\n18. He then went into reverse\n19. and they had to do a U turn\n20. before he continued driving slowly\n21. and carefully.",
    "82": "1. my laptop froze",
    "83": "1. We were going to a church league soft ball game\n2. scheduled at Homestead High School.\n3. You know where that is?\n4. We are going to Twenty Four,\n5. and also going at Ranch eggs getting ready.\n6. There is this guy seated on the right.\n7. On the median, the guy starts.\n8. So we went across\n9. as soon as traffic cleared\n10. we headed towards diamond.\n11. The guy kept following us.\n12. I was with Lisa\n13. and she said \"that guy is on your tail.\"\n14. I looked in the mirror.\n15. The guy seemed like he was drunk\n16. but he was having a heart attack.",
    "84": "1. He was on his way to Homestead\n2. to play ball\n3. He went up Highway 24\n4. Another car was merging on to the highway\n5. and slowed down\n6. He managed to get ahead of the car\n7. but the car stayed in the middle of the highway\n8. slowing down the traffic\n9. Then the slowed car sped up\n10. and he was on its tail\n11. His passenger was named Lisa\n12. and mentioned that the car was on his tail\n13. He continued on Highway 24\n14. towards the field",
    "85": "1. A lady who went for a game\n2. observed that she's being followed\n3. by a man\n4. who she assumed is either sick or drunk.\n5. With her ongoing thought about causes of road accident\n6. and negative happenings on the road\n7. she was worried\n8. and concerned about the man's driving attitude.\n9. She explained to the local sheriff about this happening\n10. when she got her chance\n11. then the man/driver desist\n12. and take off\n13. leading to a chase.",
    "86": "1. Somebody was driving to a church league softball game\n2. where they had to turn onto the 24\n3. They went to pull out\n4. but another car did at the same time\n5. He beat them to the spot in traffic\n6. and the other car was blocking the road\n7. He then carries on driving\n8. and the car follows him, very close\n9. Then he decides to stop\n10. and see what his deal was\n11. in case he was drunk or sick\n12. He beckons a sheriff over at the stop sign\n13. and the car reverse down the road\n14. before going forward\n15. when the sheriff caught them\n16. We don't know if they got pulled over.",
    "87": "1. A guy and his friend Lisa are going to a softball game at the diamond.\n2. Whilst driving there, a gentleman from the side road tries to jump in by pulling out.\n3. But their car goes ahead filling the gap.\n4. Meaning the other guy's car is blocking opposing traffic on the 29th street.\n5. This guy then proceeds to follow their car very closely.\n6. And is bumper to bumper with them.\n7. They notice he is also swerving between lanes.\n8. They consider the idea he is possibly drunk.\n9. The driver thinks of the amount of teenagers that die due to drink driving.\n10. And also considers the driver may be having a medical issue.\n11. They decide at the next stop sign they will stop and see what the guy's issue is.\n12. As he would feel bad if tomorrow he found out the guy passed due a medical issue.\n13. And they could have checked and helped.\n14. They find a sheriff's car parked opposite the road when they stop.\n15. And so they approach the sheriff.\n16. And inform them of the driver's driving.\n17. And that they believe he may be having a medical issue or may be drunk.\n18. The second driver (the one who may be drunk) hasn't reached the same point as their car.\n19. But sees them talking to the police.\n20. And starts to reverse back down the road.\n21. The police car follows down.\n22. And follows the car which has now slowed down.\n23. And is driving at a suitable speed and in a sensible manner.",
    "88": "1. A man is driving down 24,\n2. headed to a ball game,\n3. past an egg place.\n4. He has a passenger named Lisa with him.\n5. A driver in another vehicle is blocking traffic.\n6. The first vehicle passes him.\n7. Then, the second driver approaches from behind at a fast pace.\n8. He is swerving back and forth.\n9. The first driver decides he is going to stop at a stop sign\n10. and approach the other driver to find out what his problem is.\n11. He suspects either drunk driving or a medical problem.\n12. Just then, a sheriff stops across the road.\n13. The driver in the first vehicle approaches the sheriff\n14. and explains the situation.\n15. The sheriff then starts following the vehicle,\n16. which initially was going in reverse.\n17. The vehicle then started going forward\n18. and the sheriff made a U-turn\n19. and continued pursuing the vehicle.\n20. The man lost track of the pursuit after that.",
    "89": "1. About a month ago we were going to a church softball game.\n2. There's a driver blocking the intersection.\n3. This whole time I'm thinking,\n4. drunk driving is the number one killer of children.\n5. I saw the sheriff and told a deputy that the guy behind me is either sick or drunk but he has a problem.\n6. He can't keep his car in the lane.\n7. The deputy starts driving towards the man\n8. and the driver starts driving backwards down the hill.\n9. When the deputy gets near him, the driver starts going forward slowly.\n10. HAHA, it's pretty comical.\n11. I don't know if they ever stopped him or not.",
    "90": "1. We were driving\n2. to a little league baseball game\n3. at Homestead High\n4. on the 24 highway.\n5. I was expecting\n6. to turn at Ranch Eggs.\n7. I pulled to the median\n8. to wait for my turn\n9. and just then\n10. another guy in a car\n11. wanted to turn as well.\n12. There was no room for him\n13. on the median\n14. so I took my chance\n15. and made the turn\n16. ahead of him\n17. onto Aboite Road.\n18. For some reason,\n19. he followed me\n20. too closely,\n21. weaving behind me\n22. and staying close\n23. on my tail.\n24. Even my wife Lisa\n25. commented on this.\n26. There was obviously something wrong\n27. with him.\n28. Maybe he was ill,\n29. or drunk\n30. and he could be a danger\n31. to other people.\n32. I made up my mind\n33. to stop at the next Stop intersection\n34. coming up\n35. and get out of the car\n36. to try and discuss this\n37. with him.\n38. When I stopped,\n39. I noticed a police car\n40. on the other side of the road,\n41. and I motioned to them\n42. and expressed my concern.\n43. When the other driver saw the police,\n44. he started to back down\n45. the highway.\n46. The police followed him,\n47. saw him reverse again\n48. and progress very slowly ahead again.\n49. They followed him again\n50. and they all eventually disappeared.\n51. I never found out\n52. whether they caught up with him.",
    "91": "1. I was driving down the highway to Homestead.\n2. As I was driving down the highway,\n3. I was about to turn right onto Twenty Four.\n4. When across from me, I saw a car with a man in his middle fifties.\n5. He was blocking the highway.\n6. Eventually he moved\n7. and I was able to turn right onto Twenty Four.\n8. Lisa was in the car with me, in the backseat,\n9. and she said \"He's tailing you!\"\n10. So I looked back,\n11. and sure enough, the man was behind me, bumper to bumper.\n12. I kept driving,\n13. while looking back to make sure the man didn't slam into me.\n14. The man was weaving left and right,\n15. he couldn't stay in one direction.\n16. So I thought, \"drunk driving is the number one killer of kids!\"\n17. I thought that the man might be drunk.\n18. I figured that when I reached the next stop sign,\n19. I would turn around and go back to see what that man's problem was.\n20. Because I wasn't sure if he was drunk or just sick.\n21. Maybe he was having a heart attack or something.\n22. I would've felt really bad if I saw in the news that a man died of a heart attack while driving\n23. and I didn't do anything to help even though I was there.\n24. When I reached the intersection I saw a police car parked at the other side of the street.\n25. I waved to the police car,\n26. and it drove over to me.\n27. I told the deputy, \"There's a man driving behind me, I don't know what his deal is, but I think he might be drunk or sick or something.\n28. Because he can't stay in one direction, he keeps driving into the opposite lane.\"\n29. The deputy went down the street to look for the man.\n30. When the man reached the intersection and saw me,\n31. he stopped his car\n32. and then started going in reverse.\n33. He began to drive forward again,\n34. with the police car following behind him.\n35. The man was driving slowly and carefully now.\n36. I'm not sure if the police car ever stopped him.",
    "92": "1. Two persons were going to a church softball game,\n2. the main character and Lisa.\n3. On the way there a guy was blocking the freeway with their car.\n4. Later another car was acting weird,\n5. not staying in lane,\n6. and tailgating.\n7. The main character was suspecting that they are either drunk or having a heart attack.\n8. So he stops to inform a sheriff about it,\n9. but the car tailgating tries to avoid the cops.",
    "93": "1. I was on my way to a church league baseball game\n2. that was organized by a high school\n3. at the diamond\n4. and had to get on ranch eggs and the twenty four.\n5. I noticed a driver in the car behind me,\n6. he was middle-aged around 50,\n7. and when I started driving he was behind me.\n8. I had Lisa in the car with me\n9. and she said the man was right on my tail.\n10. He was driving really close behind me\n11. and I thought that he might be drunk.\n12. I know drink driving is one of the biggest killers of kids\n13. and I knew I had to do something.\n14. But then I started to wonder\n15. if maybe he wasn't drunk but sick,\n16. that he might have a heart attack or something\n17. and I'd see in the papers he'd died.\n18. So I thought I had to do something.\n19. I saw a patrol car\n20. and stopped;\n21. I went over to the police\n22. and voiced my concerns about the driver.\n23. By this point the driver had stopped a way away\n24. and then began reversing slowly.\n25. The police started following him\n26. and he began to drive forward again\n27. in a comical way.",
    "94": "1. About a month ago while going to a church league softball game,\n2. it was at Homestead High School up at twenty four.\n3. While trying to turn at Ranch Egg,\n4. there was a guy sitting there.\n5. He's about his middle fifties\n6. and he blocks the lane.\n7. I thought you jerk\n8. and he got twenty four blocked.\n9. While the traffic cleared about a mile or 2 north of twenty four,\n10. this guy is following us\n11. as we're going up this little hill\n12. and my friend Lisa said this guy is on your tail\n13. and I looked in the mirror\n14. and saw him\n15. and he's following bumper to bumper\n16. and I make sure he doesn't hit me.\n17. He sways from one lane to the other\n18. and I think of how drunk driving is the number one killer of kids.\n19. I tried to make up my mind on what to do.\n20. He appeared drunk.\n21. When I get to the stop sign,\n22. I'll try to find out.\n23. He may be drunk\n24. or having a heart attack.\n25. I knew I will feel bad\n26. if I saw the news that a man died in a heart attack\n27. while I thought he was drunk.\n28. We saw a deputy\n29. and I approached him\n30. and told him that driver is maybe drunk or sick.\n31. And when the man saw me walk up to the deputy,\n32. he reversed and went backwards\n33. and the deputy followed.\n34. Then he turned\n35. and the deputy did a U-turn.\n36. Then he started driving slowly.\n37. I don't know if he was caught\n38. but it was really comical to watch.",
    "95": "1. About a month ago we were going to church game.\n2. They had the game scheduled for the diamond at Homestead high school.\n3. We went up twenty four\n4. and getting ready to turn at ranch eggs,\n5. slowing down for signal\n6. and this guy sitting on right coming to twenty four,\n7. looking in middle fifties.\n8. He blocked the lane\n9. and heading for the spot I'm going.\n10. You know how you sit waiting for traffic to get by.\n11. The guy starts pulling out in the lane\n12. and I thought \"you jerk\"\n13. but I hurried and got ahead of him.\n14. The guy sits in the middle of the highway blocked.\n15. We went down soon\n16. the traffic cleared\n17. heading towards the diamond about two miles north of twenty four\n18. and the guy is following us up the hill at ranch eggs.\n19. Lisa said the guy is right on my tail.\n20. I looked in the side mirror\n21. and the guy was there bumper to bumper\n22. and I tried to keep an eye on him making sure he doesn't slam on me.\n23. He waves back and forth unable to keep in one lane.\n24. All this time I think how drunk driving is the number one killer of people\n25. and how it's everybody's responsibility,\n26. trying to make up my mind on what to do.\n27. I was sure he was drunk on how he appeared\n28. and figured when we get to stop sigh\n29. I'm going back and find out his problem because I think he was drunk\n30. and I had to do something.\n31. Or maybe he has heart attack you have to do something.\n32. It'd be bad if I see in the papers of the guy died of heart attack.\n33. I had made up my mind\n34. so I pulled at the sign\n35. I walked and reported him.\n36. After he saw me going to the police he throws his car\n37. and runs away.\n38. The police start chasing him.",
    "96": "1. A person is on their way to the church softball game on 24th ave.\n2. On the way there,\n3. they notice a car blocking the highway,\n4. so they take a detour.\n5. Suddenly an erratic driver begins following them,\n6. tailgating very closely.\n7. This makes the driver nervous,\n8. so they pull over.\n9. Once pulled over the other driver does as well further back.\n10. A sheriff car is nearby,\n11. so the driver flags them down\n12. and tells them about the erratic driver,\n13. that they are possibly intoxicated or in need of medical assistance.\n14. Suddenly the erratic driver shifts it in reverse\n15. and takes off.\n16. The sheriff follows suit.",
    "97": "1. I [was] heading to church to [the] softball game,\n2. as they have them all arranged,\n3. and [I] was driving down the twenty-four,\n4. when a male in his mid-50's pulls onto the highway,\n5. [and] we were stuck for a second whilst traffic cleared,\n6. but when it did,\n7. I pulled off into the right lane,\n8. [and] the man followed me,\n9. and he got really close to my bumper,\n10. and Lisa said how close he was to the bumper,\n11. I thought he was drunk because he couldn't keep his car straight,\n12. [and] he was weaving and really close,\n13. then there was a stop sign coming up,\n14. and I thought I will get out at the stop sign,\n15. and go and check on him,\n16. because even though I think he's drunk,\n17. and drink driving is the biggest killer,\n18. I also thought he may be sick,\n19. and I didn't want to read about a man having a heart attack in his car,\n20. and not have done anything.\n21. When we approached the stop sign,\n22. I saw a police car,\n23. and waved the deputy over,\n24. I got out [of] my car,\n25. and approached the police,\n26. and told them he was weaving around,\n27. and he's probably drunk,\n28. and when they went to approach him,\n29. he started reversing back down the hill,\n30. and the police followed him,\n31. and when they caught up,\n32. he started driving forward real slow,\n33. and sensible,\n34. and they followed,\n35. [and] I wonder if they caught up with him.",
    "98": "1. About a month ago, see, we were going to a church league.\n2. We had scheduled for high school.\n3. And I was slowing down to turn, signal.\n4. There's this guy to the right.\n5. Looked like he's about middle fifties.\n6. And head heading for the same spot.\n7. I'm going right there in the median.\n8. But I hurried up and got there ahead of him.\n9. Sitting there right in the middle of the highway.\n10. North of twenty-four, about centre at Ranch.\n11. Eggs were going up this hill.\n12. And this guy's on my tail.\n13. I looked in the mirror.\n14. And sure enough, he's right up it.\n15. Make sure he doesn't slam into me or anything.\n16. I'm thinking how drunk driving is the number one killer of kids.\n17. So I was trying to make my mind up what to do.\n18. So I figured when we get up to this stop sign, I'll ask him what his problem.\n19. Like maybe he's having a heart attack or something.\n20. Some guy died with a heart attack.\n21. And there I was thinking he was drunk.\n22. But I had made up my mind that I was going to.\n23. So we pulled up at the stop sign.\n24. And seen the sheriff.\n25. So I told him this guy behind me can't keep his car on the road.\n26. His got a problem.\n27. And as soon as he sees me call the sheriff, he drives off.\n28. When the cops went down there to check him out.\n29. He starts backing up.\n30. Going backwards down the road.\n31. And then starts forward again.\n32. And just driving real slow.\n33. I don't know if they ever stopped him or not.",
    "99": "1. I was driving towards the church softball tournament with Lisa\n2. and we were driving along 24\n3. when I saw this guy trying to pull out on me,\n4. well I wasn’t having that\n5. so I accelerated\n6. and managed to get in front of this guy\n7. who was now partially blocking the street.\n8. I carried on my way along 24\n9. when I noticed this guy was now following me\n10. only he was weaving from lane to lane\n11. and driving very erratically.\n12. He got me worried now\n13. and I commented on this to Lisa\n14. and figured the guy could be drunk\n15. and that’s pretty dangerous\n16. as the main cause of deaths among kids is drunk drivers.\n17. I saw a stop sign up ahead\n18. and thought to myself\n19. I’m going to stop here\n20. and see what’s going on with this guy.\n21. My first thought was that he was drunk\n22. but he could be having a heart attack\n23. or be really sick\n24. and I’d feel pretty bad\n25. if I didn’t check on this guy\n26. and then read the news\n27. that a guy had collapsed\n28. and died\n29. and I could have done something to help him.\n30. So I stop at the stop sign\n31. and get out of my car\n32. and notice a sheriff’s vehicle on the other side of the intersection.\n33. I go over to the sheriff\n34. and explain the situation\n35. and tell him he needs to go\n36. and check on the guy behind me\n37. who is acting strange\n38. and is either drunk or sick.\n39. Meanwhile the guy behind saw me going to talk to the cop\n40. and starts backing down the road\n41. away from the cop,\n42. the cop keeps heading toward him\n43. and the guy keeps backing\n44. has car really slowly\n45. and carefully away from the cop.\n46. I never did find out what happened\n47. and if the cop ever managed to catch up with him.",
    "100": "1. People are driving to church softball game at Homestead High School.\n2. They are driving up twenty four.\n3. Some vehicle in front of them starts trying to turn to where they are going.\n4. It is blocking off the entire intersection.\n5. Eventually, they go past the vehicle.\n6. The vehicle then starts erratically following them.\n7. It is swerving all over the road.\n8. They decide to pull over.\n9. They see a sheriff's vehicle.\n10. They then call over.\n11. They talk to about the other vehicle.\n12. It is being driven erratically.\n13. They mention that the driver might be drunk.\n14. The cops then chase the vehicle.\n15. It backs up in reverse.\n16. It then starts driving forwards.\n17. It then switches back into reverse.\n18. The narrator doesn't know if they ever caught the driver."
  }
}