{
  "narrative": "Let me share a story from when I was twenty-two years old, just fresh out of college. I was staying in a small town about five miles from here. I had just started my first job at a local bookstore. It was a quiet afternoon, and I was alone in the store. My grandpa, who had been bedridden for almost a year, was at home with my sister. She had to care for him daily, as he couldn't move around on his own. There were only two of us siblings, my sister and me. My parents had gone out of town for the weekend. As I was shelving books, I suddenly heard a voice inside my head. It said, \"If you go to the old church down the street and light a candle for your grandpa, he will get better.\" I looked around the bookstore, but no one was there. I continued with my work, trying to ignore the voice. It spoke to me again, repeating the same message. I looked around once more, but still found no one. I decided to take a break and walk to the church. I was only a short distance away, maybe a quarter-mile. As I approached the church, I hesitated for a moment. I was not a particularly religious person. I remembered my grandma always saying that prayers from a sincere heart could bring miracles. On the other hand, she also said that prayers without faith were useless. I admitted to myself that I was far from being a saint. I had my share of mistakes and misdeeds. I thought about my grandpa and how much he meant to our family. Finally, I went inside the church and found a candle. I knelt down in front of the altar. I said, \"God, I don't know how to pray properly. But I am asking you with all my heart to heal my grandpa. Please help him regain his strength and guide us in taking care of him.\" After saying my prayer, I returned to the bookstore. I resumed my work, shelving books. Suddenly, I felt a strong urge to go home. It was as if something was pulling me towards the house. I didn't hear any voice this time. It was just an overwhelming feeling that I needed to go. I locked up the store and rushed home. To my surprise, I found my grandpa sitting in the living room, talking to my sister. He hadn't been able to leave his bed for months without assistance. My sister told me that he had suddenly felt a surge of energy and was able to stand up and walk. That day marked the beginning of his recovery. He gradually regained his strength and independence. It was a turning point in our lives. We became more grateful for the time we had together. I often thought back to that day in the church. I wondered if my prayer had anything to do with my grandpa's recovery. I couldn't be sure, but it definitely changed my perspective on faith and the power of prayer. My grandpa lived for many more years after that incident. He celebrated his ninetieth birthday surrounded by family and friends. We cherished every moment we had with him. That experience happened almost twenty years ago. It remains a vivid memory in my mind. My grandpa passed away a few years later, but his spirit lives on in our hearts. Sometimes, when I'm feeling lost or uncertain, I think back to that day. I remember the power of faith and the miracles it can bring. And I am reminded that we are never truly alone, even when it seems like we are.",
  "recalls": {
    "5f305d059a58b14b23eeccb8": "A 22yr old girl fresh out of college worked in her familys bookstore. she had 1 sister & a grandpa who was bedridden for months. Her parents were out of town for the weekend & her sister was the only one home with grandpa while the girl worked at the bookstore.Suddenly she heard a voice in her head while shelving books that she must go to the church down the road & light a candle and say a prayer for her grandpa to get well. She ended up closing the store & went to the church & did just that. After returning to the bookstore she felt an urge to go home & found her grandpa full of energy & well. Her sister told her that her grandpa suddenly got up & felt better. he got better since that day & lived to an old age. When times are tough even though its been over 20yrs ago nopw thre girl still thinks of that moment ",
    "6032903277ccb729ab92972d": "It was a story about a man who after college went to work in a bookstore. He lived with his sister, grandfather and parents. One weekend when his parents were away, he was working his regular shift at the bookstore when he heard a voice tell him to light a candle and it would heal his sickely grandfather who was bedridden. After his shift he left the bookstore and went to the church where he lit a candle and prayed. Shortly after he got a phone call from his sister that their grandfather had gotten out of bed and was energetic. Over the months the grandfather got better and lived to be over 90 years old before he passed away. The man often wonders if his prayer was the cause the healed his grandfather of sickness.",
    "61109e59e55dc2f6bf8b2ea9": "a person was reflecting on a time when they were working in a bookstore after college and got the feeling to go pray and light a candle for their grandpa in a nearby church because he was bedridden and needed to be taken care of by the person's sister. The person wasn't very religious but still went to pray anyway then went back to work. They then got a feeling to go home and when they did they saw their grandpa out if bed and in the living room. He then started to get better and better and regain his strength. He lived for a few more years and celebrated his 90th birthday with family and friends. The person telling the story still remembered that day and valued the power of faith and prayer more after that experience.",
    "5ea5da26b447b8458c6270e6": "Twenty-twonyears old, fresh out of college. Started a new job at a bookstore. Sister was looking after grandpa. I heard a voice which said to go the the church and light a candle and pray for him. I then heard it again. I went at lunch, it was only a short walk, about quarter of a mile. I went inside the church and lit a candle\n I prayed to God, please help my grandpa, I am asking with all my heart please help him get better. I returned to work. I got an overwhelming feeling to go home. It wasn't a voice this time. Just an overwhelming feeling urging me to go. I locked up the store and went home. To my suprise, there was my grandpa in the living room, sitting on a chair talking to my sister. He hadn't been out of bed for months. From that day my grandpa continued his recovery. He lived many more years. We cherished that time we had together. I often think back to that day and think did God really hear me and help. It definitely changed my perspective on faith and god. My grandpa celebrated his 90th birthday surrounded by friends and family. He lived a few more years after that. I often think back about him and that time we had together. I often think about that day in church.",
    "5f7f239e9b204e05b6c36538": "I want to share with a story of when I was twenty two back in college. At home we lived with my grandpa who was now bedridden for months. There was just two siblings, me and my sister. Our parents were away on weekend and my sister was the one taking care of him. One day when I was at store packing book on shelves, I heard a voice saying \" if you go to the church and light a candle for your grandpa, he will get better\". I turned around to see who was there but there was no one. I continued packing the books on the shelves till I heard the voice again. I turned around again but still there was no one. I then left the store and made my way to the church. About a quarter mile away, I stopped and pondered. I was not a religious person but my grandmother used to say prayer from a sincere heart can bring miracles, but she said prayer without faith is useless. Finally I went inside and lit the candle and prayed. I went back to the store and had a strong urge to go back home. There no voices this time, just an overwhelming feeling. I immediately locked up the store and went home. I walked in to find my grandpa sitting in the dining room with my sister. He had been bedding for months but he suddenly had a burst of energy and was able to get up without assistance. I wondered if my prayer had ",
    "60ab2c6fbe19b8d115549efa": "The story is about a man who is 22 years old, fresh out of college, who is working at a book store. He lives with his mom, dad, sister, and grandfather. One weekend, he is working at the bookstore, and only his grandpa and sister are home because his parents are out of town for the weekend. He is shelving books as usual and he hears a voice in his head, telling him that if he lights the candle in the old church his grandpa will get better. He ignores it the first time but then the voice speaks to him again and he leaves to go to the old church during his break. He is hesitant about entering the church at first because he remembers some words from his Grandma about how prayer without faith is useless. He goes in a starts to pray, but proclaims he doesn't know how. He lights the candle and goes back to work at the bookstore. He gets a sudden feeling that he should go back home and so he does. He finds his grandpa sitting in the living room talking to his sister. Apparently, his grandfather got a surge of energy and started to feel better, even though he wasn't able to be independent for many months before this. From that day on, his grandpa started to recover. He became more independent and lived for many more years, even up to his 90th birthday. In the end, the 22 year old man states that he'll never forget that day and the impact it had on himself and his attitudes towards belief and faith.  ",
    "59d95cee8fd07a0001842480": "Girl working in the book shop goes to a church and lights a candle. Her grandfather has been bed ridden for months. Her sister was looking after the grandfather while she was at work. After lighting the candle in the church she went back to the book shop and she had a feeling something was calling her to go home. She got home and her grandfather was out of bed for the first time in months. Her sister told her he suddenly had a burst of energy and got out of bed himself. She wondered if it was because she lit a candle. She started believing in faith and she had many years with him. He celebrated his 90th birthday. ",
    "60148ce8ea15974d855c06d5": "Guy was 22 and had a job in a bookstore. His sister was at home looking after their grandpa. There were only 2 siblings. Parents were out of town. When he was pitting books away he heard a voice telling him to light a candle in church and his grandpa would get better. He ignored it the first time but after the second time closed the store and went to the church a short walk away. His grandmother had told him sincere prayers would be answered but insincere ones were pointless. He went in and prayed but confess he didn't know how to do it properly.  Then he went back to the bookstore. Then he had a feeling that he should go home. When he did his grandpa was feeling better and recovered to live  much longer life. That was 20 years ago and he still believes in the power of prayer.",
    "5e0d531982a9554d3862a670": "The story teller is telling a story from 20 years ago when he was 22, fresh out of college working in a bookstore. He has one sister who was at home looking after his grandad who was sick as their parents were away. He was working alone stacking shelves and heard a voice telling him that if he went to the church and prayed his grandad would get better. He tried to ignore it but kept thinking about it so he took a break, locked the store and went to a close by church a quarter-mile away. H was not a particularly religious person but remembered his grandma saying that prayers from a sincere heart caused miracles so he went in, He said he had forgotten how to pray but prayed for his grandad to get better and went back to work. After some time he felt a pull to go home, he didn't hear any voices just an overwhelming pull to the house. He got home and found his grandad in the living room, he hadn't got up and walked in a long time. His sister said the grandad had had a sudden burst of energy. That was a turning point in their lives and the grandad lived into his 90s. They still think about that day and the story teller has changed his perspective on faith and miracles.",
    "5d10fa2bbfbf0a000133594b": "The following story happened when I was twenty-two. I was working in a book store shelving books, when and I heard a voice in my head that told me to go to a church and light a candel for my grandfather. I looked around but there was noone there. There was only myself and my sister, my sister had to care for my grandfather every day. My parents had gone out of town. I walked to the church and lit a candel. I drove across town, and entered by granfather's home. He was sitting in a chair, when he hadn't been able to leave his bed for months. My sister told me that he had a sudden burst of energy. It was twenty years ago but that incident restored my faith.",
    "60e12f6dbb3844c468b97621": "I’m 22 years old, fresh out of college working in a book store. My sister is at home looking after my grandpa as my parents have gone away for the weekend, he is bedridden due to ill health. I’m shelving books when I suddenly hear a voice telling me if I go down the street to the church and light a candle my grandpa will recover. I look around the bookstore but no one is there. I hear the voice again telling me the same thing. I’m not a religious person but I walk down the street to the church and light a candle. I kneel at the altar and say to god I don’t really know how to pray but please heal my grandpa. My grandma always told me that miracles could happen through faith. I go back to the bookstore but feel a strong urge to go home, I lock the bookstore and head home. I find my grandpa downstairs, my sister tells me he came down himself. He couldn’t get out of bed before unassisted. He’d felt a surge of energy and got up. That day marked the start of his recovery, he celebrated his 90th birthday. I don’t know if my prayer helped but we had a couple more years with him. ",
    "5f5bdef433291039ca812397": "When I was 22, fresh out of college, I worked in a bookstore.  I have 1 sister who looks after my grandad was is bed bound and parents are away. One day, when filling shelves, I heard a voice say,\" Go to the church and light a candle'. I looked around, no one there, I ignored it but heard the voice again a few times. The shop wasn't busy so I walked towards the church and about a ¼ of a mile away I remembered my Grandma used to say that you had to have faith for a prayer to work, also that a prayer, without belief was no good. I went to the church, lit a candle and told God I wasn't sure how to pray but could my grandad possibly get better and be part of\nthe family again. On returning to the bookshop a voice told me to go home and when I did, grandad was sitting on a chair. He had reached the chair with help as he had felt a surge of energy. He continued to improve and lived for a few years till his nineties.",
    "602ba5af8055272f9a36e3fe": "Young person just out of college, just started first job at bookstore. Grandpa bedridden at home with sister. Two siblings, parents out of town.Voice inside head saying go to church and light a candle for grandpa (nobody in bookstore). Walked to the church. Not particularly religious person. Went inside and found a candle, prayed for Granpda to regain strength. Suddenly got strong urge to go home. Grandpa was sitting in living room with sister. Lived for a few more years.",
    "5ff45beefdb6e6b063b4c520": "I was fresh out of college and working in a book store. I lived with my younger sister and my grandpa, and recently he'd became ill. Very ill. Eventually becoming bedridden and continuing to decline.\nOne night while stacking shelves at work I hear a voice in my mind - telling me to go to the Church nearby, and light a candle: this would help my grandpa get better. \nI had reservations as I was far from religious but I went to the Church about a quarter mile away, found, and lit a candle. I suddenly felt an inescapable urge to go home, which I gave in to only to see Grandpa, who had been bedridden remember, up and walking. He'd, that night, felt a rush of energy and every night after got better and better, living for many many years afterwards. He made it to ninety. I still think back to that night very often, and wonder whether my act of lighting that candle and giving a prayer really made a difference or not. Either way it changed my whole outlook on faith. ",
    "643f160bb49d863f2be92fc7": "Let me go back to a time when i was about 22 years old. In the first year of colleage. I was in church with my grandpa. He couldn't move around around on his own. There were two siblings my sister and me. My grandparents went to town for the weekend. I suddenly heard a voice in my own head. It said to go to the old church street and light a candle for grandpa to get better. i tried to ignore the voice. I walked to church. I was not religious. I made mistakes. I found a candle in the church. I felt a strong urge to go home. I rushed home. I saw my sister and grandpa. That day was the beginning of his recovery. It was a turning point. I was grateful. I wondered if the prayer saved him. My grandpa lived a good life after that. I think back to that day whenever i'm lost.",
    "5ac9e0299534ba0001c76e80": "She was working in the library staking shelves when she heard a voice telling her to go to the church and say a prayer for her grandad. She did this and then went back to work. She then got an urge to go home, upon arrival her grandad was in the living room which he hadn't been able to do for years.\nShe never really knew for sure if it was the prayer that did it. Her grandad passed away a few years after that but she has so many special memories of time spent with him.",
    "5e550b1494d9e6505ac3e26d": "The story is about a 22 year old girl who works at the bookstore. Her and her sister look after her ill grandpa who cannot move without assistance. One day when the girl was shelving books in the store she heard a voice in her head telling her to light a candle in the church and it would heal her grandpa. She went to the church, although she was apprehensive because she is not particularly religious. She lit the candle and then had the sense to go home. When she went home her grandpa was up and well. This happened 20 years ago. Her grandpa lived to be ninety surrounded by his family. The story encourages a sense of faith.",
    "5e1f321074dfbe028c2fbb18": "When the narrator was 22 (fresh out of college), they were working in a bookstore. They lived with their sister (their only other sibling) and grandpa, who was unwell and needed constant care. One day while shelving books, the narrator heard a voice tell them that if they went over to the old church and prayed, their grandpa would get better. Though they looked around the store, the narrator couldn't see anyone. The voice repeated itself. The narrator decided to take a break and head over to the church which was only a quarter of a mile away.\n\nAt the church, the narrator thought about advice their grandma had given them, that prayers from a sincere heart could come true, but prayers without faith were useless. The narrator had doubts as they were not particularly religious and had done their fair share of misdeeds. However they decided to go in to the church and knelt down to pray for their grandpa to get better. \n\nAfter praying, the narrator returned to work. Back at the bookstore, they got a strong feeling pulling them to go home. They left early and were astonished to see their grandpa sitting talking to their sister in the living room, despite the fact that their grandpa had been bedbound for several months. Their grandpa lived for several more years and even got to celebrate his 90th birthday surrounded by loved ones, who were all more grateful for the time they had together having been through such a lifechanging experience. The narrator was reflecting on this story 20 years later and how it had been such a turning point for them.",
    "60151380a2273d594f63aae3": "I graduated at 22 and worked in a bookstore 5 miles away.\nMy sister was looking after my grandpa.\nOne day while at work, I heard a voice asking me to go to the church nearby and light a candle for my grandpa.\nThe voice said this twice.\nI closed up the store and walked to the church.\nI said a clumsy prayer as I am not religious.\nWhen I got home, my grandpa had gotten energy to get up from his months of being bedridden.\nHe lived to his 90th birthday, when we had a party to celebrate him.\nThis has strengthened my faith that you are never alone.",
    "6447c2f4adb0bafcbae225bf": "Let me tell you a story about a time when I was twenty two and had my first job in a book store. My grandpa was staying with us and my sister was looking after him because he was unwell. Our parents were out of town at the time. There were only two of us sblings. While I was working I heard a voice in my head telling me to go to the local church and light a candle and say a prayer for my grandpa's health. I looked around but no one else had spoken. I carried on working but heard the voice again. I'm not particularly religious and I remember my grandma saying if you're sincere about saying a prayer it will be more effective. If you're not then it wont. I'm not a saint but I decided to go to the church. I locked up the shop, walked to the church and lit a candle and said a prayer. I prayed for my grandpa's health and recovery. I left the church and went back to the shop. As I was stacking books I had a sudden urge to go home. It was like something was pulling me to the house. There was no voice this time. I shut the shop and I went home. To my surprise my grandpa was sat in a chair in the living room talking to my sister. He hadn't been able to get out of bed for some time. My sister told me earlier on he'd had a sudden surge of energy and had felt able to get out of bed and walk. That was the start of my grandpa's recovery. He slowly got better and was able to live independently again. We treasured every moment with him. He went on to live many more years and celebrated his ninetieth birthday surrounded by his family. He passed away a few years after that but we were grateful for every moment we had with him. I don't know if his recovery was influenced by my prayer but I often think about that moment. It changed my perspective on faith and the power of it. That incident was twenty years ago but I often think about it. It's still a vivid memory for me. It made me think about the power of faith and prayer and made think that we are never truly alone.",
    "60f984adfea10999e9a39727": "I was 22 and just out of college. I was working in a bookstore. My sister and I were caring for our Grandpa while our parents were out of town. While working I heard a voice in my head saying to visit the church down the road and say a prayer. It repeated itself and I walked to the church after remembering my Grandma's words about prayers being answered if they were from a sincere heart. I went to the church and told God I didn't know how to pray but asked for help for my Grandpa. After work I went home and found him out of bed where he had been for months. He gained more strength and independence and celebrated his 90th birthday with family. He lived for many years after this. This happened over 20 years ago and I recall the feeling I had for faith and prayer and how it can bring about miracles.",
    "5995b7bef9db7d0001895985": "When working in a bookstore the writer heard a voice telling them to go to church and light a candle for his grandpa. They were staying in a quiet town with their sister and grandpa who was ill and had been bedridden for almost a year. When they were shelving books they heard the voice, they weren't sure what to do but heard the voice again so decided to walk down to the church. At the church they lit a candle for their grandpa. They weren't sure because they weren't particularly religious. After they had lit the candle they went back to work when they felt a pull to go home. Once they went home their grandpa was in the living room talking to their sister. The gradpa lived for a while after that and celebrated their 90th birthday with family and friends.",
    "5756decbba27eb0006d5201e": "It was a 22 year old fresh out of college who worked at a bookstore and lived with his sister and grandfather. His grandpa was unable to care for himself and was looked after his granddaughter. While working at the bookstore, our lead heard a voice that told him to go to church and light a candle. Having heard the voice, he decided to go there on his break. \n\nWhile at the church, he pondered and hesitated weighing up the push and pull of his decision; him not being religious but also how his mom stated you if you don't believe in faith, it won't work. Our character tried it and prayed; and miraculously, his grandpa could talk for the first time in years. It was the start of his recovery and led to many more years of his life before he passed. \n\nThe 22 year old then had believed in faith more that day. ",
    "61376e55710e09d0b8f4dcb3": "Man worked in a bookstore, he was 22 with 1 sister\nhe heard a voice asking him to light a candle for his ill Grandpa which he did\nMiraculously his Grandpa healed and made a full recovery\nSometimes you need faith",
    "60b0cac3c6533bac7605471f": "A girl who worked at a book store after graduating year back and her sister were left to care for their grandpa who was very sick,and their parents had gone for a weekend. One time when she was book shelving she heard a voice telling her to go to church and light candle for her grandpa to get back, she looked around to see who was telling her this but didn't see anyone, then she continued bookshelving and again hears the same voice. She wasn't a religious person but her late grandma always told them prayer works but inorder for it to manifest you need to have faith otherwise you just wasting time praying without faith. So she decided to go to the church found the candle and she prayed unto God whole heartedly to heal her grandpa, after that she went back to book store as she was working she suddenly felt the urge to go home like something was pulling her to go home so she did, and found her grandpa whom had not been able to get out of the bed because he was so weak found him seated on the couch and after that he gradually healed. He live long after that and eventually passed away.",
    "568db47ae3ef9e000ca0dcdd": "Guy works at bookstore, hears voice telling him to light a candle to heal his ailing granddad. He does, it works, Granddad lives to be 90 something and dies.",
    "6298d6f2015f1d50783c0ed9": "I was 22 and I worked in the bookstore. My grandpa was very sick and needed assistance to walk around. One day, I heard a voice telling me to go to the old church and light up a candle to heal my grandpa. Initially, I didn't want to go because I was not religious but then I remembered my grandma's words about prayer and the importance of faith and I decided to go. At the church, I prayed deep from my heart and asked God to return my grandpa's strength. When I returned home from work due to a strong feeling I saw my grandpa suddenly being able to talk to my sister at a good amount of strength after months of staying in bed. This began his recovery and he went on to leave for 20 years afterwards even celebrating his 90th once. This experience has changed my life and perspective on faith.",
    "5acb92e9e1099600016ad073": "The narrator is in their 40s and recalled when they were 22 years old a day when they were working 5 miles away at a local bookstore. They heard a voice twice in their head (no one was there) telling them to go to church and pray/light a candle for their sick Grandpa. They hesitated as they weren't religious but remembered their Grandma said a sincere prayer could help. Eventually they went in the church and prayed/lit a candle. When they went home their Grandpa was feeling better and it marked a turning point in his recovery. He has now died but celebrated his ninetieth birthday and was around for many months after the incident. The event gave the narrator more faith. ",
    "5ba7aa44dd5915000137e42f": "Let me tell you a story from when I was 22 year old. I’d just finished college. I was working at a bookstore. My parents were away for the weekend, it was only my sister and I in town to look after my grandpa. He was poorly and couldn’t get out of bed.\nThat was over 20years ago and I can remember it to this day ",
    "63d1494c8ed3bc3d40494d45": "A boy who worked at a bookstore who's grandfather was ill. But he heard a voice in his head to light a candle at the church for his grandfather to get better. In which his grandfather did get better and lived for many years after, but it all came down to having faith goes a long way.",
    "5c93073250e4fb0001f7907b": "Let me tell you a story about a time when I was twenty two years old, fresh out of college. I got a job at a bookstore. My sister took care of my grandpa. It was just us two siblings. Our parents were away. I was shelving books and heard a voice tell me to go to the church and light a candle for my grandpa and he would feel better. I looked around the store and no one else was in there. I heard the voice again. I looked around again and still nobody was in the store. I continued shelving books. I am not particularly religious and have been told that a prayer will not mean anything if I don't believe. I decided to walk to the church I was about a quarter mile close to it and light a candle for grandpa. I was back at the bookstore when I had a strong feeling to go to the house. Not a voice this time, an overwhelming feeling. I locked the bookstore and went home to find my grandpa sitting in a chair in the living room with my sister. He had not been able to get out of bed for months. My sister told me he suddenly had a surge of energy and was able to get out of bed and walk to the chair. It was amazing to see. That was the day he gradually began to get better. He got more energy and lived a few more years. We got to cherish our time with him. You are never truly alone.",
    "60d05712d155f607f2b7f664": "I was 22 years old and freshly graduated from college, it was about 5 miles from here. I was working in a bookstore at the time. My sister was looking after my bedridden grandpa, my parents were out of town for the weekend. I was stocking the shelves one day and a voice told me that I should go to the church and light a candle and my grandpa would get better. I looked around but I was alone. The voice said it again. I took a break and walked to the church it was only about a quarter-mile away. I was never a religious person but I felt the need to confess that I was not a perfect person but I should have faith. I grabbed a candle and knelt at the alter and prayed about my grandpa getting better. I went back to the bookstore and felt the urge to go home, it was like a force was pulling me home but there was no voice this time. I went home and found my grandpa sitting in the living room in a chair, he hadn't been able to get out of bed for months. My sister said he had a sudden surge of energy. That was the start of my grandpas road to recovery. He lived for many years cherished by our family. That was about 20 years ago, he passed away a couple years ago. His spirit lives on in all of our hearts.",
    "61fa9016d42cb19beec49061": "The narrator recalled how twenty years ago he worked in a bookshop and his sister cared for their grandfather. There parents were out of town. His grandfather was unwell and had been bedridden for weeks. One day in the bookshop he was shelving books and heard a voice which told him to go to church and pray for his grandfather. He initially ignored it but then it came again. He decided to shut the bookshop and go to the church. At the church he remembered his grandmother's words about prayer and faith, that faithful prayer could work, but a prayer without faith would do nothing. He went to the altar and asked God for his grandfather's health and guidance on what they should do. He went back to the bookshop but felt a strong urge to go home. At home he found his grandfather was feeling much better and was out of bed and talking. After his recovery the family valued the remaining time they had with him and he lived many years after that.",
    "5fd7c98ecffb0b080c0f1c84": "At 22 years old the young adult began his first job at a local bookstore. His parents were out of town and lived with his bedridden grandpa. At work he heard a voice telling him to go to the local church, light a candle and pray and the grandpa will get better. The young adult was not at all religious, however recalled how hus grandpa would pray. The young adult lit the candle and spoke to God, without knowing what to say asked for his grandpa's healing. As he went back to work hevhad a strong urge to go home. To his surprise, he saw his grandpa in the living room, he slowly gained more strength and lived a good few years and died at 90 years. ",
    "5e377e7147f5527223aee301": "Story teller was 22 when he started working at a bookstore. His grandpa had been bedridden for a while and was home with his sister and she was taking care of him since he couldn't move alone. One day when his parents were gone for a weekend, he was at work and heard a voice in his head continuously telling him that he should go to the church and light a candle for his grandpa to get better. He thought it was a prank and looked around but didn't see anyone else there, but the voice kept repeating. He left work to go to the church and tried it. He remembered his grandma saying \"prayers from the heart can bring miracles\". He lit a candle and said a prayer that admitted he doesn't do it often but he would like his grandpa to get better. He went back to work and continued his job, but had a sudden urge to go home. The storyteller went home to follow the urge and when he got home his grandpa was sitting upright on the couch. He was astonished as his grandpa had never been able to do so for around a year. He thinks back to the day in the church and if it played a role in his grandpa's recovery. His grandpa had to be around 70 at the time as they spent another 20 years together from that moment. Ever since that moment, the storyteller has believed in faith.",
    "60db48619d10beb5c73430f5": "The author was about 21 and home from college. Her sister was looking after her grandpa who was bed bound. She heard a voice saying that she should light a candle at the church. She tried to ignore the feeling as she wasn't particularly religous and her grandma said praying without faith is useless. But she gave in a lit the candle and prayed. Then she felt a voice inside of herself saying she should go home. When she arrived home her grandpa was sitting upright and talking to her sister,he said he felt a sudden feeling/change. From that day on he was getting better and better and he celebrated his 90th birthday with his family. and a few years later he died. From that day the author started believing in the power of prayer.",
    "5de16fd00e58661bb3519db8": "\nLet me share a story. I was twenty-two years old, fresh out of college. I was staying in a small town about five miles from here. I had just started my first job at a local bookstore. It was a quiet afternoon, and I was alone in the store. My grandpa, who had been bedridden for almost a year, was at home with my sister. She had to care for him daily, as he couldn't move around on his own. There were only two of us siblings, my sister and me. My parents had gone out of town for the weekend. As I was shelving books, I suddenly heard a voice inside my head. It said, \"If you go to the old church down the street and light a candle for your grandpa, he will get better.\" I looked around the bookstore, but no one was there. I continued with my work, trying to ignore the voice. It spoke to me again, repeating the same message. I looked around once more, but still found no one. I decided to take a break and walk to the church. I was only a short distance away, maybe a quarter-mile. As I approached the church, I hesitated for a moment. I was not a religious person. I remembered my grandma always saying that prayers from a sincere heart could bring miracles. On the other hand, she also said that prayers without faith were useless. I admitted to myself that I was far from being a saint. I had my share of mistakes and misdeeds. I thought about my grandpa and how much he meant to our family. Finally, I went inside the church and found a candle. I knelt down in front of the altar. I said, \"God, I don't know how to pray properly. But I am asking you with all my heart to heal my grandpa. Please help him regain his strength and guide us in taking care of him.\" After saying a prayer, I returned to the bookstore. I resumed my work, shelving books. Suddenly, I felt a strong urge to go home. It was as if something was pulling me towards the house. I didn't hear any voice this time. It was just an overwhelming feeling that I needed to go home. I locked up the store and rushed home. To my surprise, I found my grandpa sitting in the living room, talking to my sister. He hadn't been able to leave his bed for months without assistance. My sister told me that he had suddenly felt a surge of energy and was able to stand up and walk. That day started the beginning of his recovery. He gradually regained his strength and independence. It was a turning point in our lives. We became more grateful for the time we had together. I often thought back to that day in the church. I wondered if my prayer had anything to do with my grandpa's recovery. I couldn't be sure, but it definitely changed my perspective on faith and the power of prayer. My grandpa lived for many more years after that incident. He celebrated his ninetieth birthday surrounded by family and friends. We cherished every moment we had with him. That experience happened almost twenty years ago. It remains a vivid memory in my mind. My grandpa passed away a few years later, but his spirit lives on in our hearts. Sometimes, when I'm feeling lost or uncertain, I think back to that day. I remember the power of faith and the miracles it can bring. And I am reminded that we are never truly alone, even when it seems like we are.\n",
    "57a7337e913c710001977341": "Lady was working in her book store shelving books. She is one of two siblings the other being her sister. Her sister looked after their grandpa who had been bedridden for many months and had to be assisted with moving around and looking after him. Whilst working the lady heard a voice in her head saying if she went now to her church and lit a candle her grandpa would get better. She ignored the voice at first but the message was repeated many times. After a while the lady went to the church despite her lack of faith and before she went in she remembered her grandma’s words that a sincere prayer can work miracles but prayers without faith were useless. The lady whilst unsure lit a candle and knelt at the alter in prayer and asked god to help her grandpa recover and gain his strength and let him have a life again. She went back to the bookstore and continued to shelve books until she felt an overwhelming urge to go home. She locked up the bookstore and went home to find her grandpa in the living room having sat up in bed saying he had the urge to get up. Grandpa recovered and lived for a number of years and then passed away but the extra time with him was fulfilling for the family. The incident happened 20 years ago but has helped the lady in sad and troubled times to help her through.",
    "605ba57d2842d8291b4afd24": "The story is about a 22-year-old, fresh from college and was working in the local bookstore. She lived with her sister, parents and sick grandfather. One day when she was at work, busy shelving, she heard a voice instructing her to go to a church, light a candle and pray for her grandfather. She looked around and saw that she was alone in the store and was shocked. She was not particularly a religious person, so this was a bit strange for her, but she eventually went to the church and prayed for her grandfather. After praying, she went back to the store and when she was there, had this overwhelming feeling that she needed to go home. When she got home, she found her grandfather sitting and her sister told her that he had gotten out of bed on his own, which had not happened in months.",
    "605273bcd0b9b4510724f3d7": "girl 22 years old, sibling (one sister) first job was at a bookstore shelving books, the bookstore was close to a church. Gandpa was poorly and had been bedridden for almost a year, one day she heard a voice telling her to go and light a candle for her grandpa and this would make him better. She was hesitant as she wasn't really religious and remembered things her nan said such as prayers without faith are useless. She ended up going to the church, finding a candle, lighting it whilst kneeling at the alter. Afterwards she went back to work but felt a force but no voice telling her to go home. When she did go home her grandpa was at home with her sister but he was sat up not in bed. The sister said he had felt a rush of energy and was able to stand and walk. The grandpa got some of his independence back and she often wondered if her prayer at the church has helped. They got to enjoy many more years with him and he passed a few years later but they were all grateful for the extra time they had with him. ",
    "611fd5c03b9654834bd4af0e": "The person is 22 years old and working at a bookstore in their quiet town. They are at work while their sister is at home with their sick grandpa, and their parents are out of town. All of a sudden, the bookstore worker hears a voice saying to go down to the nearby church and light a candle for their grandpa. If they do this, it will heal him. After some contemplation, the worker goes to the church, and although uncertain about their faith, thinks of something their grandma used to say and goes in anyway. They make a prayer and light the candle, then return to work. Once back in the shop, they feel a strong urge to go back home. Once there, they see their grandpa is all better. In fact, he lives on for many years and they all get to celebrate his 90th birthday with him. The bookstore worker is thinking about these events 20 years later, and wonders to this day if that candle had anything to do with it.",
    "6417413921c539fd7d59e6e6": "22 year old girl worked in a bookstore. Her grandpa was unwell and she had voice that told her to go to church and light a candle and pray for him to make him better. She returned back to the bookstore and later had the feeling to go home. She went home and found her grandpa sitting up and recovering.  Her prays had been answered and he continue to get better. He lived for another 20 years.",
    "5f4e826dade9a507a7c6c2d3": "In my twenties, I worked in a bookstore. My grandpa was really sick at this moment, he couldn't get out of bed without help. My sister and I took care of him. One day, while I was working, I heard a voice in my head saying that \"I need to go to the old church and light a candle for my grandpa\". I ignored it, but then I heard this voice again, saying the exact same thing. I felt like i had to go to this church. I closed the bookstore and went to the church. I wasn't sure if I should do this, because I wasn't a believing person, but I did this anyway. After that, I went back to work. Then I felt this strong urge to go home, as if something was pulling me there. I closed the store and went to home. When I came in, I saw my grandpa sitting in the living room with my sister. She told me that he suddenly got so much energy, that he could stand up by himself. He lived a long time after this event. I still come back in my memories to this day, thinking if my prayers had something to do with \"healing\" my grandpa. This changed my thinking about faith and prayers.",
    "5dcc6f91e5e18690a20e74d1": "A man recalls a time in his young life at 22 years old\nHe was jsut out of collage and working in a bookstore in his small town.\nHis parents were out of town and his sister was at home with their grandfather who was bedridden.\nWhile working on a particular day he heard a voice in his head telling him to go to church and light a candle for his grandfather.  No one was with him in the shop as he looked around then he heard the voice again.\nHe took a break from work and walked to the church.\nHe wasnt a religious person but he remembered his grandmother saying that a prayer could work miracles but a prayer with no faith was useless.\nHe prayed to God to help his grandfather get better.\nHe then returned to work.  A little later he felt a strong urge to go home, there was no voice this time just an urgentfeeling  to go home.\nHe shut the shop and returned home.  when he got there he found his grandfather in the living room chatting to his sister and this was the first time he had been able to leave his bed in a long time.  It was the beginning of his grandfathers recovery.\nHis grandfather lived to celebrate his 90th birthday and a few years more.\nThe man writing the story gained a certain amount of faith from this episode in his life and always wondered if the prayer had indeed helped his grandfather get better.",
    "5fb92475bca3903c9f3f7d45": "The person was young and working in a bookstore when one day he heard a voice telling him to o and light the candle at church for his grandpa at first he tried to ignore it but the voice repeated and he decided to head to the church before he entered he church he remembered the words from his grandma telling them about how powerful a prayer can be if you pray with a sincere heart, so he went ahead inside the church where he found a candle and started to pray for his grandpa after that he went back to the bookstore where he felt a sudden surge to go home, he got up and lock the store and went straight home when he got there he found his grandpa sitting in a stool and looked better then when he left him that morning and that was beginning of his recovery. The grandpa lived till he was ninety years old.",
    "615776777c08445c8ffd8d1b": "The writer was 22 and had just graduated college. They were working in a bookstore near their hometown when they heard a voice telling them that if they went to light a candle in the church down the street their grandfather would regain his strength. He was looked after by their sister, and was bedridden. Their parents were away. They heard the voice twice and went to the church. Although not religious, they lit a candle and said a prayer at the altar, asking god to give their grandfather his strength back. They returned to the bookstore and continued shelving books, when they had a powerful urge to return home. They locked up the bookstore and went home, to find their grandfather sitting in a chair in the living room, something he had not done for a long time. He said he had felt the strength returning to him. He lived for many more years and celebrated his 90th birthday surrounded by family. The writer said although this all happened 20 years ago they remembered it well and wondered if their prayer had been the reason for their grandfather getting better. They said their grandmother had told them that if a prayer was said sincerely it had power, but if it was said with no sincerity or meaning it was useless. They were happy that they had many more happy years with their grandfather.",
    "5ea00067d330db1ac58c6163": "Twenty years ago i left college and went to work in a book store. I had a vision that i should go to church and light a candle to pray for my grandpa. I went to church, lit s candle and prayed. My sister told me to come home. When i got there my grandpa was out of bed. It changed my attitude to prayer. My grandpa lived for several more years.",
    "5edfeb15743509317e9ec17c": "A boy was at home looking after his very ill grandpa. He heard a voice say if he went to the church and light a candle, his grandpa would get better. He ignored it. He then heard it again. He decided to go and light a candle. When he got home, his grandpa was much better. He lived for 20 more years.",
    "5c2bb03b9fb36d000198e2d7": "A young man fresh out of college was working in a bookstore. His grandfather was bedridden at home with the young mans sister. The sister was taking care of the granfather. The young man heard a voice telling him to go to the church nearby and light a candle for his grandfather and he would be healed. After some hesitation he went to the church and lit the candle and said a short prayer despite his hesitations. He went back to the bookstore and continued working. Shortly after he felt a strong urge to go home. He locked up the store and went home. His grandfather was sitting up in the living room after having been bed ridden for months. In what seemed to be a miracle his grandfather lived on for years. This expereince helped the young man appreciate more and value prayer and faith.",
    "630492ce98f024b7188676df": "the person was 22 years old working in a book store. Their grandpa was bedridden. The person thought they heard voices saying go to church but no one was in the store. They locked up and went to church to pray even though they weren't really religious. They prayed for their grandpa to get better. They went back to work then felt the urge to go home. At home the grandpa had felt a surge of energy and got out of bed alone, the first time in months and said he felt better. He gradually recovered and lived to celebrate his 90th birthday. This happened 20 years ago and the narrator said they still think about it when they are losing faith",
    "647ba080cdf4db4ed1a2e695": "Let met tell you a story. I was in college and was working in a bookstore. My grandfather was sick and I have a sister. While shelving book, I heard a voice telling me that if I want my grandfather to get well, then I have to go to church and pray. I was not religious, but I went anyway and prayed. I went back to the bookstore and had a feeling to go home. When I went home I saw my grandfather sitting on the couch. He had never left his bed before, so this surprised me. He lived on for many more years to come. I do not know if my prayer had anything to do with it. When I feel alone, I remind myself that prayer can work. ",
    "5c5ad828903c7700010a4635": "my story begins when i was 22 and just fresh out of college, i was working at a bookstore. one day i had an overwhelming urge to go to church and pray and light a candle for my grandpa. there was only 2 siblings myself and my sister who looked after my grandpa as he hadnt been able to do anything without assistance. my parents were out of town for the week. i went to church and prayed to give my grandpa strenghth.i returned to the bookstore but had another urge to return to granpas house, when i arrived grandpa was in the lounge talking to my sister she said that he had a sudden surge of energy and strenghth and got up and walked to the lounge, grandpa had been bedbound as he was unable to do anything without assistance. grandpa lived a few more years until 90 that was 20 years ago but i will always remember that praying gives us strenghth and hope. grandma says that prayers are useless if you dont believe, but strong if you do.",
    "5f3dbd5e99a9be1da93d9039": "Guy was 22 years old working in a bookstore and himself and sister were minding their bedridden grandpa while their parents were away for the weekend.\n\nA voice told him to pray at the church and his grandpa would get better which he did.\n\nWhile back at the bookstore he got an urge to go home and found his grandpa sitting up for the first time in years.After this hept recovering and had a 90th birthday party years later.\n\nHe passed a few years after that and the guy always thought about whether the power of prayer truly helped his grandpa.",
    "60858088111c462ba649ead5": "A 22 year old woman lives 5 miles away from town. Her grandpa had been bedridden for awhile. She works in a bookstore when one day she heard someone say 'go to the old church and pray', she doesn't believe in religion or faith. She lives with her sister and grandpa and her parents were away for the weekend.\n\nHer mother said, if 'you truly believe in something it could become true'.\n\nThat day she went to the old church and prayed, she then had a sudden urge to go home and saw her sister speaking to her grandpa and he was better. Over the years his strength got better and recovered. \n\nIt's been twenty years.\n\nShe never believed in faith or religion but now she has a feeling that we are not really alone and if we ask for something we can possibly have it.\n\nA couple years later her grandpa passed away.",
    "636a354233b567a40c34ef2f": "I WAS 22 YEAR, FINISHED COLLEGE,JUST STARTED A FIRST JOB AT LOCAL BOOKSRORE,WAS AT THE STORE WHEN MY GRANDPA WHO HAS BEEN BEDRIDDEN FOR A YEAR WITH MY SITER, AS I WAS SHELVING BOOKS, SUDDENLY HEAD A VOICE INSIDE MY HEAD, SAYING IF U GO TO THE OLD CHURCH DOWMN THE STREET, AND LIGHT A CANDLE FOR YOUR GRANDPA HE WILL GET BETTER,I TRIED TO IGNORE, IT SPOKE AGAIN REPEATING THE SAME THING, LOOKED ROUND STILL NONE,I DECIDED TO GO TO THE CHURCH AND LIGHT THE CANDLE BELEIVING IN IT WITH ALL OF MY HEART,I SAID GOD I DONT KNOW HOW TO PRAY BUT I ASK YOU TO HEAL MY GRANDPA,, LET HIM REGAIN STRENGHT AND GUIDE US IN TAKING CARE OF HIM, THEN I RETURNED TO THE BOOKSHOP,THEN FELT LIKE GOING HOME,SOMETHING WAS PULLING ME TO THE HOUSE,DIDNT HEAR A VOICE ,I LOOKED UP THE SHORE AND WENT HOME,TO MY SUPRSIE I SAW MY GRANDPA SITTING IN THE LIVING ROOM TALKING TO MY SISTER, MY SISTER SAID HE SUDDENLY HAD THE ENERGY TO STAND AND WALK,IT WAS A TURNING POINT IN OUR LIVES,I WONDERED IF MY PRAYER HAD ANYTHING TO DO WITH IT WHEN I THINK BCK TO THAT DAY,WASNT SURE BUT I CHANNGED MY PERSPECTIVE OF FAITH, MY GRANDPA LIVED MANY MORE YEARS AND CELEBRATED HIS 90TH BIRTHDAY,SURROUNDED BY EVERYONE,THAT EXPRIENCED HAPPENED 20 YERS AGO,IT REMIANS IN MY MIND, GRANDPA PASSED AWAY FEW YERS LATER BUT HIS SPIRIT LIVE ON,I REMEMBER THE POWER OF FAITH AND MIRACLE AND ALSO WE ARE NOT REALLY ALONE EVEN WHEN IT FEEELS LIKE WE ARE.",
    "5629f7f1c8ffc2000f5135a0": "A person was working in a bookshop near to the home. He was 22. He had just one sister who was caring for the grandad, who was bed ridden, as the parents were out of town. The young person heard a voice which said he must go to the church to light a candle. If he did that the grandad would get better. He did that and went back to the bookshop where he continued to shelve the books. He than had an urge to go home - no voice this time - where he found his grandad in a chair. He was told that the grandad had an urge to get out of the bed where he had been for many months. The grandad continued to get better and lived to 90.",
    "5e39f4be81b2ac0a49f999e6": "I started my first job in a bookstore. My grandad was bedridden for a year and My sister looked after him. At work one day I heard a voice talking about the church and I was going to be a saint. I went to the church and prayed for my grandad to be healed. I went home and saw my grandad. My sister said he found some energy and started to walk",
    "5d3594902fd5a4001ae58fb9": "The narrator was 22 and worked in a bookstore. they heard a voice telling them to go to a church and light a candle so that their grandfather would recover. The narrator did, and prayed. His grandfather recovered but died a few years later",
    "60c7928e14e0a43a43369a5b": "when this in college working in a bookstore, he felt a presence urging him to go to the nearby church to light a candle for his bed ridden grandpa that was home with his sister. when he went back to the store after lighting the candle that presence urged to go home where he found his grandpa sitting in the living room with his sister he had gotten out of bed after being bed ridden for a while. he died a few years later.",
    "608fd64f1e11fe3f5c0dae08": "There was a young man who was fresh out of college who worked about 5 miles from where he lives at the moment. He had 1 sibling who was a girl who was constantly caring for their frail grandfather who was very sick at that time, he didnt even have the strength to leave his bed in his bedroom to move around, he had been like this for months. She was the only person looking after him as both their parents were out of town  One day as he was packing books onto a bookshelf he felt or heard a voice saying to him' You must go to the church down the road, grab a candle, light it and prey for your grandfathers recovery. The man thought nothing more of the voices and continued to pack the shelves, however the voices kept repeating the same things over and over again. He eventually walked a quarter mile down the street to where the church was and did what the voices said. He entered the church, found a candle, lit it and knelt down at the altar. He began praying to god, however he didn't know how to prey so he apologized to god and continued to do as he was told. He asked god to give his grandfather strength and health. After this he got up went back to the bookstore and carried on packing. However this time he felt an extremely strong urge to head back home. He listened to the urge and locked up the shop. After speeding home he opened the door only to see his grampa in the living room out of his room. After this event the young man always wondered if the prayer had anything to do with his grandfathers recovery. His grampa lived another 20 years after the event and eventually died however leaving his feeling of his presence in their hearts.",
    "5d9f4d5f3cac2b0016c79242": "A 22 year old in college started her first job at a bookstore, she was one of two siblings, her other sibling was her sister. Their grandfather was sick and dying but one day while she shelving books at the bookstore she heard a voice inside her head telling her to light a candle outside the church to save her grandfather. She went and did it, her grandfather miraculously recovered and lived for a few more years afterwards living past 90. This happened to her a few years ago and she will never forget it.",
    "6072f8908ca848cb61dcce5d": "This person was 22 years old and worked in a bookstore. They lived with their Grandfather and sister, as their parent were away for the weekend. The grandfather had been bedridden for months and had not been able to leave his room without assistance. The person suddenly heard a voice tell them to go to the park and light a candle, after which their grandfather will get better. The person was not a particularly religious person but did so. They then locked up the bookstore and returned home to see their grandfather in the living room for the first time in months. The person's sister confirmed the grandfather had energy to get up from bed without assistance.",
    "6442db170a41e59ffe011949": "The main character was 22, and started working in a bookstore after graduating from college. He is one of 2 siblings, as he has a sister. His grandfather is ill at home and parents are away from town. One day whilst working, he heard a voice saying to go and light a candle for his grandad at the church. He went to church and lit the candle and prayed that his grandad would recover. He then returned to work where he suddenly had a strong urge to go home. When he got home, his grandfather was starting to feel better. This marked the start of his grandfathers recovery.",
    "60c9fcbb6090f57f63cdbebf": "A 22 year old man was working in the bookstore.  He had recently finished college.  His grandpa was being looked after by his sister at home - he was bedridden. It was a weekend and his parents were not home so it was just his sister and him looking after him.  He was shelving books when he heard a voice tell him to go to the church and light a candle for his grandpa.  He looked around and didn't see anyone.  He carried on working but heard the voice again.  He tried to ignore it but then decided to lock up the store and take his break and go the church.  Whilst walking to the church, which was a short walk away, he remember what his grandma use to say - a prayer is powerful if sincere but also a prayer without faith is useless. He wasn't religious but decided to go into the church.  He found a candle and lit it and then knelt infront of the alter and prayed \"I don't know how to pray but please make my grandpa well and guide us to help look after him\" or words to that effect.  He went back to the store.  He then felt an urge to go home - no voices this time just an urge to go home.  He went home and found his grandpa sitting in the living room.  His sister said he suddenly got a surge of energy and got up and walked.  He didn't know whether this had anything to do with his prayer or not but it definitely changed his thinking on how powerful prayer can be.   He grandpa lived for 20 more years and lived to 90 years old and they celebrated their time together.  He had died now a couple of years ago but to this day the man still remembers that day clearly and how it has changed his perspective on the power of prayer.",
    "60a3cb60b3e2bdb82a865197": "A man is recalling an incident that happened almost twenty years ago when his grandfather was sick at home with his younger sister. He was at work packing some bookshelves when he herad a voice say to him that if he went down to the old church and light a candle for his grandfather he would get better. He was not a prayerful person  but he remembered his grandmother saying that a prayer made by a faithful person could bring about change. He went home and his grandfatjer was much better he was talking to his sister. He went on to live well into his nineties.",
    "5e42e8ce900ca402ea108764": "The persons grandad was ill so they were going to the church to light a candle as someone said that would help. They prayed to god.",
    "6318aed60b7ae5e0c899d3ee": "Girl 22, just left college working in local book store hears a voice telling her to go and light a candle in the church for her bedridden grandpa to make him recover. She did, even though she wasn't particularly religious, but she remembered her grandma saying that a sincere prayer could perform miracles, even though she'd made her fair share of mistakes. She lit the candle and returned to the book store, where she had an overwhelming feeling that she needed to go home. She locked up and did so, to find her grandpa sitting in a chair, having had a sudden surge of energy to get out of bed, which he hadn't done for a long time. That was the start of his recovery, and she often reflects on that day almost 20 years ago. Her grandpa celebrated his 90th birthday surrounded by family, and they cherished every day with him until he died, a few years ago",
    "5e349c07e2790c468d9775aa": "One day I was a young boy and my sister was caring for my grandpa who was bedridden. I was working at a bookstore. There was only two siblings me and my sister. One day when I was shelving books a voice said to me to light a candle at the church for my grandpa and he would regain his strength. Although I wasn’t a strong believer and my grandma said prayer without belief was pointless I went and lit a candle. I said despite my misdeeds I was looking for help and strength for my grandpa to help him. I then returned to the bookstore to shelve books. I then felt a strong pull to return home. No voice just an overwhelming urge. When I returned home grandpa was sitting in the chair which he hadn’t done for some time as he didn’t leave his bed. My sister he had come over with a surge of energy. For many years we enjoyed our time together as a family after that. This was almost twenty years ago. It has reminded me to keep faith. My grandpa died a few years later but we cherished every moment because of this. ",
    "60f88d15328d079d8d68fe00": "The guy was 22 years old working in a bookstore 5 miles from college/university. His sister cared for his grandfather, who had been bedridden and required care given by the sister. On a weekend, where the guy's parents were away, he was working at the store, when he heard a voice tell him that if he lit a candle at the local church his grandfather's health would improve and he would become mobile. The guy did this and prayed, then returned to work. He got an overwhelming urge to go home, so closed the store and found his grandfather sitting in the living room with the sister, where the grandfather felt a rush of energy and moved himself from his bed to the living room chair unassisted. The grandfather's health continued to improve, were he lived and celebrated his 90th birthday, but died some years later. The guy wonders whether his prayer caused the events to transpire in this way, and is mindful of the power of faith, prayer and belief",
    "55f821f832af740005172118": "A man without faith decided to pray at church for his sick grandpa to heal and he believes it worked because his grandpa got up from his sick bed and lived for many more years",
    "6019af2fccedd613b582048e": "22yr old fresh out of college gets first job in a bookstore in a small town. she has a sister at home looking after the bed ridden grandpa and the parents are out of town. hears voices in her head and goes to church to light a candle for grandpa then goes back to work, then goes home to find grandpa up and about. he lives to 90 and she thinks its because she prayed",
    "605db73fe547ff7c425f59de": "The story is about a 22 years old young woman who live five miles from here. She had just started working at a bookstore after college and was shelving books at the store when she heard a voice in here head telling her to go to a church a light a candle to pray for her grandpa's health. Her grandpa and her sister were at home at the time and her granpa was bedridden for about a year at that point and her sister took care of him since he couldn't move around. After hearing the voice, she tried to see where it's coming from but she couldn't find it so she ignored it until it sounded again and this time she decided to take a break and go to the church down the street. She was not a religious person but after thinking about how she needed her grandpa to be better, she decided to pray and light the candle wholeheartedly. After the prayer, she went back to the bookstore and while she was busy working, she felt a strong urge to go home and she did after locking the store. She was surprised to see her grandpa and sister talking in the living room after she got home since her grandpa should have been bedridden at the time. They celebrated afterwards, and although this happened 20 years ago, she still remembers it vividly. ",
    "5f95f7f71193824c90e0b5ef": "A 22 year old working in a bookshop heard a voice telling him to light a candle at the church for his sick grandpa. After he had lit the candle he went home and found his grandpa who had been unable to get out of bed sitting out in a chair with renewed energy. His grandpa made a full recovery and lived for many years",
    "5803cb9a3073510001231d82": "22 years old working in a bookstore shelving books. My sister cares for our grandpa whilst our parents are out of town.\nOne day whilst stacking the shelves with books I hear a voice say to me 'if you go to church & light a candle your grandpa will get better'.\nThis 'voice' kept nagging at me. So I shut the bookstore & headed to the church. I stood a while outside pondering\nwhether to go in. I went in, lit a candle & said a prayer for grandpa.\nI went back to the bookstore & reopened it for a while before a nagging voice in my head told me to go home.\nI returned home where I was surprised to see grandpa sat up in a chair, something I hadn't seen for a while. Grandpa lived for a good few years after. \nMaybe it was the prayer that helped him get better/more mobile, who knows.\nDo you believe in the power of prayer?",
    "5c78452cac90ae000144bb23": "when a girl was 22, just finished college she worked in a bookshop. Her grandpa was ill at home and was looked after by her sister, she had one sibling- her sister. One day, she heard a voice in her head to pray for her grandpa. She was alone in the bookshop so she knew it was no one in the store. She then went to the church to pray and when she got back home her grandpa, who normally cannot walk, had energy to walk. This has given her faith in prayer and although her grandpa passed a couple years later it reminds her of how strong faith is.",
    "5a66568a63394a0001558e4d": "Let me tell you a story from when I was twenty-two years old. My grandpa was very sick. I worked in a bookstore at the time. Suddenly, I heard a voice in my head that said \"light a candle for your grandpa at the church\". I was only a short distance from the church. A quarter mile. I had never been a religious man but my grandma had told me the power of faith. As I entered the church, I knelt and said \"God, I don't know how to pray. but please restore my grandpa to his strength and guide us in looking after him\".\n\nI returned to the bookshop after. Suddenly, I felt a strong urge to return home. I locked up the shop and went home. I was shocked to find my grandpa in the living room talking to my sister. He hadn't left his bed for months without assistance.\n\nHe lived for many more years and celebrated his ninetieth birthday surrounded by his loved one. He died several years later but his spirit lives on in our hearts.",
    "5ced0ccddfb2720019962226": "the boy took a job in bookstore during his break from university and his sister was looking after their grandad as his parents were away for the weekend his grandad had been bedridden for some time while book stacking he heard a voice tell him to go light a candle and say a prayer for his grandad so he did even though he wasn't a church goer, when he got back to bookstore he felt a sudden urge to go home where he found his grandad sitting in the kitchen looking much better and some thing he hadn't done for some time he said he felt sudden surge of energy and strength maybe the prayer and lighting of the candle had worked his grandad got healthier and stronger and lived to ninety.  ",
    "5f4cc45ee974b18dbf4a503d": "A twenty two year old person had just finished college and was working in a book store. He had a sickly grandfather and a sister that looked after him. Whilst packing the shelves he heard a voice in his head that said he should go to the church and light a candle for his grandfather. He looked around the book store and didn't see anyone then heard the voice say the same thing again. He decided to go down to the church, even though he isn't religious, and light a candle and say a little prayer. Later he got home and his grandfather was feeling a little better. He lived for 20 more years and now the person seems more religious and takes comfort in his memories of his grandfather.",
    "5c6c81cf1137e9000178795b": "when he was 22 years old he worked in a book store which was five miles from his house. he live with his sister and grandpa who was bedridden for many years. whilst in the bookstore he hard a voice telling him to pray and he remembered his grandma told him pray brings miracles so he went to church and asked god to help his grandpa even though he wasn't religious he was asking for a miracle. he was then told by his sister that his grandpa suddenly left the bed which he believed was a miracle. his grandpa celebrated his 90th birthday and passed away a few years later. ",
    "615e0a9b470e2794d8318046": "A boy worked in a book shop. He had one sister who looked after his grandfather, who wasn’t able to look after himself. One day while shelving books, the boy heard a voice that told him to go to the church and light a candle for his grandfather. If he did this, and prayed, his grandfather would regain his strength. His grandfather hadn’t been able to leave his bed for months. The church wasn’t far down the road so the boy went. He found a candle and kneeled down. He wasn’t a very religious person so he started his prayer by saying he wasn’t sure how to pray. He asked for his grandfather to regain his strength. When the boys was back at the book shop he had an overwhelming feeling to go home. So he closed the bookshop and went home. When he arrived home his grandfather was sitting downstairs, and he hadn’t been able to leave the bed in months. His grandfather lived for many more years and they all cherished the time they had with him. The boy looked back and wondered did his prayer have anything to do with his grandfather regaining his strength and recovering. ",
    "616d8ff5eeb9a8616afa647d": "The story takes place some years years ago, when the storyteller was young. He had a sister. His grandfather was very unwell and was bed ridden. One day he was working in a bookshop stacking shelves, when he heard a voice in his head. The voice was telling him to go to the local church and light a candle for his grandfather. He looked around the store, but he was alone. He went back to stacking books but he kept on hearing the voice. Although he was not religious, he decided to go to the local church and do as the voice said. When he got to the church he said a prayer for this grandfather. He returned to the bookshop and continued to stack shelves. However, he soon had an overwhelming feeling to return home, so he locked up the bookshop and went home. When he entered he heard his grandad talking to his sister in the living room. His prayer seemed to have been answered and his grandad got better. He celebrated his ninetieth birthday and died shortly afterwards. The event had a big impact on the storytellers life and from that dat forth he gained faith.",
    "5772b5b39137f30001ebbbb7": "Let me tell you a story about when I was twenty two, fresh out of college. I was working in a bookstore and living with my sister then. My sister was taking care of my grandpa, who was bedridde. One day as I was working I heard a voice in my head telling me to go to the church yard. I am not a particularly religious person. I heard the voice again and went looking for the church. I found the church and I prayed. After that I went home. My sister was there and she told me my grandfather had experienced a sudden surge of energy. That marked the beginning of his recovery. After that he steadily got better and made a full recovery. That was twenty years ago and he went on to live a full life till he passed at the age of ninety. That was the beginning of my faith. Sometimes when things get tough I still look back on that moment and remember the power of faith and prayer.",
    "5b9110223366db0001157e7d": "as a young man he had judst started his first job and a voice inside his head urged him to go to the church and light a candle, he did and his granpa recovered. This incident made him beleive in faith and prayer.",
    "60199b0a7384e30ddf3a7c55": "HE WAS 22 AND STARTED FIRST JOB IN BOOKSHOP.HIS GRANDA WAS BEDRIDDEN AND WAS BEING CARED FOR BY HIS SISTER.HE HAD A LIGHT BULB MOMENT WHERE HE WAS TOLD TO LIGHT A CANDLE IN THE LOCAL CHURCH AND HIS GRANDPA MIGHT IMPROVE BUT HE WAS ALONE.HE KEPT HEARING THE VOICE. HE TOOK A BREAK AND WENT TO THE CHURCH NOT FAR.AFTER SOME HESITATION HE ENTERED THE CHURCH,GOT A CANDLE AND KNELT DOWN AND ASKED FOR HIS GRANDPA TO BE HEALED.HE RETURNED TO THE BOOKSHOP BUT NEEDED TO GO HOME AS HE WAS INSPIRED AND WHEN HE GOT THERE HIS GRANDPA WAS ABLE TO LEAVE HIS BED UNASSISTED. HE FINALLY REGAINED HIS INDEPENDENCE AND CHANGED EVERYONES LIFE FOR THE BETTER AND LIVED INTO HIS NINTIESAND MAYBE PRAYER AND FAITH IS THE ANSWER",
    "5cfaf97eadb3da00013c1eaa": "There was a boy who had a sister and a granpa. His grandma had dies and his granpa was very weak and could not care for himself. Therefore he worked in the bookstore while his sister took care of the grandpa. One day while at the bookstore, he heard a voice twice telling him to go to the church to light a candle and pray for the grandpa. On his way he hesitated but still wen ahead and prayed a simple prayer for his grnadpas healing. he was not a particularly religious person and his granma always told him prayer should come from a sincere heart. These were the reasons fro his resistance. However back at the bookstore, while resuming his tasks, he felt a strong urge to go home after obliging, he was surprised to find his granpa sitting in a chair and chatting with his sister. This was not normal as he was unable to get up from bed. Grandpa explained that he felt a surge of energy a while ago and sister was happy. The write could not believe this had anything to do with his prayer. Grnadpa however made continuous recovery and lived a long time after that dying at about ninety years in the midst of family and friends. This taught the writer about faith and another presence with us even though we seem to be alone, there's always someone looking out for us.",
    "62a1ef4b118ae7c6c666e130": "The story is about a 22 year old that was hearing voices in their head & also had an ill grandpa. They prayed for their grandpa to get better which he did but he eventually died. The moral of the story was to always have faith & that you’re never alone",
    "55ad3f2dfdf99b563a2471c8": "When I was twenty two years old I was working in a book store. At the time my grandpa became unwell. Whilst stacking books in the store I heard a voice telling me to go to the alter and light a candle for him. I looked around but couldn't see anyone but the voice remained. My grandma always told me a prayer from a sincere heart can have a meaningful impact, but a prayer from someone with no faith is meaningless. I know I am not a saint as I have made many mistakes. But as I was leaving the store I felt compelled to turn around and go to pray. I said my prayer that I don't know how to pray but would like support for my grandpa. Once I returned home I was suprised to see my grandpa in the living room, my sister told me he had started to recover. This was the first time I had seen him as normally he was bedridden and it marked the tart of his recovery. I wasn't sure if my prayer had anything to do with his recovery, but it did make me reconsider my views on faith. We then spent as much time as we could with my grandpa as he made his recovery and learnt to enjoy the tim we had together. He continued to live on for many years seeing through his 90th birthday before passing away peacefully.",
    "634e7e0695471fa84bfe5f2f": "Started working at a bookstore straight out of college at 22 years old. Grandpa was sick. Only two siblings, me and my sister to look after him. Heard a voice in my head to go to the church, light a candle and pray for his grandpa to get better and recover. Not religious but went to church anyway and lit and candle and prayed. Went back to the bookstore and had overwhelming feeling that he needed to go home. Went home and grandpa was out of bed and sitting in the living room with my sister. He hadn't gotten out of bed for months without assistance. This was the start of his recovery. Got better and lived until 90 before passing away recently. Made me think of the power of faith.",
    "60dcc945f7ee60621d36b715": "The author is in his twenties and was working in a bookstore. His grandfather was poorly and living with him and his parents and his parents are away for the weekend. \nWhen he was at work he had a voice say to his to go to the church and he felt compelled to go,even though he had no strong faith. He tells how his grandmother used to say something about no prayer is wasted but also that a prayer without conviction was worth less- or words to that effect. He went to the church and said to God he didn't really know how to pray but that he was praying for his grandfather's healing. \n\nHe returned to work but when there felt a strong urge that he must return home. So he closed up the bookstore and went home.\n\nOn getting home, he was surprised to find his grandfather sat up in the living room, talking with his sister, as he had been bedridden for months prior to the. His sister told him that he just suddenly had the energy to get up.\n\nThe author muses whether his visit to the church has anything to do with this. \n\nFrom then on, his grandfather continues to gain strength and return to his health and lived for many years into his 90s. \n\nThis story became a something of a family legend and lives strong in the authors memory. ",
    "5f7760d025023628ce3f4d05": "A man 22 years old, fresh out of college is looking after his ill grandpa with his sister at their family home while his parents are put of town. He has a job at a bookstore and whilst working, hears an imaginary voice telling him to go to the church and light a candle. He does it, despite not really believing it, but thinking about what his grandma used to say, he goes anyway. Once back to the bookstore after lighting the candle he gets a strong urge to go home. When he gets home his grandpa is sitting in the lounge despite not being able to get out of bed for months. His grandpa lived a few more years after that. The write is recalling the story from 20 years ago",
    "64528c575f51539110be524a": "let me share a story when I was twenty years old. I finished my school and started a job. we are two siblings and a grandpa. our grandpa was bedridden, he could not move on his own. One day, I felt someone saying to me go down to the church and pray. I had ignored that many times but one day I felt an urge to go there. I was not a religious person. I went to the church, knelt down, and say a prayer to God to recover my grandpa and give him a healthy life so he could move. I have heard that prayer from the heart with strong belief never goes unheard and prayer without a belief is never heard. so, said a prayer and went home. when I went home, to my surprise my sister told me that Grandpa suddenly felt some unbelievable energy and he stood up without any support. that day, made my belief strong that no prayer goes wasted. Grandpa lived so many years with spirit and health. ",
    "5d39a607190d3e000100e72a": "\"When I was 22 years just after college I went to work in bookstore. On the weekend in question my parents were out of town and my sister was minding my grandpa who was bedridden. Suddenly I heard a voice in my head telling me to go to the church to light a candle for grandpa and he would get better. I looked around the store and there definitely wasn't anyway else in there with me. I wasn't a overtly religious person nor would I call myself a saint. I decided that I would go to the church, I entered, lit a candle, and said a prayer. I then went back to the store. I had this overwhelmingly feeling that I needed to go home and I closed up shop. When I got home I saw that my grandpa sitting in the living room. My sister informed me that he had got there himself, he hadn't been able to get out of bed unassisted in months. Up to this point I hadn't believe too strongly in faith and miracles but this felt like one. My grandpa gradually made a recovery and recovered his strength and independence. He went on to sleep long more years and celebrated his 90th birthday surrounded by family. Whenever I feel lost I think back to this vivid memory to brighten my day. ",
    "5e9883baf93c610a951f26e7": "I am 22 years old and I was walking to the bookstore, where I work. At home, I have a grandpa and a sister. My grandapa is bedbound and is not in a good state. My sister looks after him. While shelving, I heard a noise in my head \"Come to the church and pray for your grandpa and he will get better\". I looked around and nobody was there. I closed the bookstore and walked to the church which was a quater of a mile away. On the way I rememebred my granma's words. I am not particularly religious but she said that prayers with a sincere heart come true. On the other hand, she said prayers without faith were useless. In the church I prayed for my grandpa to get better. I left and went back to shelving at the bookstore. I then felt the sudden urge to leave and go home so I locked up and went home. When I arrived, I found my grandpa sitting in the chair in the living room talking to my sister, which was a surprise because he was bedbound for the last few years. My sister said he felt a sudden urge of energy and managed to get out of bed. That marked the first day of his recovery. He lived until his 90th birthday is good health. That was 20 years ago and he died several years later. Sometimes now when I think about it I am reminded that we are not alone even when it may appear we are.",
    "5e8e5058e690d70ebefeb033": "Man lives with his grandpa and his sister, his grandpa is bed ridden and is recovering from illness. His parents are out for the weekend. He works at a library 20 miles away from the town, whilst working he was urged by a voice in his head to go the local church and light a candle, he kept putting back the thought but it kept repeating over and over till he decided to go to the local church. Once at the local church he said that his grandma used to have a strong faith and that she would say prayers work but only for those with faith. He prayed to god for his grandpa to recover. He felt a strong urge to go home and check on his grandpa, so he immediatly went home and found his grandpa sitting in the living room talking to his sister. He had managed to get up on his own and that became the start of his grandpas long recovery. The grandpa lived to celeberate his 90th birthday surrounded by all the family, until he passed away a few years later and the memories with the grandpa are cherished by him. He is now a man with stronger faith and believes in the power of faith and miracles, and tells us that we are never alone.",
    "5ac68755fa3b4e0001737f38": "The narrator was working in a bookstore.  Their sister was at home caring for their bedridden grandpa.  Suddenly, a voice in their head said go and pray for your grandpa and he will get better.  The narrator went to the church.  They explained how skeptical they were about the power of prayer, but after some time they conceded and even though they said they did not know how to pray they pray for their grandpa's recovery.  They then went home and their grandpa was no longer bedridden and it was the start of his recovery. Their grandpa died a few years later, but 20 years later the narrator still feels the power of prayer.",
    "634e9bff0e8c21e97c621cb1": "22 year old, fresh out of colleage, working in a bookshop. His grandad has been bed bound for a number of years. He Hears a voice urging him to light a candle at the church to heal his grandad, but no ones around. He hears the voice again and decides to take a break. Arriving at the church he questions his faith, and as hes not overly religious, would his prayer make things better or worse based on his grandmothers advice. He prays and returns to work. Later he gets an overwhelming urge to go home. Locks up, goes home to find his grandad sitting in the living room after getting a surge of energy. That was the start of his recovery, and he regained his independance & strength. Celebrating his 90th birthday with his family. ",
    "63bda8bbe64ce816bb0e37e2": "A man worked in a bookstore and had a sick grandpa. He heard a voice at the bookstore that told him to light a candle for his grandpa and he would get better. The man went to the church to pray and light the candle. The man went back to the bookstore to work. The man went back home to find his grandpa better. The man's sister told him he had recovered. The grandpa lived longer but eventually died.",
    "5e4464d23e28c82e888fa598": "I was 22 just out of college and i started working with my grandad at our bookstore, he quickly became very ill and bedridden  one day when working I heard a voice whisper and say that if I went to the local church and lit a candle my grandad would be fine, although no one was around when I looked. I remembered my grandma saying that prayers made with good hearts could create miracles, I was no saint but what harm could it do. So I went to the church with a candle, praying that he was alright. I got the feeling to suddenly go home, Grandad was out of bed looking much better. He ended up living many years more and celebrating his 90th birthday, the whole experience was 20 years ago but gave me a much different perspective on religion and prayer.",
    "62fba19b31689f425e047e01": "This Young Lady bookstore keeper , her grandpa's got seriously ill. And, while she was at the her bookstore, arranging the shelves'.... etc. She suddenly heard a voice urging her to go to Church to make some prayer's. The inner voice was telling her that if she done so her Grandpa's would certainly become well. She followed the instructions accordingly and done so. Moreover, after she prayed gpt back to her store and then she had that strong urge and emotions telling her to head back home now!! She went back home she found her grandpa's sitting with her sisiter having a chin-wag she become well and fit like a horse. From, that day forward she knew the importance of faith, the whole family become more religious, grateful to life and cherished every moment!! Finally, her grandpa's fully recovered and lived on many years full of health and joy.",
    "5841a2d39d65770001cebfa1": "Working in a bookshop after college.\nMy sister at home caring for my bedridden grandpa. It is just me and my sister.\nI hear a voice urging me to go to the church and light a candle and my Grandpa will recover.  I go to the Church and even though I'm not religious and have made many mistakes in my life I light a candle and say a prayer. My Grandmother said a prayer from a genuine heart can make miracles bit also that a prayer without faith was meaningless. I then return to the shop. I feel an urge to go home. When I get there my Grandpa is sat in the living room. My sister said he felt a surge of energy which helped to get him out of bed. I wondered if it was the lighting of the candle. My Grandpa lived to be 90 and celebrated his birthday  surrounded by family and friends and I recall that day 20 years ago which helped me cherish the time I had with my family."
  },
  "segmentation": "1. Let me share a story from when I was twenty-two years old, just fresh out of college.\n2. I was staying in a small town about five miles from here.\n3. I had just started my first job at a local bookstore.\n4. It was a quiet afternoon, and I was alone in the store.\n5. My grandpa, who had been bedridden for almost a year, was at home with my sister.\n6. She had to care for him daily, as he couldn't move around on his own.\n7. There were only two of us siblings, my sister and me.\n8. My parents had gone out of town for the weekend.\n9. As I was shelving books, I suddenly heard a voice inside my head.\n10. It said, \"If you go to the old church down the street and light a candle for your grandpa, he will get better.\"\n11. I looked around the bookstore, but no one was there.\n12. I continued with my work, trying to ignore the voice.\n13. It spoke to me again, repeating the same message.\n14. I looked around once more, but still found no one.\n15. I decided to take a break and walk to the church.\n16. I was only a short distance away, maybe a quarter-mile.\n17. As I approached the church, I hesitated for a moment.\n18. I was not a particularly religious person.\n19. I remembered my grandma always saying that prayers from a sincere heart could bring miracles.\n20. On the other hand, she also said that prayers without faith were useless.\n21. I admitted to myself that I was far from being a saint.\n22. I had my share of mistakes and misdeeds.\n23. I thought about my grandpa and how much he meant to our family.\n24. Finally, I went inside the church and found a candle.\n25. I knelt down in front of the altar.\n26. I said, \"God, I don't know how to pray properly.\n27. But I am asking you with all my heart to heal my grandpa.\n28. Please help him regain his strength and guide us in taking care of him.\"\n29. After saying my prayer, I returned to the bookstore.\n30. I resumed my work, shelving books.\n31. Suddenly, I felt a strong urge to go home.\n32. It was as if something was pulling me towards the house.\n33. I didn't hear any voice this time.\n34. It was just an overwhelming feeling that I needed to go.\n35. I locked up the store and rushed home.\n36. To my surprise, I found my grandpa sitting in the living room, talking to my sister.\n37. He hadn't been able to leave his bed for months without assistance.\n38. My sister told me that he had suddenly felt a surge of energy and was able to stand up and walk.\n39. That day marked the beginning of his recovery.\n40. He gradually regained his strength and independence.\n41. It was a turning point in our lives.\n42. We became more grateful for the time we had together.\n43. I often thought back to that day in the church.\n44. I wondered if my prayer had anything to do with my grandpa's recovery.\n45. I couldn't be sure, but it definitely changed my perspective on faith and the power of prayer.\n46. My grandpa lived for many more years after that incident.\n47. He celebrated his ninetieth birthday surrounded by family and friends.\n48. We cherished every moment we had with him.\n49. That experience happened almost twenty years ago.\n50. It remains a vivid memory in my mind.\n51. My grandpa passed away a few years later, but his spirit lives on in our hearts.\n52. Sometimes, when I'm feeling lost or uncertain, I think back to that day.\n53. I remember the power of faith and the miracles it can bring.\n54. And I am reminded that we are never truly alone, even when it seems like we are.",
  "recalls segmented": {
    "5f305d059a58b14b23eeccb8": "1. A 22yr old girl fresh out of college worked in her family's bookstore.\n2. She had 1 sister & a grandpa who was bedridden for months.\n3. Her parents were out of town for the weekend.\n4. Her sister was the only one home with grandpa while the girl worked at the bookstore.\n5. Suddenly she heard a voice in her head while shelving books.\n6. That she must go to the church down the road & light a candle and say a prayer for her grandpa to get well.\n7. She ended up closing the store.\n8. She went to the church & did just that.\n9. After returning to the bookstore she felt an urge to go home.\n10. She found her grandpa full of energy & well.\n11. Her sister told her that her grandpa suddenly got up & felt better.\n12. He got better since that day & lived to an old age.\n13. When times are tough even though its been over 20yrs ago now the girl still thinks of that moment.",
    "6032903277ccb729ab92972d": "1. It was a story about a man\n2. who after college went to work in a bookstore.\n3. He lived with his sister, grandfather and parents.\n4. One weekend when his parents were away,\n5. he was working his regular shift at the bookstore\n6. when he heard a voice tell him to light a candle\n7. and it would heal his sickely grandfather who was bedridden.\n8. After his shift he left the bookstore\n9. and went to the church\n10. where he lit a candle\n11. and prayed.\n12. Shortly after he got a phone call from his sister\n13. that their grandfather had gotten out of bed\n14. and was energetic.\n15. Over the months the grandfather got better\n16. and lived to be over 90 years old before he passed away.\n17. The man often wonders if his prayer was the cause\n18. that healed his grandfather of sickness.",
    "61109e59e55dc2f6bf8b2ea9": "1. A person was reflecting on a time when they were working in a bookstore after college\n2. and got the feeling to go pray\n3. and light a candle for their grandpa in a nearby church\n4. because he was bedridden\n5. and needed to be taken care of by the person's sister.\n6. The person wasn't very religious\n7. but still went to pray anyway\n8. then went back to work.\n9. They then got a feeling to go home\n10. and when they did they saw their grandpa out if bed\n11. and in the living room.\n12. He then started to get better and better\n13. and regain his strength.\n14. He lived for a few more years\n15. and celebrated his 90th birthday with family and friends.\n16. The person telling the story still remembered that day\n17. and valued the power of faith and prayer more after that experience.",
    "5ea5da26b447b8458c6270e6": "1. Twenty-two years old, fresh out of college.\n2. Started a new job at a bookstore.\n3. Sister was looking after grandpa.\n4. I heard a voice which said to go the the church and light a candle and pray for him.\n5. I then heard it again.\n6. I went at lunch, it was only a short walk, about quarter of a mile.\n7. I went inside the church and lit a candle.\n8. I prayed to God, please help my grandpa, I am asking with all my heart please help him get better.\n9. I returned to work.\n10. I got an overwhelming feeling to go home.\n11. It wasn't a voice this time.\n12. Just an overwhelming feeling urging me to go.\n13. I locked up the store and went home.\n14. To my surprise, there was my grandpa in the living room, sitting on a chair talking to my sister.\n15. He hadn't been out of bed for months.\n16. From that day my grandpa continued his recovery.\n17. He lived many more years.\n18. We cherished that time we had together.\n19. I often think back to that day and think did God really hear me and help.\n20. It definitely changed my perspective on faith and god.\n21. My grandpa celebrated his 90th birthday surrounded by friends and family.\n22. He lived a few more years after that.\n23. I often think back about him and that time we had together.\n24. I often think about that day in church.",
    "5f7f239e9b204e05b6c36538": "1. I want to share with a story of when I was twenty two back in college.\n2. At home we lived with my grandpa who was now bedridden for months.\n3. There was just two siblings, me and my sister.\n4. Our parents were away on weekend and my sister was the one taking care of him.\n5. One day when I was at store packing book on shelves, I heard a voice saying \" if you go to the church and light a candle for your grandpa, he will get better\".\n6. I turned around to see who was there but there was no one.\n7. I continued packing the books on the shelves till I heard the voice again.\n8. I turned around again but still there was no one.\n9. I then left the store and made my way to the church.\n10. About a quarter mile away, I stopped and pondered.\n11. I was not a religious person but my grandmother used to say prayer from a sincere heart can bring miracles, but she said prayer without faith is useless.\n12. Finally I went inside and lit the candle and prayed.\n13. I went back to the store and had a strong urge to go back home.\n14. There no voices this time, just an overwhelming feeling.\n15. I immediately locked up the store and went home.\n16. I walked in to find my grandpa sitting in the dining room with my sister.\n17. He had been bedding for months but he suddenly had a burst of energy and was able to get up without assistance.\n18. I wondered if my prayer had.",
    "60ab2c6fbe19b8d115549efa": "1. The story is about a man who is 22 years old,\n2. fresh out of college,\n3. who is working at a book store.\n4. He lives with his mom, dad, sister, and grandfather.\n5. One weekend, he is working at the bookstore,\n6. and only his grandpa and sister are home because his parents are out of town for the weekend.\n7. He is shelving books as usual\n8. and he hears a voice in his head,\n9. telling him that if he lights the candle in the old church his grandpa will get better.\n10. He ignores it the first time\n11. but then the voice speaks to him again\n12. and he leaves to go to the old church during his break.\n13. He is hesitant about entering the church at first\n14. because he remembers some words from his Grandma about how prayer without faith is useless.\n15. He goes in a starts to pray,\n16. but proclaims he doesn't know how.\n17. He lights the candle\n18. and goes back to work at the bookstore.\n19. He gets a sudden feeling that he should go back home\n20. and so he does.\n21. He finds his grandpa sitting in the living room talking to his sister.\n22. Apparently, his grandfather got a surge of energy\n23. and started to feel better,\n24. even though he wasn't able to be independent for many months before this.\n25. From that day on, his grandpa started to recover.\n26. He became more independent\n27. and lived for many more years,\n28. even up to his 90th birthday.\n29. In the end, the 22 year old man states that he'll never forget that day\n30. and the impact it had on himself and his attitudes towards belief and faith.",
    "59d95cee8fd07a0001842480": "1. Girl working in the book shop goes to a church and lights a candle.\n2. Her grandfather has been bed ridden for months.\n3. Her sister was looking after the grandfather while she was at work.\n4. After lighting the candle in the church she went back to the book shop.\n5. She had a feeling something was calling her to go home.\n6. She got home and her grandfather was out of bed for the first time in months.\n7. Her sister told her he suddenly had a burst of energy and got out of bed himself.\n8. She wondered if it was because she lit a candle.\n9. She started believing in faith.\n10. She had many years with him.\n11. He celebrated his 90th birthday.",
    "60148ce8ea15974d855c06d5": "1. Guy was 22\n2. and had a job in a bookstore.\n3. His sister was at home\n4. looking after their grandpa.\n5. There were only 2 siblings.\n6. Parents were out of town.\n7. When he was putting books away\n8. he heard a voice\n9. telling him to light a candle in church\n10. and his grandpa would get better.\n11. He ignored it the first time\n12. but after the second time\n13. closed the store\n14. and went to the church a short walk away.\n15. His grandmother had told him\n16. sincere prayers would be answered\n17. but insincere ones were pointless.\n18. He went in\n19. and prayed\n20. but confess he didn't know how to do it properly.\n21. Then he went back to the bookstore.\n22. Then he had a feeling\n23. that he should go home.\n24. When he did\n25. his grandpa was feeling better\n26. and recovered to live a much longer life.\n27. That was 20 years ago\n28. and he still believes in the power of prayer.",
    "5e0d531982a9554d3862a670": "1. The story teller is telling a story from 20 years ago\n2. when he was 22,\n3. fresh out of college\n4. working in a bookstore.\n5. He has one sister\n6. who was at home\n7. looking after his grandad\n8. who was sick\n9. as their parents were away.\n10. He was working alone\n11. stacking shelves\n12. and heard a voice telling him that if he went to the church and prayed his grandad would get better.\n13. He tried to ignore it\n14. but kept thinking about it\n15. so he took a break,\n16. locked the store\n17. and went to a close by church a quarter-mile away.\n18. He was not a particularly religious person\n19. but remembered his grandma saying that prayers from a sincere heart caused miracles\n20. so he went in,\n21. He said he had forgotten how to pray\n22. but prayed for his grandad to get better\n23. and went back to work.\n24. After some time he felt a pull to go home,\n25. he didn't hear any voices\n26. just an overwhelming pull to the house.\n27. He got home\n28. and found his grandad in the living room,\n29. he hadn't got up and walked in a long time.\n30. His sister said the grandad had had a sudden burst of energy.\n31. That was a turning point in their lives\n32. and the grandad lived into his 90s.\n33. They still think about that day\n34. and the story teller has changed his perspective on faith and miracles.",
    "5d10fa2bbfbf0a000133594b": "1. The following story happened when I was twenty-two.\n2. I was working in a book store shelving books,\n3. when and I heard a voice in my head that told me to go to a church and light a candle for my grandfather.\n4. I looked around but there was no one there.\n5. There was only myself and my sister,\n6. my sister had to care for my grandfather every day.\n7. My parents had gone out of town.\n8. I walked to the church and lit a candle.\n9. I drove across town,\n10. and entered my grandfather's home.\n11. He was sitting in a chair,\n12. when he hadn't been able to leave his bed for months.\n13. My sister told me that he had a sudden burst of energy.\n14. It was twenty years ago but that incident restored my faith.",
    "60e12f6dbb3844c468b97621": "1. I’m 22 years old,\n2. fresh out of college working in a book store.\n3. My sister is at home looking after my grandpa\n4. as my parents have gone away for the weekend,\n5. he is bedridden due to ill health.\n6. I’m shelving books\n7. when I suddenly hear a voice telling me if I go down the street to the church and light a candle my grandpa will recover.\n8. I look around the bookstore\n9. but no one is there.\n10. I hear the voice again telling me the same thing.\n11. I’m not a religious person\n12. but I walk down the street to the church and light a candle.\n13. I kneel at the altar\n14. and say to god I don’t really know how to pray but please heal my grandpa.\n15. My grandma always told me that miracles could happen through faith.\n16. I go back to the bookstore\n17. but feel a strong urge to go home,\n18. I lock the bookstore and head home.\n19. I find my grandpa downstairs,\n20. my sister tells me he came down himself.\n21. He couldn’t get out of bed before unassisted.\n22. He’d felt a surge of energy and got up.\n23. That day marked the start of his recovery,\n24. he celebrated his 90th birthday.\n25. I don’t know if my prayer helped\n26. but we had a couple more years with him.",
    "5f5bdef433291039ca812397": "1. When I was 22,\n2. fresh out of college,\n3. I worked in a bookstore.\n4. I have 1 sister\n5. who looks after my grandad\n6. who is bed bound\n7. and parents are away.\n8. One day,\n9. when filling shelves,\n10. I heard a voice say,\" Go to the church and light a candle'.\n11. I looked around,\n12. no one there,\n13. I ignored it\n14. but heard the voice again a few times.\n15. The shop wasn't busy\n16. so I walked towards the church\n17. and about a ¼ of a mile away\n18. I remembered my Grandma used to say that you had to have faith for a prayer to work,\n19. also that a prayer, without belief was no good.\n20. I went to the church,\n21. lit a candle\n22. and told God I wasn't sure how to pray\n23. but could my grandad possibly get better\n24. and be part of the family again.\n25. On returning to the bookshop\n26. a voice told me to go home\n27. and when I did,\n28. grandad was sitting on a chair.\n29. He had reached the chair with help\n30. as he had felt a surge of energy.\n31. He continued to improve\n32. and lived for a few years till his nineties.",
    "602ba5af8055272f9a36e3fe": "1. Young person just out of college,\n2. just started first job at bookstore.\n3. Grandpa bedridden at home with sister.\n4. Two siblings,\n5. parents out of town.\n6. Voice inside head saying go to church and light a candle for grandpa\n7. (nobody in bookstore).\n8. Walked to the church.\n9. Not particularly religious person.\n10. Went inside and found a candle,\n11. prayed for Grandpa to regain strength.\n12. Suddenly got strong urge to go home.\n13. Grandpa was sitting in living room with sister.\n14. Lived for a few more years.",
    "5ff45beefdb6e6b063b4c520": "1. I was fresh out of college\n2. and working in a book store.\n3. I lived with my younger sister\n4. and my grandpa,\n5. and recently he'd became ill.\n6. Very ill.\n7. Eventually becoming bedridden\n8. and continuing to decline.\n9. One night while stacking shelves at work\n10. I hear a voice in my mind -\n11. telling me to go to the Church nearby,\n12. and light a candle:\n13. this would help my grandpa get better.\n14. I had reservations\n15. as I was far from religious\n16. but I went to the Church about a quarter mile away,\n17. found,\n18. and lit a candle.\n19. I suddenly felt an inescapable urge to go home,\n20. which I gave in to\n21. only to see Grandpa,\n22. who had been bedridden remember,\n23. up and walking.\n24. He'd, that night, felt a rush of energy\n25. and every night after got better and better,\n26. living for many many years afterwards.\n27. He made it to ninety.\n28. I still think back to that night very often,\n29. and wonder whether my act of lighting that candle and giving a prayer really made a difference or not.\n30. Either way it changed my whole outlook on faith.",
    "643f160bb49d863f2be92fc7": "1. Let me go back to a time when I was about 22 years old.\n2. In the first year of college.\n3. I was in church with my grandpa.\n4. He couldn't move around on his own.\n5. There were two siblings my sister and me.\n6. My grandparents went to town for the weekend.\n7. I suddenly heard a voice in my own head.\n8. It said to go to the old church street and light a candle for grandpa to get better.\n9. I tried to ignore the voice.\n10. I walked to church.\n11. I was not religious.\n12. I made mistakes.\n13. I found a candle in the church.\n14. I felt a strong urge to go home.\n15. I rushed home.\n16. I saw my sister and grandpa.\n17. That day was the beginning of his recovery.\n18. It was a turning point.\n19. I was grateful.\n20. I wondered if the prayer saved him.\n21. My grandpa lived a good life after that.\n22. I think back to that day whenever I'm lost.",
    "5ac9e0299534ba0001c76e80": "1. She was working in the library staking shelves\n2. when she heard a voice telling her to go to the church\n3. and say a prayer for her grandad.\n4. She did this\n5. and then went back to work.\n6. She then got an urge to go home,\n7. upon arrival her grandad was in the living room\n8. which he hadn't been able to do for years.\n9. She never really knew for sure if it was the prayer that did it.\n10. Her grandad passed away a few years after that\n11. but she has so many special memories of time spent with him.",
    "5e550b1494d9e6505ac3e26d": "1. The story is about a 22 year old girl\n2. who works at the bookstore.\n3. Her and her sister look after her ill grandpa\n4. who cannot move without assistance.\n5. One day when the girl was shelving books in the store\n6. she heard a voice in her head\n7. telling her to light a candle in the church\n8. and it would heal her grandpa.\n9. She went to the church,\n10. although she was apprehensive\n11. because she is not particularly religious.\n12. She lit the candle\n13. and then had the sense to go home.\n14. When she went home her grandpa was up and well.\n15. This happened 20 years ago.\n16. Her grandpa lived to be ninety\n17. surrounded by his family.\n18. The story encourages a sense of faith.",
    "5e1f321074dfbe028c2fbb18": "1. When the narrator was 22 (fresh out of college),\n2. they were working in a bookstore.\n3. They lived with their sister (their only other sibling) and grandpa,\n4. who was unwell and needed constant care.\n5. One day while shelving books,\n6. the narrator heard a voice tell them that if they went over to the old church and prayed,\n7. their grandpa would get better.\n8. Though they looked around the store,\n9. the narrator couldn't see anyone.\n10. The voice repeated itself.\n11. The narrator decided to take a break and head over to the church\n12. which was only a quarter of a mile away.\n13. At the church,\n14. the narrator thought about advice their grandma had given them,\n15. that prayers from a sincere heart could come true,\n16. but prayers without faith were useless.\n17. The narrator had doubts as they were not particularly religious\n18. and had done their fair share of misdeeds.\n19. However they decided to go in to the church\n20. and knelt down to pray for their grandpa to get better.\n21. After praying,\n22. the narrator returned to work.\n23. Back at the bookstore,\n24. they got a strong feeling pulling them to go home.\n25. They left early\n26. and were astonished to see their grandpa sitting talking to their sister in the living room,\n27. despite the fact that their grandpa had been bedbound for several months.\n28. Their grandpa lived for several more years\n29. and even got to celebrate his 90th birthday surrounded by loved ones,\n30. who were all more grateful for the time they had together having been through such a lifechanging experience.\n31. The narrator was reflecting on this story 20 years later\n32. and how it had been such a turning point for them.",
    "60151380a2273d594f63aae3": "1. I graduated at 22\n2. and worked in a bookstore 5 miles away.\n3. My sister was looking after my grandpa.\n4. One day while at work,\n5. I heard a voice asking me to go to the church nearby\n6. and light a candle for my grandpa.\n7. The voice said this twice.\n8. I closed up the store\n9. and walked to the church.\n10. I said a clumsy prayer\n11. as I am not religious.\n12. When I got home,\n13. my grandpa had gotten energy to get up from his months of being bedridden.\n14. He lived to his 90th birthday,\n15. when we had a party to celebrate him.\n16. This has strengthened my faith\n17. that you are never alone.",
    "6447c2f4adb0bafcbae225bf": "1. Let me tell you a story about a time when I was twenty two and had my first job in a book store.\n2. My grandpa was staying with us and my sister was looking after him because he was unwell.\n3. Our parents were out of town at the time.\n4. There were only two of us siblings.\n5. While I was working I heard a voice in my head telling me to go to the local church and light a candle and say a prayer for my grandpa's health.\n6. I looked around but no one else had spoken.\n7. I carried on working but heard the voice again.\n8. I'm not particularly religious and I remember my grandma saying if you're sincere about saying a prayer it will be more effective.\n9. If you're not then it wont.\n10. I'm not a saint but I decided to go to the church.\n11. I locked up the shop, walked to the church and lit a candle and said a prayer.\n12. I prayed for my grandpa's health and recovery.\n13. I left the church and went back to the shop.\n14. As I was stacking books I had a sudden urge to go home.\n15. It was like something was pulling me to the house.\n16. There was no voice this time.\n17. I shut the shop and I went home.\n18. To my surprise my grandpa was sat in a chair in the living room talking to my sister.\n19. He hadn't been able to get out of bed for some time.\n20. My sister told me earlier on he'd had a sudden surge of energy and had felt able to get out of bed and walk.\n21. That was the start of my grandpa's recovery.\n22. He slowly got better and was able to live independently again.\n23. We treasured every moment with him.\n24. He went on to live many more years and celebrated his ninetieth birthday surrounded by his family.\n25. He passed away a few years after that but we were grateful for every moment we had with him.\n26. I don't know if his recovery was influenced by my prayer but I often think about that moment.\n27. It changed my perspective on faith and the power of it.\n28. That incident was twenty years ago but I often think about it.\n29. It's still a vivid memory for me.\n30. It made me think about the power of faith and prayer and made think that we are never truly alone.",
    "60f984adfea10999e9a39727": "1. I was 22\n2. and just out of college.\n3. I was working in a bookstore.\n4. My sister and I were caring for our Grandpa\n5. while our parents were out of town.\n6. While working I heard a voice in my head\n7. saying to visit the church down the road\n8. and say a prayer.\n9. It repeated itself\n10. and I walked to the church\n11. after remembering my Grandma's words about prayers being answered if they were from a sincere heart.\n12. I went to the church\n13. and told God I didn't know how to pray\n14. but asked for help for my Grandpa.\n15. After work I went home\n16. and found him out of bed\n17. where he had been for months.\n18. He gained more strength\n19. and independence\n20. and celebrated his 90th birthday with family.\n21. He lived for many years after this.\n22. This happened over 20 years ago\n23. and I recall the feeling I had for faith\n24. and prayer\n25. and how it can bring about miracles.",
    "5995b7bef9db7d0001895985": "1. When working in a bookstore\n2. the writer heard a voice telling them to go to church\n3. and light a candle for his grandpa.\n4. They were staying in a quiet town\n5. with their sister\n6. and grandpa who was ill\n7. and had been bedridden for almost a year.\n8. When they were shelving books\n9. they heard the voice,\n10. they weren't sure what to do\n11. but heard the voice again\n12. so decided to walk down to the church.\n13. At the church\n14. they lit a candle for their grandpa.\n15. They weren't sure because they weren't particularly religious.\n16. After they had lit the candle\n17. they went back to work\n18. when they felt a pull to go home.\n19. Once they went home\n20. their grandpa was in the living room talking to their sister.\n21. The grandpa lived for a while after that\n22. and celebrated their 90th birthday with family and friends.",
    "5756decbba27eb0006d5201e": "1. It was a 22 year old fresh out of college\n2. who worked at a bookstore\n3. and lived with his sister and grandfather.\n4. His grandpa was unable to care for himself\n5. and was looked after his granddaughter.\n6. While working at the bookstore,\n7. our lead heard a voice\n8. that told him to go to church\n9. and light a candle.\n10. Having heard the voice,\n11. he decided to go there on his break.\n12. While at the church,\n13. he pondered and hesitated\n14. weighing up the push and pull of his decision;\n15. him not being religious\n16. but also how his mom stated you if you don't believe in faith, it won't work.\n17. Our character tried it\n18. and prayed;\n19. and miraculously, his grandpa could talk for the first time in years.\n20. It was the start of his recovery\n21. and led to many more years of his life before he passed.\n22. The 22 year old then had believed in faith more that day.",
    "61376e55710e09d0b8f4dcb3": "1. Man worked in a bookstore,\n2. he was 22 with 1 sister\n3. he heard a voice asking him to light a candle for his ill Grandpa\n4. which he did\n5. Miraculously his Grandpa healed\n6. and made a full recovery\n7. Sometimes you need faith",
    "60b0cac3c6533bac7605471f": "1. A girl who worked at a book store after graduating year back and her sister were left to care for their grandpa who was very sick,\n2. and their parents had gone for a weekend.\n3. One time when she was book shelving she heard a voice telling her to go to church and light candle for her grandpa to get back,\n4. she looked around to see who was telling her this but didn't see anyone,\n5. then she continued bookshelving and again hears the same voice.\n6. She wasn't a religious person but her late grandma always told them prayer works\n7. but inorder for it to manifest you need to have faith otherwise you just wasting time praying without faith.\n8. So she decided to go to the church found the candle and she prayed unto God whole heartedly to heal her grandpa,\n9. after that she went back to book store\n10. as she was working she suddenly felt the urge to go home like something was pulling her to go home so she did,\n11. and found her grandpa whom had not been able to get out of the bed because he was so weak found him seated on the couch\n12. and after that he gradually healed.\n13. He live long after that\n14. and eventually passed away.",
    "568db47ae3ef9e000ca0dcdd": "1. Guy works at bookstore,\n2. hears voice telling him to light a candle to heal his ailing granddad.\n3. He does,\n4. it works,\n5. Granddad lives to be 90 something and dies.",
    "6298d6f2015f1d50783c0ed9": "1. I was 22\n2. and I worked in the bookstore.\n3. My grandpa was very sick\n4. and needed assistance to walk around.\n5. One day, I heard a voice telling me to go to the old church\n6. and light up a candle to heal my grandpa.\n7. Initially, I didn't want to go\n8. because I was not religious\n9. but then I remembered my grandma's words about prayer\n10. and the importance of faith\n11. and I decided to go.\n12. At the church, I prayed deep from my heart\n13. and asked God to return my grandpa's strength.\n14. When I returned home from work due to a strong feeling\n15. I saw my grandpa suddenly being able to talk to my sister at a good amount of strength\n16. after months of staying in bed.\n17. This began his recovery\n18. and he went on to leave for 20 years afterwards\n19. even celebrating his 90th once.\n20. This experience has changed my life\n21. and perspective on faith.",
    "5acb92e9e1099600016ad073": "1. The narrator is in their 40s\n2. and recalled when they were 22 years old\n3. a day when they were working 5 miles away at a local bookstore.\n4. They heard a voice twice in their head\n5. (no one was there)\n6. telling them to go to church\n7. and pray/light a candle for their sick Grandpa.\n8. They hesitated as they weren't religious\n9. but remembered their Grandma said a sincere prayer could help.\n10. Eventually they went in the church\n11. and prayed/lit a candle.\n12. When they went home their Grandpa was feeling better\n13. and it marked a turning point in his recovery.\n14. He has now died\n15. but celebrated his ninetieth birthday\n16. and was around for many months after the incident.\n17. The event gave the narrator more faith.",
    "5ba7aa44dd5915000137e42f": "1. Let me tell you a story\n2. from when I was 22 year old.\n3. I’d just finished college.\n4. I was working at a bookstore.\n5. My parents were away for the weekend,\n6. it was only my sister and I in town\n7. to look after my grandpa.\n8. He was poorly\n9. and couldn’t get out of bed.\n10. That was over 20 years ago\n11. and I can remember it to this day.",
    "63d1494c8ed3bc3d40494d45": "1. A boy\n2. who worked at a bookstore\n3. who's grandfather was ill.\n4. But he heard a voice in his head\n5. to light a candle at the church\n6. for his grandfather to get better.\n7. In which his grandfather did get better\n8. and lived for many years after,\n9. but it all came down to having faith\n10. goes a long way.",
    "5c93073250e4fb0001f7907b": "1. Let me tell you a story about a time when I was twenty two years old,\n2. fresh out of college.\n3. I got a job at a bookstore.\n4. My sister took care of my grandpa.\n5. It was just us two siblings.\n6. Our parents were away.\n7. I was shelving books and heard a voice tell me to go to the church and light a candle for my grandpa and he would feel better.\n8. I looked around the store and no one else was in there.\n9. I heard the voice again.\n10. I looked around again and still nobody was in the store.\n11. I continued shelving books.\n12. I am not particularly religious and have been told that a prayer will not mean anything if I don't believe.\n13. I decided to walk to the church I was about a quarter mile close to it and light a candle for grandpa.\n14. I was back at the bookstore when I had a strong feeling to go to the house.\n15. Not a voice this time, an overwhelming feeling.\n16. I locked the bookstore and went home to find my grandpa sitting in a chair in the living room with my sister.\n17. He had not been able to get out of bed for months.\n18. My sister told me he suddenly had a surge of energy and was able to get out of bed and walk to the chair.\n19. It was amazing to see.\n20. That was the day he gradually began to get better.\n21. He got more energy and lived a few more years.\n22. We got to cherish our time with him.\n23. You are never truly alone.",
    "60d05712d155f607f2b7f664": "1. I was 22 years old\n2. and freshly graduated from college,\n3. it was about 5 miles from here.\n4. I was working in a bookstore at the time.\n5. My sister was looking after my bedridden grandpa,\n6. my parents were out of town for the weekend.\n7. I was stocking the shelves one day\n8. and a voice told me that I should go to the church\n9. and light a candle\n10. and my grandpa would get better.\n11. I looked around\n12. but I was alone.\n13. The voice said it again.\n14. I took a break\n15. and walked to the church\n16. it was only about a quarter-mile away.\n17. I was never a religious person\n18. but I felt the need to confess that I was not a perfect person\n19. but I should have faith.\n20. I grabbed a candle\n21. and knelt at the alter\n22. and prayed about my grandpa getting better.\n23. I went back to the bookstore\n24. and felt the urge to go home,\n25. it was like a force was pulling me home\n26. but there was no voice this time.\n27. I went home\n28. and found my grandpa sitting in the living room in a chair,\n29. he hadn't been able to get out of bed for months.\n30. My sister said he had a sudden surge of energy.\n31. That was the start of my grandpas road to recovery.\n32. He lived for many years cherished by our family.\n33. That was about 20 years ago,\n34. he passed away a couple years ago.\n35. His spirit lives on in all of our hearts.",
    "61fa9016d42cb19beec49061": "1. The narrator recalled how twenty years ago he worked in a bookshop\n2. and his sister cared for their grandfather.\n3. There parents were out of town.\n4. His grandfather was unwell\n5. and had been bedridden for weeks.\n6. One day in the bookshop he was shelving books\n7. and heard a voice which told him to go to church\n8. and pray for his grandfather.\n9. He initially ignored it\n10. but then it came again.\n11. He decided to shut the bookshop\n12. and go to the church.\n13. At the church he remembered his grandmother's words about prayer and faith,\n14. that faithful prayer could work,\n15. but a prayer without faith would do nothing.\n16. He went to the altar\n17. and asked God for his grandfather's health\n18. and guidance on what they should do.\n19. He went back to the bookshop\n20. but felt a strong urge to go home.\n21. At home he found his grandfather was feeling much better\n22. and was out of bed and talking.\n23. After his recovery the family valued the remaining time they had with him\n24. and he lived many years after that.",
    "5fd7c98ecffb0b080c0f1c84": "1. At 22 years old,\n2. the young adult began his first job at a local bookstore.\n3. His parents were out of town\n4. and lived with his bedridden grandpa.\n5. At work,\n6. he heard a voice telling him to go to the local church,\n7. light a candle\n8. and pray\n9. and the grandpa will get better.\n10. The young adult was not at all religious,\n11. however recalled how his grandpa would pray.\n12. The young adult lit the candle\n13. and spoke to God,\n14. without knowing what to say\n15. asked for his grandpa's healing.\n16. As he went back to work\n17. he had a strong urge to go home.\n18. To his surprise,\n19. he saw his grandpa in the living room,\n20. he slowly gained more strength\n21. and lived a good few years\n22. and died at 90 years.",
    "5e377e7147f5527223aee301": "1. Story teller was 22 when he started working at a bookstore.\n2. His grandpa had been bedridden for a while\n3. and was home with his sister\n4. and she was taking care of him since he couldn't move alone.\n5. One day when his parents were gone for a weekend,\n6. he was at work\n7. and heard a voice in his head continuously telling him that he should go to the church\n8. and light a candle for his grandpa to get better.\n9. He thought it was a prank\n10. and looked around\n11. but didn't see anyone else there,\n12. but the voice kept repeating.\n13. He left work to go to the church\n14. and tried it.\n15. He remembered his grandma saying \"prayers from the heart can bring miracles\".\n16. He lit a candle\n17. and said a prayer that admitted he doesn't do it often\n18. but he would like his grandpa to get better.\n19. He went back to work\n20. and continued his job,\n21. but had a sudden urge to go home.\n22. The storyteller went home to follow the urge\n23. and when he got home his grandpa was sitting upright on the couch.\n24. He was astonished as his grandpa had never been able to do so for around a year.\n25. He thinks back to the day in the church\n26. and if it played a role in his grandpa's recovery.\n27. His grandpa had to be around 70 at the time\n28. as they spent another 20 years together from that moment.\n29. Ever since that moment, the storyteller has believed in faith.",
    "60db48619d10beb5c73430f5": "1. The author was about 21\n2. and home from college.\n3. Her sister was looking after her grandpa\n4. who was bed bound.\n5. She heard a voice saying that she should light a candle at the church.\n6. She tried to ignore the feeling\n7. as she wasn't particularly religious\n8. and her grandma said praying without faith is useless.\n9. But she gave in\n10. and lit the candle\n11. and prayed.\n12. Then she felt a voice inside of herself saying she should go home.\n13. When she arrived home\n14. her grandpa was sitting upright\n15. and talking to her sister,\n16. he said he felt a sudden feeling/change.\n17. From that day on he was getting better and better\n18. and he celebrated his 90th birthday with his family.\n19. and a few years later he died.\n20. From that day the author started believing in the power of prayer.",
    "5de16fd00e58661bb3519db8": "1. Let me share a story.\n2. I was twenty-two years old, fresh out of college.\n3. I was staying in a small town about five miles from here.\n4. I had just started my first job at a local bookstore.\n5. It was a quiet afternoon, and I was alone in the store.\n6. My grandpa, who had been bedridden for almost a year, was at home with my sister.\n7. She had to care for him daily, as he couldn't move around on his own.\n8. There were only two of us siblings, my sister and me.\n9. My parents had gone out of town for the weekend.\n10. As I was shelving books, I suddenly heard a voice inside my head.\n11. It said, \"If you go to the old church down the street and light a candle for your grandpa, he will get better.\"\n12. I looked around the bookstore, but no one was there.\n13. I continued with my work, trying to ignore the voice.\n14. It spoke to me again, repeating the same message.\n15. I looked around once more, but still found no one.\n16. I decided to take a break and walk to the church.\n17. I was only a short distance away, maybe a quarter-mile.\n18. As I approached the church, I hesitated for a moment.\n19. I was not a religious person.\n20. I remembered my grandma always saying that prayers from a sincere heart could bring miracles.\n21. On the other hand, she also said that prayers without faith were useless.\n22. I admitted to myself that I was far from being a saint.\n23. I had my share of mistakes and misdeeds.\n24. I thought about my grandpa and how much he meant to our family.\n25. Finally, I went inside the church and found a candle.\n26. I knelt down in front of the altar.\n27. I said, \"God, I don't know how to pray properly. But I am asking you with all my heart to heal my grandpa. Please help him regain his strength and guide us in taking care of him.\"\n28. After saying a prayer, I returned to the bookstore.\n29. I resumed my work, shelving books.\n30. Suddenly, I felt a strong urge to go home.\n31. It was as if something was pulling me towards the house.\n32. I didn't hear any voice this time.\n33. It was just an overwhelming feeling that I needed to go home.\n34. I locked up the store and rushed home.\n35. To my surprise, I found my grandpa sitting in the living room, talking to my sister.\n36. He hadn't been able to leave his bed for months without assistance.\n37. My sister told me that he had suddenly felt a surge of energy and was able to stand up and walk.\n38. That day started the beginning of his recovery.\n39. He gradually regained his strength and independence.\n40. It was a turning point in our lives.\n41. We became more grateful for the time we had together.\n42. I often thought back to that day in the church.\n43. I wondered if my prayer had anything to do with my grandpa's recovery.\n44. I couldn't be sure, but it definitely changed my perspective on faith and the power of prayer.\n45. My grandpa lived for many more years after that incident.\n46. He celebrated his ninetieth birthday surrounded by family and friends.\n47. We cherished every moment we had with him.\n48. That experience happened almost twenty years ago.\n49. It remains a vivid memory in my mind.\n50. My grandpa passed away a few years later, but his spirit lives on in our hearts.\n51. Sometimes, when I'm feeling lost or uncertain, I think back to that day.\n52. I remember the power of faith and the miracles it can bring.\n53. And I am reminded that we are never truly alone, even when it seems like we are.",
    "57a7337e913c710001977341": "1. Lady was working in her book store shelving books.\n2. She is one of two siblings the other being her sister.\n3. Her sister looked after their grandpa who had been bedridden for many months and had to be assisted with moving around and looking after him.\n4. Whilst working the lady heard a voice in her head saying if she went now to her church and lit a candle her grandpa would get better.\n5. She ignored the voice at first but the message was repeated many times.\n6. After a while the lady went to the church despite her lack of faith and before she went in she remembered her grandma’s words that a sincere prayer can work miracles but prayers without faith were useless.\n7. The lady whilst unsure lit a candle and knelt at the alter in prayer and asked god to help her grandpa recover and gain his strength and let him have a life again.\n8. She went back to the bookstore and continued to shelve books until she felt an overwhelming urge to go home.\n9. She locked up the bookstore and went home to find her grandpa in the living room having sat up in bed saying he had the urge to get up.\n10. Grandpa recovered and lived for a number of years and then passed away but the extra time with him was fulfilling for the family.\n11. The incident happened 20 years ago but has helped the lady in sad and troubled times to help her through.",
    "605ba57d2842d8291b4afd24": "1. The story is about a 22-year-old,\n2. fresh from college\n3. and was working in the local bookstore.\n4. She lived with her sister,\n5. parents\n6. and sick grandfather.\n7. One day when she was at work,\n8. busy shelving,\n9. she heard a voice instructing her to go to a church,\n10. light a candle\n11. and pray for her grandfather.\n12. She looked around\n13. and saw that she was alone in the store\n14. and was shocked.\n15. She was not particularly a religious person,\n16. so this was a bit strange for her,\n17. but she eventually went to the church\n18. and prayed for her grandfather.\n19. After praying,\n20. she went back to the store\n21. and when she was there,\n22. had this overwhelming feeling that she needed to go home.\n23. When she got home,\n24. she found her grandfather sitting\n25. and her sister told her that he had gotten out of bed on his own,\n26. which had not happened in months.",
    "605273bcd0b9b4510724f3d7": "1. Girl 22 years old,\n2. sibling (one sister)\n3. first job was at a bookstore shelving books,\n4. the bookstore was close to a church.\n5. Grandpa was poorly and had been bedridden for almost a year,\n6. one day she heard a voice telling her to go and light a candle for her grandpa\n7. and this would make him better.\n8. She was hesitant as she wasn't really religious\n9. and remembered things her nan said such as prayers without faith are useless.\n10. She ended up going to the church,\n11. finding a candle,\n12. lighting it whilst kneeling at the alter.\n13. Afterwards she went back to work\n14. but felt a force but no voice telling her to go home.\n15. When she did go home her grandpa was at home with her sister\n16. but he was sat up not in bed.\n17. The sister said he had felt a rush of energy\n18. and was able to stand and walk.\n19. The grandpa got some of his independence back\n20. and she often wondered if her prayer at the church has helped.\n21. They got to enjoy many more years with him\n22. and he passed a few years later\n23. but they were all grateful for the extra time they had with him.",
    "611fd5c03b9654834bd4af0e": "1. The person is 22 years old\n2. and working at a bookstore in their quiet town.\n3. They are at work\n4. while their sister is at home with their sick grandpa,\n5. and their parents are out of town.\n6. All of a sudden, the bookstore worker hears a voice saying to go down to the nearby church\n7. and light a candle for their grandpa.\n8. If they do this, it will heal him.\n9. After some contemplation, the worker goes to the church,\n10. and although uncertain about their faith, thinks of something their grandma used to say\n11. and goes in anyway.\n12. They make a prayer\n13. and light the candle,\n14. then return to work.\n15. Once back in the shop, they feel a strong urge to go back home.\n16. Once there, they see their grandpa is all better.\n17. In fact, he lives on for many years\n18. and they all get to celebrate his 90th birthday with him.\n19. The bookstore worker is thinking about these events 20 years later,\n20. and wonders to this day if that candle had anything to do with it.",
    "6417413921c539fd7d59e6e6": "1. 22 year old girl worked in a bookstore.\n2. Her grandpa was unwell\n3. and she had voice that told her to go to church\n4. and light a candle\n5. and pray for him\n6. to make him better.\n7. She returned back to the bookstore\n8. and later had the feeling to go home.\n9. She went home\n10. and found her grandpa sitting up\n11. and recovering.\n12. Her prays had been answered\n13. and he continue to get better.\n14. He lived for another 20 years.",
    "5f4e826dade9a507a7c6c2d3": "1. In my twenties,\n2. I worked in a bookstore.\n3. My grandpa was really sick at this moment,\n4. he couldn't get out of bed without help.\n5. My sister and I took care of him.\n6. One day, while I was working,\n7. I heard a voice in my head saying that \"I need to go to the old church and light a candle for my grandpa\".\n8. I ignored it,\n9. but then I heard this voice again, saying the exact same thing.\n10. I felt like i had to go to this church.\n11. I closed the bookstore\n12. and went to the church.\n13. I wasn't sure if I should do this,\n14. because I wasn't a believing person,\n15. but I did this anyway.\n16. After that, I went back to work.\n17. Then I felt this strong urge to go home,\n18. as if something was pulling me there.\n19. I closed the store\n20. and went to home.\n21. When I came in,\n22. I saw my grandpa sitting in the living room with my sister.\n23. She told me that he suddenly got so much energy,\n24. that he could stand up by himself.\n25. He lived a long time after this event.\n26. I still come back in my memories to this day,\n27. thinking if my prayers had something to do with \"healing\" my grandpa.\n28. This changed my thinking about faith and prayers.",
    "5dcc6f91e5e18690a20e74d1": "1. A man recalls a time in his young life at 22 years old.\n2. He was just out of college and working in a bookstore in his small town.\n3. His parents were out of town and his sister was at home with their grandfather who was bedridden.\n4. While working on a particular day he heard a voice in his head telling him to go to church and light a candle for his grandfather.\n5. No one was with him in the shop as he looked around then he heard the voice again.\n6. He took a break from work and walked to the church.\n7. He wasn't a religious person but he remembered his grandmother saying that a prayer could work miracles but a prayer with no faith was useless.\n8. He prayed to God to help his grandfather get better.\n9. He then returned to work.\n10. A little later he felt a strong urge to go home, there was no voice this time just an urgent feeling to go home.\n11. He shut the shop and returned home.\n12. When he got there he found his grandfather in the living room chatting to his sister and this was the first time he had been able to leave his bed in a long time.\n13. It was the beginning of his grandfathers recovery.\n14. His grandfather lived to celebrate his 90th birthday and a few years more.\n15. The man writing the story gained a certain amount of faith from this episode in his life and always wondered if the prayer had indeed helped his grandfather get better.",
    "5fb92475bca3903c9f3f7d45": "1. The person was young and working in a bookstore\n2. when one day he heard a voice telling him to go and light the candle at church for his grandpa\n3. at first he tried to ignore it\n4. but the voice repeated\n5. and he decided to head to the church\n6. before he entered the church he remembered the words from his grandma telling them about how powerful a prayer can be if you pray with a sincere heart\n7. so he went ahead inside the church\n8. where he found a candle\n9. and started to pray for his grandpa\n10. after that he went back to the bookstore\n11. where he felt a sudden surge to go home\n12. he got up and lock the store\n13. and went straight home\n14. when he got there he found his grandpa sitting in a stool\n15. and looked better then when he left him that morning\n16. and that was beginning of his recovery\n17. The grandpa lived till he was ninety years old.",
    "615776777c08445c8ffd8d1b": "1. The writer was 22\n2. and had just graduated college.\n3. They were working in a bookstore near their hometown\n4. when they heard a voice telling them that if they went to light a candle in the church down the street their grandfather would regain his strength.\n5. He was looked after by their sister,\n6. and was bedridden.\n7. Their parents were away.\n8. They heard the voice twice\n9. and went to the church.\n10. Although not religious, they lit a candle\n11. and said a prayer at the altar, asking god to give their grandfather his strength back.\n12. They returned to the bookstore\n13. and continued shelving books,\n14. when they had a powerful urge to return home.\n15. They locked up the bookstore\n16. and went home,\n17. to find their grandfather sitting in a chair in the living room, something he had not done for a long time.\n18. He said he had felt the strength returning to him.\n19. He lived for many more years\n20. and celebrated his 90th birthday surrounded by family.\n21. The writer said although this all happened 20 years ago they remembered it well\n22. and wondered if their prayer had been the reason for their grandfather getting better.\n23. They said their grandmother had told them that if a prayer was said sincerely it had power,\n24. but if it was said with no sincerity or meaning it was useless.\n25. They were happy that they had many more happy years with their grandfather.",
    "5ea00067d330db1ac58c6163": "1. Twenty years ago\n2. I left college\n3. and went to work in a book store.\n4. I had a vision\n5. that I should go to church\n6. and light a candle\n7. to pray for my grandpa.\n8. I went to church,\n9. lit a candle\n10. and prayed.\n11. My sister told me to come home.\n12. When I got there\n13. my grandpa was out of bed.\n14. It changed my attitude to prayer.\n15. My grandpa lived for several more years.",
    "5edfeb15743509317e9ec17c": "1. A boy was at home\n2. looking after his very ill grandpa.\n3. He heard a voice say\n4. if he went to the church\n5. and light a candle,\n6. his grandpa would get better.\n7. He ignored it.\n8. He then heard it again.\n9. He decided to go\n10. and light a candle.\n11. When he got home,\n12. his grandpa was much better.\n13. He lived for 20 more years.",
    "5c2bb03b9fb36d000198e2d7": "1. A young man fresh out of college was working in a bookstore.\n2. His grandfather was bedridden at home with the young man's sister.\n3. The sister was taking care of the grandfather.\n4. The young man heard a voice telling him to go to the church nearby and light a candle for his grandfather and he would be healed.\n5. After some hesitation he went to the church and lit the candle and said a short prayer despite his hesitations.\n6. He went back to the bookstore and continued working.\n7. Shortly after he felt a strong urge to go home.\n8. He locked up the store and went home.\n9. His grandfather was sitting up in the living room after having been bedridden for months.\n10. In what seemed to be a miracle his grandfather lived on for years.\n11. This experience helped the young man appreciate more and value prayer and faith.",
    "630492ce98f024b7188676df": "1. The person was 22 years old working in a book store.\n2. Their grandpa was bedridden.\n3. The person thought they heard voices saying go to church but no one was in the store.\n4. They locked up and went to church to pray even though they weren't really religious.\n5. They prayed for their grandpa to get better.\n6. They went back to work then felt the urge to go home.\n7. At home the grandpa had felt a surge of energy and got out of bed alone, the first time in months and said he felt better.\n8. He gradually recovered and lived to celebrate his 90th birthday.\n9. This happened 20 years ago and the narrator said they still think about it when they are losing faith.",
    "647ba080cdf4db4ed1a2e695": "1. Let me tell you a story.\n2. I was in college and was working in a bookstore.\n3. My grandfather was sick and I have a sister.\n4. While shelving book, I heard a voice telling me that if I want my grandfather to get well, then I have to go to church and pray.\n5. I was not religious, but I went anyway and prayed.\n6. I went back to the bookstore and had a feeling to go home.\n7. When I went home I saw my grandfather sitting on the couch.\n8. He had never left his bed before, so this surprised me.\n9. He lived on for many more years to come.\n10. I do not know if my prayer had anything to do with it.\n11. When I feel alone, I remind myself that prayer can work.",
    "5c5ad828903c7700010a4635": "1. My story begins when I was 22\n2. and just fresh out of college,\n3. I was working at a bookstore.\n4. One day I had an overwhelming urge to go to church\n5. and pray\n6. and light a candle for my grandpa.\n7. There was only 2 siblings myself and my sister\n8. who looked after my grandpa\n9. as he hadn't been able to do anything without assistance.\n10. My parents were out of town for the week.\n11. I went to church\n12. and prayed to give my grandpa strength.\n13. I returned to the bookstore\n14. but had another urge to return to grandpa's house,\n15. when I arrived grandpa was in the lounge talking to my sister\n16. she said that he had a sudden surge of energy\n17. and strength\n18. and got up and walked to the lounge,\n19. grandpa had been bedbound\n20. as he was unable to do anything without assistance.\n21. Grandpa lived a few more years until 90\n22. that was 20 years ago\n23. but I will always remember that praying gives us strength\n24. and hope.\n25. Grandma says that prayers are useless if you don't believe,\n26. but strong if you do.",
    "5f3dbd5e99a9be1da93d9039": "1. Guy was 22 years old\n2. working in a bookstore\n3. and himself and sister were minding their bedridden grandpa\n4. while their parents were away for the weekend.\n5. A voice told him to pray at the church\n6. and his grandpa would get better\n7. which he did.\n8. While back at the bookstore\n9. he got an urge to go home\n10. and found his grandpa sitting up for the first time in years.\n11. After this he kept recovering\n12. and had a 90th birthday party years later.\n13. He passed a few years after that\n14. and the guy always thought about whether the power of prayer truly helped his grandpa.",
    "60858088111c462ba649ead5": "1. A 22 year old woman lives 5 miles away from town.\n2. Her grandpa had been bedridden for awhile.\n3. She works in a bookstore when one day she heard someone say 'go to the old church and pray',\n4. She doesn't believe in religion or faith.\n5. She lives with her sister and grandpa and her parents were away for the weekend.\n6. Her mother said, if 'you truly believe in something it could become true'.\n7. That day she went to the old church and prayed,\n8. She then had a sudden urge to go home and saw her sister speaking to her grandpa and he was better.\n9. Over the years his strength got better and recovered.\n10. It's been twenty years.\n11. She never believed in faith or religion but now she has a feeling that we are not really alone and if we ask for something we can possibly have it.\n12. A couple years later her grandpa passed away.",
    "636a354233b567a40c34ef2f": "1. I WAS 22 YEAR,\n2. FINISHED COLLEGE,\n3. JUST STARTED A FIRST JOB AT LOCAL BOOKSRORE,\n4. WAS AT THE STORE WHEN MY GRANDPA WHO HAS BEEN BEDRIDDEN FOR A YEAR WITH MY SITER,\n5. AS I WAS SHELVING BOOKS,\n6. SUDDENLY HEAD A VOICE INSIDE MY HEAD,\n7. SAYING IF U GO TO THE OLD CHURCH DOWMN THE STREET, AND LIGHT A CANDLE FOR YOUR GRANDPA HE WILL GET BETTER,\n8. I TRIED TO IGNORE,\n9. IT SPOKE AGAIN REPEATING THE SAME THING,\n10. LOOKED ROUND STILL NONE,\n11. I DECIDED TO GO TO THE CHURCH AND LIGHT THE CANDLE BELEIVING IN IT WITH ALL OF MY HEART,\n12. I SAID GOD I DONT KNOW HOW TO PRAY BUT I ASK YOU TO HEAL MY GRANDPA,\n13. LET HIM REGAIN STRENGHT AND GUIDE US IN TAKING CARE OF HIM,\n14. THEN I RETURNED TO THE BOOKSHOP,\n15. THEN FELT LIKE GOING HOME,\n16. SOMETHING WAS PULLING ME TO THE HOUSE,\n17. DIDNT HEAR A VOICE,\n18. I LOOKED UP THE SHORE AND WENT HOME,\n19. TO MY SUPRSIE I SAW MY GRANDPA SITTING IN THE LIVING ROOM TALKING TO MY SISTER,\n20. MY SISTER SAID HE SUDDENLY HAD THE ENERGY TO STAND AND WALK,\n21. IT WAS A TURNING POINT IN OUR LIVES,\n22. I WONDERED IF MY PRAYER HAD ANYTHING TO DO WITH IT WHEN I THINK BCK TO THAT DAY,\n23. WASNT SURE BUT I CHANNGED MY PERSPECTIVE OF FAITH,\n24. MY GRANDPA LIVED MANY MORE YEARS AND CELEBRATED HIS 90TH BIRTHDAY,\n25. SURROUNDED BY EVERYONE,\n26. THAT EXPRIENCED HAPPENED 20 YERS AGO,\n27. IT REMIANS IN MY MIND,\n28. GRANDPA PASSED AWAY FEW YERS LATER BUT HIS SPIRIT LIVE ON,\n29. I REMEMBER THE POWER OF FAITH AND MIRACLE AND ALSO WE ARE NOT REALLY ALONE EVEN WHEN IT FEEELS LIKE WE ARE.",
    "5629f7f1c8ffc2000f5135a0": "1. A person was working in a bookshop near to the home.\n2. He was\n22.\n3. He had just one sister who was caring for the grandad,\n4. who was bed ridden,\n5. as the parents were out of town.\n6. The young person heard a voice which said he must go to the church to light a candle.\n7. If he did that the grandad would get better.\n8. He did that and went back to the bookshop where he continued to shelve the books.\n9. He than had an urge to go home - no voice this time - where he found his grandad in a chair.\n10. He was told that the grandad had an urge to get out of the bed where he had been for many months.\n11. The grandad continued to get better and lived to 90.",
    "5e39f4be81b2ac0a49f999e6": "1. I started my first job in a bookstore.\n2. My grandad was bedridden for a year.\n3. My sister looked after him.\n4. At work one day I heard a voice talking about the church.\n5. I was going to be a saint.\n6. I went to the church.\n7. I prayed for my grandad to be healed.\n8. I went home.\n9. I saw my grandad.\n10. My sister said he found some energy.\n11. He started to walk.",
    "5d3594902fd5a4001ae58fb9": "1. The narrator was 22\n2. and worked in a bookstore.\n3. They heard a voice\n4. telling them to go to a church\n5. and light a candle\n6. so that their grandfather would recover.\n7. The narrator did,\n8. and prayed.\n9. His grandfather recovered\n10. but died a few years later.",
    "60c7928e14e0a43a43369a5b": "1. when this in college working in a bookstore,\n2. he felt a presence urging him to go to the nearby church\n3. to light a candle for his bed ridden grandpa\n4. that was home with his sister.\n5. when he went back to the store after lighting the candle\n6. that presence urged to go home\n7. where he found his grandpa sitting in the living room with his sister\n8. he had gotten out of bed after being bed ridden for a while.\n9. he died a few years later.",
    "608fd64f1e11fe3f5c0dae08": "1. There was a young man\n2. who was fresh out of college\n3. who worked about 5 miles from where he lives at the moment.\n4. He had 1 sibling\n5. who was a girl\n6. who was constantly caring for their frail grandfather\n7. who was very sick at that time,\n8. he didnt even have the strength to leave his bed in his bedroom to move around,\n9. he had been like this for months.\n10. She was the only person looking after him\n11. as both their parents were out of town\n12. One day as he was packing books onto a bookshelf\n13. he felt or heard a voice saying to him' You must go to the church down the road, grab a candle, light it and prey for your grandfathers recovery.\n14. The man thought nothing more of the voices\n15. and continued to pack the shelves,\n16. however the voices kept repeating the same things over and over again.\n17. He eventually walked a quarter mile down the street to where the church was\n18. and did what the voices said.\n19. He entered the church, found a candle, lit it and knelt down at the altar.\n20. He began praying to god,\n21. however he didn't know how to prey\n22. so he apologized to god\n23. and continued to do as he was told.\n24. He asked god to give his grandfather strength and health.\n25. After this he got up\n26. went back to the bookstore\n27. and carried on packing.\n28. However this time he felt an extremely strong urge to head back home.\n29. He listened to the urge\n30. and locked up the shop.\n31. After speeding home he opened the door\n32. only to see his grampa in the living room out of his room.\n33. After this event the young man always wondered if the prayer had anything to do with his grandfathers recovery.\n34. His grampa lived another 20 years after the event\n35. and eventually died\n36. however leaving his feeling of his presence in their hearts.",
    "5d9f4d5f3cac2b0016c79242": "1. A 22 year old in college started her first job at a bookstore,\n2. she was one of two siblings,\n3. her other sibling was her sister.\n4. Their grandfather was sick and dying\n5. but one day while she shelving books at the bookstore\n6. she heard a voice inside her head telling her to light a candle outside the church to save her grandfather.\n7. She went and did it,\n8. her grandfather miraculously recovered\n9. and lived for a few more years afterwards living past\n90.\n10. This happened to her a few years ago\n11. and she will never forget it.",
    "6072f8908ca848cb61dcce5d": "1. This person was 22 years old\n2. and worked in a bookstore.\n3. They lived with their Grandfather\n4. and sister,\n5. as their parent were away for the weekend.\n6. The grandfather had been bedridden for months\n7. and had not been able to leave his room without assistance.\n8. The person suddenly heard a voice tell them to go to the park\n9. and light a candle,\n10. after which their grandfather will get better.\n11. The person was not a particularly religious person\n12. but did so.\n13. They then locked up the bookstore\n14. and returned home\n15. to see their grandfather in the living room for the first time in months.\n16. The person's sister confirmed the grandfather had energy to get up from bed without assistance.",
    "6442db170a41e59ffe011949": "1. The main character was 22,\n2. and started working in a bookstore after graduating from college.\n3. He is one of 2 siblings,\n4. as he has a sister.\n5. His grandfather is ill at home\n6. and parents are away from town.\n7. One day whilst working,\n8. he heard a voice saying to go and light a candle for his grandad at the church.\n9. He went to church\n10. and lit the candle\n11. and prayed that his grandad would recover.\n12. He then returned to work\n13. where he suddenly had a strong urge to go home.\n14. When he got home,\n15. his grandfather was starting to feel better.\n16. This marked the start of his grandfathers recovery.",
    "60c9fcbb6090f57f63cdbebf": "1. A 22 year old man was working in the bookstore.\n2. He had recently finished college.\n3. His grandpa was being looked after by his sister at home.\n4. He was bedridden.\n5. It was a weekend and his parents were not home.\n6. So it was just his sister and him looking after him.\n7. He was shelving books when he heard a voice tell him to go to the church and light a candle for his grandpa.\n8. He looked around and didn't see anyone.\n9. He carried on working but heard the voice again.\n10. He tried to ignore it but then decided to lock up the store and take his break and go the church.\n11. Whilst walking to the church, which was a short walk away, he remember what his grandma use to say.\n12. A prayer is powerful if sincere but also a prayer without faith is useless.\n13. He wasn't religious but decided to go into the church.\n14. He found a candle and lit it and then knelt in front of the alter and prayed.\n15. \"I don't know how to pray but please make my grandpa well and guide us to help look after him\" or words to that effect.\n16. He went back to the store.\n17. He then felt an urge to go home.\n18. No voices this time just an urge to go home.\n19. He went home and found his grandpa sitting in the living room.\n20. His sister said he suddenly got a surge of energy and got up and walked.\n21. He didn't know whether this had anything to do with his prayer or not but it definitely changed his thinking on how powerful prayer can be.\n22. He grandpa lived for 20 more years and lived to 90 years old and they celebrated their time together.\n23. He had died now a couple of years ago.\n24. But to this day the man still remembers that day clearly and how it has changed his perspective on the power of prayer.",
    "60a3cb60b3e2bdb82a865197": "1. A man is recalling an incident\n2. that happened almost twenty years ago\n3. when his grandfather was sick at home\n4. with his younger sister.\n5. He was at work packing some bookshelves\n6. when he heard a voice say to him\n7. that if he went down to the old church\n8. and light a candle for his grandfather\n9. he would get better.\n10. He was not a prayerful person\n11. but he remembered his grandmother saying\n12. that a prayer made by a faithful person could bring about change.\n13. He went home\n14. and his grandfather was much better\n15. he was talking to his sister.\n16. He went on to live well into his nineties.",
    "5e42e8ce900ca402ea108764": "1. The persons grandad was ill\n2. so they were going to the church\n3. to light a candle\n4. as someone said that would help.\n5. They prayed to god.",
    "6318aed60b7ae5e0c899d3ee": "1. Girl 22, just left college working in local book store hears a voice telling her to go and light a candle in the church for her bedridden grandpa to make him recover.\n2. She did, even though she wasn't particularly religious,\n3. but she remembered her grandma saying that a sincere prayer could perform miracles,\n4. even though she'd made her fair share of mistakes.\n5. She lit the candle and returned to the book store,\n6. where she had an overwhelming feeling that she needed to go home.\n7. She locked up and did so,\n8. to find her grandpa sitting in a chair,\n9. having had a sudden surge of energy to get out of bed,\n10. which he hadn't done for a long time.\n11. That was the start of his recovery,\n12. and she often reflects on that day almost 20 years ago.\n13. Her grandpa celebrated his 90th birthday surrounded by family,\n14. and they cherished every day with him until he died,\n15. a few years ago.",
    "5e349c07e2790c468d9775aa": "1. One day I was a young boy\n2. and my sister was caring for my grandpa\n3. who was bedridden.\n4. I was working at a bookstore.\n5. There was only two siblings me and my sister.\n6. One day when I was shelving books\n7. a voice said to me to light a candle at the church for my grandpa\n8. and he would regain his strength.\n9. Although I wasn’t a strong believer\n10. and my grandma said prayer without belief was pointless\n11. I went and lit a candle.\n12. I said despite my misdeeds I was looking for help and strength for my grandpa\n13. to help him.\n14. I then returned to the bookstore to shelve books.\n15. I then felt a strong pull to return home.\n16. No voice just an overwhelming urge.\n17. When I returned home grandpa was sitting in the chair\n18. which he hadn’t done for some time\n19. as he didn’t leave his bed.\n20. My sister he had come over with a surge of energy.\n21. For many years we enjoyed our time together as a family after that.\n22. This was almost twenty years ago.\n23. It has reminded me to keep faith.\n24. My grandpa died a few years later\n25. but we cherished every moment because of this.",
    "60f88d15328d079d8d68fe00": "1. The guy was 22 years old\n2. working in a bookstore 5 miles from college/university.\n3. His sister cared for his grandfather,\n4. who had been bedridden\n5. and required care given by the sister.\n6. On a weekend,\n7. where the guy's parents were away,\n8. he was working at the store,\n9. when he heard a voice tell him\n10. that if he lit a candle at the local church\n11. his grandfather's health would improve\n12. and he would become mobile.\n13. The guy did this\n14. and prayed,\n15. then returned to work.\n16. He got an overwhelming urge to go home,\n17. so closed the store\n18. and found his grandfather sitting in the living room with the sister,\n19. where the grandfather felt a rush of energy\n20. and moved himself from his bed to the living room chair unassisted.\n21. The grandfather's health continued to improve,\n22. were he lived and celebrated his 90th birthday,\n23. but died some years later.\n24. The guy wonders whether his prayer caused the events to transpire in this way,\n25. and is mindful of the power of faith, prayer and belief.",
    "55f821f832af740005172118": "1. A man without faith\n2. decided to pray at church\n3. for his sick grandpa\n4. to heal\n5. and he believes\n6. it worked\n7. because his grandpa\n8. got up from his sick bed\n9. and lived for many more years.",
    "6019af2fccedd613b582048e": "1. 22yr old fresh out of college\n2. gets first job in a bookstore\n3. in a small town.\n4. she has a sister at home\n5. looking after the bed ridden grandpa\n6. and the parents are out of town.\n7. hears voices in her head\n8. and goes to church\n9. to light a candle for grandpa\n10. then goes back to work,\n11. then goes home\n12. to find grandpa up and about.\n13. he lives to 90\n14. and she thinks its because she prayed.",
    "605db73fe547ff7c425f59de": "1. The story is about a 22 years old young woman\n2. who live five miles from here.\n3. She had just started working at a bookstore after college\n4. and was shelving books at the store\n5. when she heard a voice in here head\n6. telling her to go to a church\n7. a light a candle\n8. to pray for her grandpa's health.\n9. Her grandpa and her sister were at home at the time\n10. and her granpa was bedridden for about a year at that point\n11. and her sister took care of him\n12. since he couldn't move around.\n13. After hearing the voice, she tried to see where it's coming from\n14. but she couldn't find it\n15. so she ignored it\n16. until it sounded again\n17. and this time she decided to take a break\n18. and go to the church down the street.\n19. She was not a religious person\n20. but after thinking about how she needed her grandpa to be better,\n21. she decided to pray\n22. and light the candle wholeheartedly.\n23. After the prayer, she went back to the bookstore\n24. and while she was busy working,\n25. she felt a strong urge to go home\n26. and she did after locking the store.\n27. She was surprised to see her grandpa and sister talking in the living room\n28. after she got home\n29. since her grandpa should have been bedridden at the time.\n30. They celebrated afterwards,\n31. and although this happened 20 years ago,\n32. she still remembers it vividly.",
    "5f95f7f71193824c90e0b5ef": "1. A 22 year old working in a bookshop\n2. heard a voice\n3. telling him to light a candle at the church\n4. for his sick grandpa.\n5. After he had lit the candle\n6. he went home\n7. and found his grandpa\n8. who had been unable to get out of bed\n9. sitting out in a chair\n10. with renewed energy.\n11. His grandpa made a full recovery\n12. and lived for many years.",
    "5803cb9a3073510001231d82": "1. 22 years old working in a bookstore shelving books.\n2. My sister cares for our grandpa whilst our parents are out of town.\n3. One day whilst stacking the shelves with books I hear a voice say to me 'if you go to church & light a candle your grandpa will get better'.\n4. This 'voice' kept nagging at me.\n5. So I shut the bookstore & headed to the church.\n6. I stood a while outside pondering whether to go in.\n7. I went in, lit a candle & said a prayer for grandpa.\n8. I went back to the bookstore & reopened it for a while before a nagging voice in my head told me to go home.\n9. I returned home where I was surprised to see grandpa sat up in a chair, something I hadn't seen for a while.\n10. Grandpa lived for a good few years after.\n11. Maybe it was the prayer that helped him get better/more mobile, who knows.\n12. Do you believe in the power of prayer?",
    "5c78452cac90ae000144bb23": "1. When a girl was 22,\n2. just finished college\n3. she worked in a bookshop.\n4. Her grandpa was ill at home\n5. and was looked after by her sister,\n6. she had one sibling- her sister.\n7. One day,\n8. she heard a voice in her head to pray for her grandpa.\n9. She was alone in the bookshop\n10. so she knew it was no one in the store.\n11. She then went to the church to pray\n12. and when she got back home\n13. her grandpa, who normally cannot walk, had energy to walk.\n14. This has given her faith in prayer\n15. and although her grandpa passed a couple years later\n16. it reminds her of how strong faith is.",
    "5a66568a63394a0001558e4d": "1. Let me tell you a story from when I was twenty-two years old.\n2. My grandpa was very sick.\n3. I worked in a bookstore at the time.\n4. Suddenly, I heard a voice in my head that said \"light a candle for your grandpa at the church\".\n5. I was only a short distance from the church.\n6. A quarter mile.\n7. I had never been a religious man but my grandma had told me the power of faith.\n8. As I entered the church, I knelt and said \"God, I don't know how to pray. but please restore my grandpa to his strength and guide us in looking after him\".\n9. I returned to the bookshop after.\n10. Suddenly, I felt a strong urge to return home.\n11. I locked up the shop and went home.\n12. I was shocked to find my grandpa in the living room talking to my sister.\n13. He hadn't left his bed for months without assistance.\n14. He lived for many more years and celebrated his ninetieth birthday surrounded by his loved one.\n15. He died several years later but his spirit lives on in our hearts.",
    "5ced0ccddfb2720019962226": "1. The boy took a job in bookstore during his break from university\n2. and his sister was looking after their grandad\n3. as his parents were away for the weekend\n4. his grandad had been bedridden for some time\n5. while book stacking he heard a voice tell him to go light a candle\n6. and say a prayer for his grandad\n7. so he did\n8. even though he wasn't a church goer,\n9. when he got back to bookstore he felt a sudden urge to go home\n10. where he found his grandad sitting in the kitchen looking much better\n11. and some thing he hadn't done for some time\n12. he said he felt sudden surge of energy and strength\n13. maybe the prayer and lighting of the candle had worked\n14. his grandad got healthier and stronger\n15. and lived to ninety.",
    "5f4cc45ee974b18dbf4a503d": "1. A twenty two year old person had just finished college\n2. and was working in a book store.\n3. He had a sickly grandfather\n4. and a sister that looked after him.\n5. Whilst packing the shelves he heard a voice in his head\n6. that said he should go to the church\n7. and light a candle for his grandfather.\n8. He looked around the book store\n9. and didn't see anyone\n10. then heard the voice say the same thing again.\n11. He decided to go down to the church,\n12. even though he isn't religious,\n13. and light a candle\n14. and say a little prayer.\n15. Later he got home\n16. and his grandfather was feeling a little better.\n17. He lived for 20 more years\n18. and now the person seems more religious\n19. and takes comfort in his memories of his grandfather.",
    "5c6c81cf1137e9000178795b": "1. When he was 22 years old,\n2. he worked in a book store\n3. which was five miles from his house.\n4. He lived with his sister\n5. and grandpa\n6. who was bedridden for many years.\n7. Whilst in the bookstore,\n8. he heard a voice telling him to pray\n9. and he remembered his grandma told him pray brings miracles\n10. so he went to church\n11. and asked God to help his grandpa\n12. even though he wasn't religious\n13. he was asking for a miracle.\n14. He was then told by his sister\n15. that his grandpa suddenly left the bed\n16. which he believed was a miracle.\n17. His grandpa celebrated his 90th birthday\n18. and passed away a few years later.",
    "615e0a9b470e2794d8318046": "1. A boy worked in a book shop.\n2. He had one sister who looked after his grandfather,\n3. who wasn’t able to look after himself.\n4. One day while shelving books, the boy heard a voice\n5. that told him to go to the church and light a candle for his grandfather.\n6. If he did this, and prayed, his grandfather would regain his strength.\n7. His grandfather hadn’t been able to leave his bed for months.\n8. The church wasn’t far down the road so the boy went.\n9. He found a candle and kneeled down.\n10. He wasn’t a very religious person so he started his prayer by saying he wasn’t sure how to pray.\n11. He asked for his grandfather to regain his strength.\n12. When the boys was back at the book shop he had an overwhelming feeling to go home.\n13. So he closed the bookshop and went home.\n14. When he arrived home his grandfather was sitting downstairs,\n15. and he hadn’t been able to leave the bed in months.\n16. His grandfather lived for many more years\n17. and they all cherished the time they had with him.\n18. The boy looked back and wondered did his prayer have anything to do with his grandfather regaining his strength and recovering.",
    "616d8ff5eeb9a8616afa647d": "1. The story takes place some years years ago,\n2. when the storyteller was young.\n3. He had a sister.\n4. His grandfather was very unwell and was bed ridden.\n5. One day he was working in a bookshop stacking shelves,\n6. when he heard a voice in his head.\n7. The voice was telling him to go to the local church and light a candle for his grandfather.\n8. He looked around the store,\n9. but he was alone.\n10. He went back to stacking books\n11. but he kept on hearing the voice.\n12. Although he was not religious,\n13. he decided to go to the local church and do as the voice said.\n14. When he got to the church he said a prayer for this grandfather.\n15. He returned to the bookshop and continued to stack shelves.\n16. However, he soon had an overwhelming feeling to return home,\n17. so he locked up the bookshop and went home.\n18. When he entered he heard his grandad talking to his sister in the living room.\n19. His prayer seemed to have been answered and his grandad got better.\n20. He celebrated his ninetieth birthday and died shortly afterwards.\n21. The event had a big impact on the storytellers life\n22. and from that dat forth he gained faith.",
    "5772b5b39137f30001ebbbb7": "1. Let me tell you a story about when I was twenty two,\n2. fresh out of college.\n3. I was working in a bookstore\n4. and living with my sister then.\n5. My sister was taking care of my grandpa,\n6. who was bedridden.\n7. One day as I was working\n8. I heard a voice in my head telling me to go to the church yard.\n9. I am not a particularly religious person.\n10. I heard the voice again\n11. and went looking for the church.\n12. I found the church\n13. and I prayed.\n14. After that I went home.\n15. My sister was there\n16. and she told me my grandfather had experienced a sudden surge of energy.\n17. That marked the beginning of his recovery.\n18. After that he steadily got better\n19. and made a full recovery.\n20. That was twenty years ago\n21. and he went on to live a full life till he passed at the age of ninety.\n22. That was the beginning of my faith.\n23. Sometimes when things get tough\n24. I still look back on that moment\n25. and remember the power of faith and prayer.",
    "5b9110223366db0001157e7d": "1. as a young man\n2. he had just started his first job\n3. and a voice inside his head urged him\n4. to go to the church\n5. and light a candle,\n6. he did\n7. and his grandpa recovered.\n8. This incident made him believe\n9. in faith\n10. and prayer.",
    "60199b0a7384e30ddf3a7c55": "1. HE WAS 22\n2. AND STARTED FIRST JOB IN BOOKSHOP.\n3. HIS GRANDA WAS BEDRIDDEN\n4. AND WAS BEING CARED FOR BY HIS SISTER.\n5. HE HAD A LIGHT BULB MOMENT\n6. WHERE HE WAS TOLD TO LIGHT A CANDLE IN THE LOCAL CHURCH\n7. AND HIS GRANDPA MIGHT IMPROVE\n8. BUT HE WAS ALONE.\n9. HE KEPT HEARING THE VOICE.\n10. HE TOOK A BREAK\n11. AND WENT TO THE CHURCH NOT FAR.\n12. AFTER SOME HESITATION\n13. HE ENTERED THE CHURCH,\n14. GOT A CANDLE\n15. AND KNELT DOWN\n16. AND ASKED FOR HIS GRANDPA TO BE HEALED.\n17. HE RETURNED TO THE BOOKSHOP\n18. BUT NEEDED TO GO HOME\n19. AS HE WAS INSPIRED\n20. AND WHEN HE GOT THERE HIS GRANDPA WAS ABLE TO LEAVE HIS BED UNASSISTED.\n21. HE FINALLY REGAINED HIS INDEPENDENCE\n22. AND CHANGED EVERYONES LIFE FOR THE BETTER\n23. AND LIVED INTO HIS NINTIES\n24. AND MAYBE PRAYER AND FAITH IS THE ANSWER.",
    "5cfaf97eadb3da00013c1eaa": "1. There was a boy who had a sister and a grandpa.\n2. His grandma had died.\n3. His grandpa was very weak.\n4. He could not care for himself.\n5. Therefore, he worked in the bookstore.\n6. His sister took care of the grandpa.\n7. One day while at the bookstore, he heard a voice twice.\n8. The voice told him to go to the church.\n9. He was to light a candle and pray for the grandpa.\n10. On his way, he hesitated.\n11. But still, he went ahead and prayed a simple prayer for his grandpa's healing.\n12. He was not a particularly religious person.\n13. His grandma always told him prayer should come from a sincere heart.\n14. These were the reasons for his resistance.\n15. However, back at the bookstore, while resuming his tasks, he felt a strong urge to go home.\n16. After obliging, he was surprised to find his grandpa sitting in a chair.\n17. His grandpa was chatting with his sister.\n18. This was not normal as he was unable to get up from bed.\n19. Grandpa explained that he felt a surge of energy a while ago.\n20. His sister was happy.\n21. The writer could not believe this had anything to do with his prayer.\n22. Grandpa, however, made continuous recovery.\n23. He lived a long time after that.\n24. He died at about ninety years in the midst of family and friends.\n25. This taught the writer about faith.\n26. There is another presence with us even though we seem to be alone.\n27. There's always someone looking out for us.",
    "62a1ef4b118ae7c6c666e130": "1. The story is about a 22 year old\n2. that was hearing voices in their head\n3. & also had an ill grandpa.\n4. They prayed for their grandpa to get better\n5. which he did\n6. but he eventually died.\n7. The moral of the story was to always have faith\n8. & that you’re never alone.",
    "55ad3f2dfdf99b563a2471c8": "1. When I was twenty two years old\n2. I was working in a book store.\n3. At the time my grandpa became unwell.\n4. Whilst stacking books in the store\n5. I heard a voice telling me to go to the alter and light a candle for him.\n6. I looked around\n7. but couldn't see anyone\n8. but the voice remained.\n9. My grandma always told me a prayer from a sincere heart can have a meaningful impact,\n10. but a prayer from someone with no faith is meaningless.\n11. I know I am not a saint\n12. as I have made many mistakes.\n13. But as I was leaving the store\n14. I felt compelled to turn around and go to pray.\n15. I said my prayer\n16. that I don't know how to pray\n17. but would like support for my grandpa.\n18. Once I returned home\n19. I was surprised to see my grandpa in the living room,\n20. my sister told me he had started to recover.\n21. This was the first time I had seen him\n22. as normally he was bedridden\n23. and it marked the start of his recovery.\n24. I wasn't sure if my prayer had anything to do with his recovery,\n25. but it did make me reconsider my views on faith.\n26. We then spent as much time as we could with my grandpa\n27. as he made his recovery\n28. and learnt to enjoy the time we had together.\n29. He continued to live on for many years\n30. seeing through his 90th birthday\n31. before passing away peacefully.",
    "634e7e0695471fa84bfe5f2f": "1. Started working at a bookstore straight out of college at 22 years old.\n2. Grandpa was sick.\n3. Only two siblings, me and my sister to look after him.\n4. Heard a voice in my head to go to the church,\n5. Light a candle\n6. And pray for his grandpa to get better and recover.\n7. Not religious but went to church anyway\n8. And lit and candle\n9. And prayed.\n10. Went back to the bookstore\n11. And had overwhelming feeling that he needed to go home.\n12. Went home\n13. And grandpa was out of bed\n14. And sitting in the living room with my sister.\n15. He hadn't gotten out of bed for months without assistance.\n16. This was the start of his recovery.\n17. Got better\n18. And lived until 90 before passing away recently.\n19. Made me think of the power of faith.",
    "60dcc945f7ee60621d36b715": "1. The author is in his twenties\n2. and was working in a bookstore.\n3. His grandfather was poorly\n4. and living with him\n5. and his parents\n6. and his parents are away for the weekend.\n7. When he was at work\n8. he had a voice say to his to go to the church\n9. and he felt compelled to go,\n10. even though he had no strong faith.\n11. He tells how his grandmother used to say something about no prayer is wasted\n12. but also that a prayer without conviction was worth less-\n13. or words to that effect.\n14. He went to the church\n15. and said to God he didn't really know how to pray\n16. but that he was praying for his grandfather's healing.\n17. He returned to work\n18. but when there felt a strong urge that he must return home.\n19. So he closed up the bookstore\n20. and went home.\n21. On getting home, he was surprised to find his grandfather sat up in the living room,\n22. talking with his sister,\n23. as he had been bedridden for months prior to the.\n24. His sister told him that he just suddenly had the energy to get up.\n25. The author muses whether his visit to the church has anything to do with this.\n26. From then on, his grandfather continues to gain strength\n27. and return to his health\n28. and lived for many years into his 90s.\n29. This story became a something of a family legend\n30. and lives strong in the authors memory.",
    "5f7760d025023628ce3f4d05": "1. A man 22 years old, fresh out of college is looking after his ill grandpa with his sister at their family home\n2. while his parents are out of town.\n3. He has a job at a bookstore\n4. and whilst working, hears an imaginary voice telling him to go to the church and light a candle.\n5. He does it, despite not really believing it,\n6. but thinking about what his grandma used to say, he goes anyway.\n7. Once back to the bookstore after lighting the candle\n8. he gets a strong urge to go home.\n9. When he gets home his grandpa is sitting in the lounge\n10. despite not being able to get out of bed for months.\n11. His grandpa lived a few more years after that.\n12. The writer is recalling the story from 20 years ago.",
    "64528c575f51539110be524a": "1. Let me share a story when I was twenty years old.\n2. I finished my school and started a job.\n3. We are two siblings and a grandpa.\n4. Our grandpa was bedridden,\n5. He could not move on his own.\n6. One day, I felt someone saying to me go down to the church and pray.\n7. I had ignored that many times\n8. But one day I felt an urge to go there.\n9. I was not a religious person.\n10. I went to the church,\n11. Knelt down,\n12. And say a prayer to God to recover my grandpa and give him a healthy life so he could move.\n13. I have heard that prayer from the heart with strong belief never goes unheard\n14. And prayer without a belief is never heard.\n15. So, said a prayer and went home.\n16. When I went home, to my surprise my sister told me that Grandpa suddenly felt some unbelievable energy\n17. And he stood up without any support.\n18. That day, made my belief strong that no prayer goes wasted.\n19. Grandpa lived so many years with spirit and health.",
    "5d39a607190d3e000100e72a": "1. \"When I was 22 years just after college I went to work in bookstore.\"\n2. \"On the weekend in question my parents were out of town and my sister was minding my grandpa who was bedridden.\"\n3. \"Suddenly I heard a voice in my head telling me to go to the church to light a candle for grandpa and he would get better.\"\n4. \"I looked around the store and there definitely wasn't anyone else in there with me.\"\n5. \"I wasn't a overtly religious person nor would I call myself a saint.\"\n6. \"I decided that I would go to the church, I entered, lit a candle, and said a prayer.\"\n7. \"I then went back to the store.\"\n8. \"I had this overwhelmingly feeling that I needed to go home and I closed up shop.\"\n9. \"When I got home I saw that my grandpa sitting in the living room.\"\n10. \"My sister informed me that he had got there himself, he hadn't been able to get out of bed unassisted in months.\"\n11. \"Up to this point I hadn't believe too strongly in faith and miracles but this felt like one.\"\n12. \"My grandpa gradually made a recovery and recovered his strength and independence.\"\n13. \"He went on to sleep long more years and celebrated his 90th birthday surrounded by family.\"\n14. \"Whenever I feel lost I think back to this vivid memory to brighten my day.\"",
    "5e9883baf93c610a951f26e7": "1. I am 22 years old\n2. and I was walking to the bookstore,\n3. where I work.\n4. At home, I have a grandpa\n5. and a sister.\n6. My grandpa is bedbound\n7. and is not in a good state.\n8. My sister looks after him.\n9. While shelving, I heard a noise in my head\n10. \"Come to the church and pray for your grandpa\n11. and he will get better\".\n12. I looked around\n13. and nobody was there.\n14. I closed the bookstore\n15. and walked to the church\n16. which was a quarter of a mile away.\n17. On the way I remembered my grandma's words.\n18. I am not particularly religious\n19. but she said that prayers with a sincere heart come true.\n20. On the other hand, she said prayers without faith were useless.\n21. In the church I prayed for my grandpa to get better.\n22. I left\n23. and went back to shelving at the bookstore.\n24. I then felt the sudden urge to leave\n25. and go home\n26. so I locked up\n27. and went home.\n28. When I arrived, I found my grandpa sitting in the chair in the living room\n29. talking to my sister,\n30. which was a surprise because he was bedbound for the last few years.\n31. My sister said he felt a sudden urge of energy\n32. and managed to get out of bed.\n33. That marked the first day of his recovery.\n34. He lived until his 90th birthday in good health.\n35. That was 20 years ago\n36. and he died several years later.\n37. Sometimes now when I think about it\n38. I am reminded that we are not alone\n39. even when it may appear we are.",
    "5e8e5058e690d70ebefeb033": "1. Man lives with his grandpa and his sister,\n2. his grandpa is bed ridden\n3. and is recovering from illness.\n4. His parents are out for the weekend.\n5. He works at a library 20 miles away from the town,\n6. whilst working he was urged by a voice in his head to go the local church and light a candle,\n7. he kept putting back the thought\n8. but it kept repeating over and over\n9. till he decided to go to the local church.\n10. Once at the local church he said that his grandma used to have a strong faith\n11. and that she would say prayers work but only for those with faith.\n12. He prayed to god for his grandpa to recover.\n13. He felt a strong urge to go home and check on his grandpa,\n14. so he immediately went home\n15. and found his grandpa sitting in the living room talking to his sister.\n16. He had managed to get up on his own\n17. and that became the start of his grandpas long recovery.\n18. The grandpa lived to celebrate his 90th birthday surrounded by all the family,\n19. until he passed away a few years later\n20. and the memories with the grandpa are cherished by him.\n21. He is now a man with stronger faith\n22. and believes in the power of faith and miracles,\n23. and tells us that we are never alone.",
    "5ac68755fa3b4e0001737f38": "1. The narrator was working in a bookstore.\n2. Their sister was at home caring for their bedridden grandpa.\n3. Suddenly, a voice in their head said go and pray for your grandpa and he will get better.\n4. The narrator went to the church.\n5. They explained how skeptical they were about the power of prayer,\n6. but after some time they conceded\n7. and even though they said they did not know how to pray\n8. they pray for their grandpa's recovery.\n9. They then went home\n10. and their grandpa was no longer bedridden\n11. and it was the start of his recovery.\n12. Their grandpa died a few years later,\n13. but 20 years later the narrator still feels the power of prayer.",
    "634e9bff0e8c21e97c621cb1": "1. 22 year old, fresh out of college, working in a bookshop.\n2. His grandad has been bed bound for a number of years.\n3. He hears a voice urging him to light a candle at the church to heal his grandad,\n4. but no ones around.\n5. He hears the voice again\n6. and decides to take a break.\n7. Arriving at the church he questions his faith,\n8. and as he's not overly religious,\n9. would his prayer make things better or worse based on his grandmother's advice.\n10. He prays\n11. and returns to work.\n12. Later he gets an overwhelming urge to go home.\n13. Locks up,\n14. goes home to find his grandad sitting in the living room after getting a surge of energy.\n15. That was the start of his recovery,\n16. and he regained his independence & strength.\n17. Celebrating his 90th birthday with his family.",
    "63bda8bbe64ce816bb0e37e2": "1. A man worked in a bookstore\n2. and had a sick grandpa.\n3. He heard a voice at the bookstore\n4. that told him to light a candle for his grandpa\n5. and he would get better.\n6. The man went to the church to pray\n7. and light the candle.\n8. The man went back to the bookstore to work.\n9. The man went back home to find his grandpa better.\n10. The man's sister told him he had recovered.\n11. The grandpa lived longer\n12. but eventually died.",
    "5e4464d23e28c82e888fa598": "1. I was 22 just out of college\n2. and I started working with my grandad at our bookstore,\n3. he quickly became very ill\n4. and bedridden\n5. one day when working\n6. I heard a voice whisper\n7. and say that if I went to the local church\n8. and lit a candle\n9. my grandad would be fine,\n10. although no one was around when I looked.\n11. I remembered my grandma saying that prayers made with good hearts could create miracles,\n12. I was no saint\n13. but what harm could it do.\n14. So I went to the church with a candle,\n15. praying that he was alright.\n16. I got the feeling to suddenly go home,\n17. Grandad was out of bed looking much better.\n18. He ended up living many years more\n19. and celebrating his 90th birthday,\n20. the whole experience was 20 years ago\n21. but gave me a much different perspective on religion and prayer.",
    "62fba19b31689f425e047e01": "1. This Young Lady bookstore keeper,\n2. her grandpa's got seriously ill.\n3. And, while she was at the her bookstore,\n4. arranging the shelves'.... etc.\n5. She suddenly heard a voice urging her to go to Church to make some prayer's.\n6. The inner voice was telling her that if she done so her Grandpa's would certainly become well.\n7. She followed the instructions accordingly and done so.\n8. Moreover, after she prayed got back to her store\n9. and then she had that strong urge and emotions telling her to head back home now!!\n10. She went back home\n11. she found her grandpa's sitting with her sister having a chin-wag\n12. she become well and fit like a horse.\n13. From, that day forward she knew the importance of faith,\n14. the whole family become more religious,\n15. grateful to life\n16. and cherished every moment!!\n17. Finally, her grandpa's fully recovered\n18. and lived on many years full of health and joy.",
    "5841a2d39d65770001cebfa1": "1. Working in a bookshop after college.\n2. My sister at home caring for my bedridden grandpa.\n3. It is just me and my sister.\n4. I hear a voice urging me to go to the church and light a candle and my Grandpa will recover.\n5. I go to the Church and even though I'm not religious and have made many mistakes in my life I light a candle and say a prayer.\n6. My Grandmother said a prayer from a genuine heart can make miracles but also that a prayer without faith was meaningless.\n7. I then return to the shop.\n8. I feel an urge to go home.\n9. When I get there my Grandpa is sat in the living room.\n10. My sister said he felt a surge of energy which helped to get him out of bed.\n11. I wondered if it was the lighting of the candle.\n12. My Grandpa lived to be 90 and celebrated his birthday surrounded by family and friends.\n13. I recall that day 20 years ago which helped me cherish the time I had with my family."
  }
}