{
  "narrative": " My best friend pushed me into the pool. This happened during my cousin's wedding reception, where everyone was dressed to impress. And the reason it happened, she spotted a bee hovering near my face, - this was at a fancy hotel garden - and she tried to save me from being stung. And my aunt had just handed me a glass of champagne, and I warned her to be careful. 'Course friends, y'know, they don't always think things through. So that's when she gave me a little shove, and I tumbled into the water. When I resurfaced, gasping for air, she just started laughing, and she apologized profusely. And... my beautiful dress was ruined, and naturally, the first thing to do was to get out and dry off, and my cousin just says, \"Just about a few inches more,\" she says, \"and you'd have landed on the cake.\"",
  "recalls": {
    "5ea1bd7e16a0c70919660653": "During a wedding a lady was pushed into a swimming pool by her aunt as a bee was close to her.\nShe nearly fell on the wedding cake.",
    "5d10fa2bbfbf0a000133594b": "My cousin pushed me into the pool at my cousins wedding. She pushed me in as there was a bee. My auntie told me to be aware of friends, as they don’t always think things through. Then she gave me a little shove. I landed in the pool, then the next thing to do was get out and dry off, but my beautiful dress was ruined. My cousin started laughing, and said, a couple more inches, and you would have landed in the cake.",
    "5a3ee0d22f91ec0001dca78d": "My best friend pushed me into the swimming pool at my cousins wedding. She was trying to avoid me being stung when a bee landed near my face.  My Aunt said that's what best friends do. When I resurfaced my friend burst into laughter.  My cousin said if I had a fallen a little further a few inches it would be been on the cake. ",
    "62b6cb277460cccbc8f27ad5": "SHE WAS AT HER BEST FRIENDS WEDDING WHEN HER COUSIN TRIED TO SWIPE AWAY A BEE WHEN SHE ACCIDENTLY PUSHED HER IN TO THE POND, SHE WAS HOLDING A GLASS OF CHAMPAGNE HER AUNT HAD GIVEN HER, HER COUSIN JUST LAUGHED ONCE SHE GOT OUT AND DRY, SHE APOLOGISED AND SAID GOOD JOB YOU DIDNT FALL INTO THE CAKE",
    "589f019c69733b0001af54df": "My best friend pushed me in to the pool.  This happened during a friends wedding reception.  I had just been given a glass of champagne and a bee came along.  She tried to prevent me from getting stung and just gave me a little push.  I fell into the pool and ruined my new dress.  My aunt said, \"just a few more inches and i would have fallen on the cake.\"",
    "5a7c5a98eea3d300016e1d1e": "girl was pushed into the pool at her cousins wedding by her best friend because there was a bee next to her.  she apologised but the dress was ruined. ",
    "575ef812a2ce6e000666f239": "Person pushed into the pool by a friend during her aunt's wedding reception, friend saying something about a bee. Person climbs out of the pool in her wet dress to dry off. Relative makes a joke about another few inches and landing on the cake.",
    "6171b613293370249f437607": "Her best friend pushed her into the swimming pool because of a bee, while they were at her cousins wedding at a hotel. She got out and dried off, but her dress was ruined. She missed the cake by a few inches.  ",
    "60ad65a0a187d7ef811ed7e6": "a lady and her best friend attended her cousin's wedding at a beautiful hotel garden. The friend pushed the lady in the near by pool to prevent her from being stung by a bee just moments after the lady's aunt has handed her a glass of champagne. As she resurfaced and gasped for air the friend started laughing and apologizing for her actions while explaining why she pushed her in the pool. though the lady was worried about her dress being ruined the cousin then told her she was inches away from landing on the wedding cake.",
    "5f37748da58054204f5b433a": "Was sitting by the edge of the pool at a wedding. Had a glass of champaigne from your aunt. A bee was flying in front of your face, and your friend pushed you in the pool, claiming she was trying to save you from the bee. Your dress was ruined. And your friend laughed and said a few more inches and you would have landed on the cake. ",
    "5f218e5462e3b6568de0f0e5": "It was her cousin's wedding and her friend had pushed her into the water. It was a fancy wedding where everyone dressed to impress. She had a glass of champagne. Her dress was ruined. When she went to gasp for air, someone says that she was very close to the landing on the cake.",
    "5f2dd11452744f1170ea3545": "",
    "602c64564ad77a557c5cc279": "I got pushed into a pool by my cousin, the reason it happened was there was a bee in a motel garden and my cousin pushed me to prevent me getting stung. I landed in the pool and the first thing to do was to dry off my beautiful dress. My cousin laughed and apologised profusely when I got out of the water. 'A few inches further and you've have landed in the cake' she said.",
    "600dbc400c8bdf5900aa0cd5": "I got pushed into a river at my cousin's wedding, by my best friend who was trying to save me from a bee, I was handed a glass of champagne, we were all dressed to impress. ",
    "5dc1978fdbf8200fe9537083": "My cousin pushed me into the pool. This was at my cousin's wedding and everyoen was dressed to impress. There was a bee hovering close to my face and she just tried to warn me about. My aunt told her to be careful. That's when she gave a little shove and I tumbled into the pool. Whe nI resurfaced she stared at me at then laughed. She apologised profusely and my beautiful dress was ruined. She said that with a few more inches I would have landed on the cake.",
    "596e5141fe061d00011e3984": "My best friend pushed into the pool. I was at my cousins wedding reception, everyone was dressed to impress. The reason was she saw a bee hovering above my head. My aunt had passed me a glass of champagne. Best friends dont always think things through and she gave me a little shove. My cousin said \"just a few inches further and you would have landed on the cake.\"",
    "58a89e40e6afe00001d36058": "At a wedding my friend gave me a small shove to protect me from a bee. Unfortunately I then fell into the swimming pool fully clothed in my smart dress. My cousin said I just missed flattening the wedding cake.",
    "5d416bd5af929100194e80e1": "A woman was at her cousin's wedding in a fancy hotel. Everyone was dressed to impress. Her \nAunt handed her a glass of champagne and as she did a beee started to buzz around her head. Her best friend pushed her into the pool while trying to get the bee away. Her dress was ruined. Her Aunt laughed. Her Cousin said if she'd been a few inches more to the side, she'd have landed in the cake. ",
    "5a9bec4c6475f900019ffb56": "My best friend pushed me into the pool at my brother's wedding. This was after my aunt had given me a glass of champagne..my friend who had not thought it through, was trying to save me from a bee. My dress was ruined and as I got out and dried myself off, she laughed and apologised. If I had landed a foot more I would have not the cake.",
    "5c3f2e175fe5c60001ffc302": "My best friend pushed me into the water when we were at my cousins wedding. She saw a bee and pushed me to save me being stung. My aunt had just handed me a glass of champagne. I narrowly missed the wedding cake! My dress was ruined. My friend laughed but also apologised",
    "5e4c4949d7a02705c4f70ebb": "Friend pushed me into water I was at my aunties wedding and she saw a bee and gave me a little shove to save me from being stung and when I came up gasping for air she laughed and apologized profusely my beautiful dress was ruined",
    "5c714e3c21beb1000181bc74": "My best friend pushed me into the pool this was at my cousin wedding Reception where my aunt nearly got stung by a bee my dress was ruined and my friend apologised profusely ",
    "60a520c051c98eb480c2811f": "My best friend pushed me in the pool, we were at my cousin's wedding at a hotel. Everyone was dressed to impress. My best friend had seen a bee hovering close to my face and decided to save me from it, my aunt had just handed me a glass of champagne at that moment. My friend gave me a little nudge and I fell into the pool. When I submerged my friend was laughing at me, my beautiful dress was ruined. She continued to say \"just a few more inches you would have landed on the cake\". ",
    "599dacb43c7d1a0001deef97": "a girls friend pushed her into a pool at a wedding reception in a fancy hotel.",
    "5e93641d8028056ac36b16d9": "During my cousin's wedding reception, my best friend pushed me into the pool to save me from a bee. I resurfaced, my dress ruined, and my cousin jokingly mentioned I almost landed on the cake.",
    "5ca345b1506fca0016b358bb": "My best friend pushed me into the pool at my cousin's wedding which was at a posh hotel. She said it was because there was a bee near my eye and she didn't want me to get stung. I was wearing a lovely dress, everyone was dressed to impress. My aunt had just handed me a glass of champagne. When I surfaced, spluttering, I wanted to get out of the pool and dry off. My friend just laughed and said I could have landed in the cake.",
    "606c1958e66bcbfde2156006": "My best friend pushed me into a pool. Dressed to impress at her cousins wedding. Best friend pushed her into the pool as their was a bee hovering above her head - it was a fancy hotel. Her aunt had just handed her a glass of champagne, and she said to be careful. Her friend gave her a small nudge, and she stumbled into the pool. Naturally her friend just laughed but apologised profusely. Beautiful dress was ruined. Natural instinct was to get out and dry off, but her cousin said, a few more steps, and you would have fallen in the cake",
    "6070a06a1d49fbecb9ee79d2": "Someone was at a wedding. She was standing outside in the garden, holding a glass of wine when she was pushed into a water fountain. Her friend spotted a bee close by and pushed her into the water to save her. Her dress was ruined and she very nearly fell on the wedding cake. ",
    "62ea45c78e38d6b93c10a235": "My best friend pushed me into a pool. It was at my cousin's wedding where everyone was dressed to impress. It was in the garden of a fancy hotel and my aunt had just passed me a glass of champayne. My friend did it because she spotted a bee and didn't want me to get stung. I told her to be careful but she didn't think things through and gave me a little shove. I fell into the pool, ruining my dress and she just started laughing and apologised. I got out and had to dry myself off. My cousin said that if I'd have fallen a few more inches I'd have landed in the cake",
    "5d11dd0790265e00019ba937": "My best friend pushed me into the pool at a wedding.There was a bee near my face.Everyone was dressed to impress.My mother had a glass of champagne.I nearly landed on the cake ,missed it by a few inches",
    "62fca9ec379f4b6707aaef85": "A woman’s best friend pushed her into a pool which was during her cousins wedding reception because she seen a bee near her face and tried to save her from being stung.\nShe was given a glass of champagne.\nThe cousin found it funny and laughed whilst also apologising profusely. \nEveryone was dressed up as it was a fancy hotel garden and her dress was ruined from being wet and she got out and dried off.",
    "6099089783231a811aee3ad3": "My best friend pushed me into the pool.This happened at my cousin's wedding, where everyone was dressed to impress. She did this because she spotted a bee, hovering near my face - and she tried to save me from being stung. While being handed a glass of champagne carefully. She warned me and gave me a little shove and I fell into the water. I gasped for air and she started laughing. My beautiful dress was ruined. My cousin said that if it was a few more inched, I would have landed on the cake",
    "6147724c13bb365774e24af1": "My best friend pushed me into a pool. How it happened was, we were at my cousin's wedding, and my friend saw a bee hovering near me. My aunt had just handed me a glass of champagne and you know how friends are, she just started laughing. My dress was ruined and my cousin said \"a few more inches\" she said \"and you would landed in the cake\"",
    "5f4f92a3ef108806270215c9": "They are at a wedding reception and the protagonist is shoved into the pool because there's a bee. SHe gets out of the pool, dries off and the cousin is glad she didn't fall on to the cake.",
    "5af29f9c0eca060001b153bd": "A girl's best friend pushed her into the pool at her cousin's wedding reception where everyone was dressed to impress. The reason she pushed her into the pool was because she saw a bee flying near her head and didn't want her to get stung. And so she sohved her into the pool.\nThe girls Aunt has also just handed her a glass of champagne. When the girl came to the surface, her friend just started laughing. Her dress was ruined. She said a few inches further and she would have landed in the cake!",
    "571a3f73c97ad400083a2ea0": "A woman’s nest friend pushed her into the pool while she was holding a glass of champagne because she said a he was hovering around her face. When she got out with her fancy dress all ruined her friend laughed hysterically and said a few more inches and she would have ruined the wedding cake.",
    "615f4e20d504f648ffd22972": "My cousin pushed me into a pool. This was at a wedding. It was because of a bee. She'd seen it hovering near me and wanted to save me. My aunty had just passed me a glass of champagne. I said 'be careful,' but y'know, people aren't always. Then she pushed me into the water. My beautiful dress was ruined. She just laughed and said 'a couple of inches to the left and you'd have landed in the cake,'. ",
    "60be17bce1456e0796cde161": "",
    "64730850e5f4a7b6b71fc40a": "Wedding at a posh hotel, the girl in question was just handed a glass of champagne by her aunt and then her cousin saw a bee near her and decided to help her by moving her out of the way of the bee and in doing so she fell into the pool.  Came up gasping for breathing her lovely dressed soaked and her cousin was laughing.  If she had falling a few inches to the side she would have landed in the wedding cake",
    "60205f5ba5fe0165fa0e5e01": "My cousin pushed me into a pool at my sister's wedding reception where everyone was dressed to impress. Then when i resurfaced she laughed at me and said that if i were pushed a little to the right or to the left i would have landed on the cake. ",
    "631b32b0796f2941b55e7d58": "My best friend pushed me into the pool at my cousins wedding because a bee was hovering around my face. My aunt handed me a glass of champagne and told me to be careful. My friend started laughing and the first thing I did was get out an dry off. My cousin said that a few inches closer and I would have fell into the cake.",
    "603f6ea3c439b514c173633d": "A girl was going to a wedding where she met her cousin and the cousin said something or spilled champagne over him and he needed to dry out and he said something to her at the end a few more inches left",
    "5f60a56c328d6f05ede09874": "pushed into pool by best friend at a wedding reception. saw a bee near her face and tried to save her from being stung. fell a few inches from the cake. dressed to impress, yet the dress was ruined. wedding was at a fancy hotel garden.",
    "6083ba6abe81fe3fc3c6095f": "Invited to cousins wedding. Friend pushed her in a lake as did not think things through. Dress ruined. Few inches more and would have landed on the cake.",
    "5e72ad1027f38a1fced5bf6f": "This story was about a fancy wedding at which the storyteller was pushed into a pool by their friend because of a bee. Their dress was ruined and their aunt made a funny remark at the end.",
    "5cc3289b9e21e200015f0bb3": "her friend pushed her into the swimming pool at her cousins wedding becuase of a bee. when she got out the cousin said a few inches more and it would have been the cake",
    "5dd5fe643558225b7c9f2857": "My best friend pushed me into a swimming pool at a wedding. This was because a bee was flying near me as my aunt gave me  a drink. She pushed me and I fell in, I came up gasping for air. I dried off and my friend just said I barely missed the wedding cake.",
    "5c129cc7ba99dc0001f0b628": "at cousin's wedding posh hotel.  Got handed a glass of champagne by aunt.  Best friend sees a bee close to her face- gives her a gentle tap- pushed her into the pool.  Soaked - lovely dress ruined - friend laughing- had to get out of the wet dress- cousin said - a few inches more and you'd have landed on the cake",
    "5eb3138319f0500f2004d2e9": "The cousin pushed her into the pond at a wedding to get her away from a bee she narrowly missed the cake and her dress was ruined",
    "5f901c39da08ae0598da82d5": "My best friend pushed me into the pool. It was at my cousin's wedding reception and everyone was dressed to impress. She did it to save me from a bee. My aunt had just given me a glass of champagne and I told her to be careful. Sometimes friend don't think and she gave me a little shove and I fell into the pool. My friend just laughed. The first thing to do was get out and get dry. My cousin laughed and said if I had fallen a little further I would have landed on the cake.",
    "5e25ca0e637b4103e19e7168": "The person was at their cousins wedding and got pushed into the pool. The friend spotted a bee by their mouth so tried to push the person away from it but pushed them into the pool instead ",
    "5e08848505620518fcdde6f2": "She was at her cousins wedding when she was pushed into the pool by her best friend as she’d seen a bee near her face. It was a fancy hotel. When she resurfaced gasping for air her best friend was laughing and apologised profusely. Her dress was ruined but she dried herself off. He cousin said any closer and she’d of landed on the cake ",
    "5e3589f0f4429c52b06eb457": "At a cousins wedding reception, a female friend pushed me into the pool triggered by seeing a bee near my face in the fancy hotel garden. I had just been passed a glass of champagne by my aunty as well. Everyone was dressed to impress and when I resurfaced gasping for air, my friend laughed and apologised profusely while my cousin whose wedding it was, commented on how close I came to knocking over the wedding cake",
    "5f54b7bc649418811db24711": "they fell into a pool during a wedding reception. their friend saw a bee and tried to stop her from being stung. They fell into the waterm and when they got out gasping for air, they apologised, and the cousin said a few inches more and they'd have landed on the cake",
    "5f65597823696e0e9bd8f63a": "My  best friend pushed me into the water at my cousin's wedding receiption.  She did this because there was a bee near my face and she was afraid I'd get stung.  My aunt handed me a glass of champagne.  My dress was ruined.  My friend laughed.  As I was getting out and dried off, my cousin said another couple of inches and I'd fall into the cake.",
    "5a775b638fe2dc00010579b2": "At a wedding reception and friend pushed me into a pond because a bee was near my face. Was only a little push. I had just been handed a glass of champagne by my aunt. My friend was laughing at me as I got out to dry and said a little further and you'd have landed in the cake. "
  },
  "segmentation": "1. My best friend pushed me into the pool.\n2. This happened during my cousin's wedding reception,\n3. where everyone was dressed to impress.\n4. And the reason it happened,\n5. she spotted a bee hovering near my face,\n6. - this was at a fancy hotel garden -\n7. and she tried to save me from being stung.\n8. And my aunt had just handed me a glass of champagne,\n9. and I warned her to be careful.\n10. 'Course friends, y'know, they don't always think things through.\n11. So that's when she gave me a little shove,\n12. and I tumbled into the water.\n13. When I resurfaced, gasping for air,\n14. she just started laughing,\n15. and she apologized profusely.\n16. And... my beautiful dress was ruined,\n17. and naturally, the first thing to do was to get out and dry off,\n18. and my cousin just says, \"Just about a few inches more,\" she says, \"and you'd have landed on the cake.\"",
  "recalls segmented": {
    "5ea1bd7e16a0c70919660653": "1. During a wedding\n2. a lady was pushed into a swimming pool\n3. by her aunt\n4. as a bee was close to her.\n5. She nearly fell\n6. on the wedding cake.",
    "5d10fa2bbfbf0a000133594b": "1. My cousin pushed me into the pool\n2. at my cousins wedding.\n3. She pushed me in\n4. as there was a bee.\n5. My auntie told me to be aware of friends,\n6. as they don’t always think things through.\n7. Then she gave me a little shove.\n8. I landed in the pool,\n9. then the next thing to do was get out\n10. and dry off,\n11. but my beautiful dress was ruined.\n12. My cousin started laughing,\n13. and said,\n14. a couple more inches,\n15. and you would have landed in the cake.",
    "5a3ee0d22f91ec0001dca78d": "1. My best friend pushed me into the swimming pool\n2. at my cousins wedding.\n3. She was trying to avoid me being stung\n4. when a bee landed near my face.\n5. My Aunt said that's what best friends do.\n6. When I resurfaced\n7. my friend burst into laughter.\n8. My cousin said\n9. if I had a fallen a little further\n10. a few inches\n11. it would be been on the cake.",
    "62b6cb277460cccbc8f27ad5": "1. SHE WAS AT HER BEST FRIENDS WEDDING\n2. WHEN HER COUSIN TRIED TO SWIPE AWAY A BEE\n3. WHEN SHE ACCIDENTLY PUSHED HER IN TO THE POND,\n4. SHE WAS HOLDING A GLASS OF CHAMPAGNE\n5. HER AUNT HAD GIVEN HER,\n6. HER COUSIN JUST LAUGHED\n7. ONCE SHE GOT OUT AND DRY,\n8. SHE APOLOGISED\n9. AND SAID GOOD JOB YOU DIDNT FALL INTO THE CAKE",
    "589f019c69733b0001af54df": "1. My best friend pushed me in to the pool.\n2. This happened during a friends wedding reception.\n3. I had just been given a glass of champagne.\n4. A bee came along.\n5. She tried to prevent me from getting stung.\n6. She just gave me a little push.\n7. I fell into the pool.\n8. I ruined my new dress.\n9. My aunt said, \"just a few more inches and I would have fallen on the cake.\"",
    "5a7c5a98eea3d300016e1d1e": "1. girl was pushed into the pool\n2. at her cousins wedding\n3. by her best friend\n4. because there was a bee next to her.\n5. she apologised\n6. but the dress was ruined.",
    "575ef812a2ce6e000666f239": "1. Person pushed into the pool by a friend during her aunt's wedding reception,\n2. friend saying something about a bee.\n3. Person climbs out of the pool in her wet dress to dry off.\n4. Relative makes a joke about another few inches and landing on the cake.",
    "6171b613293370249f437607": "1. Her best friend pushed her into the swimming pool\n2. because of a bee,\n3. while they were at her cousins wedding\n4. at a hotel.\n5. She got out\n6. and dried off,\n7. but her dress was ruined.\n8. She missed the cake\n9. by a few inches.",
    "60ad65a0a187d7ef811ed7e6": "1. A lady and her best friend attended her cousin's wedding at a beautiful hotel garden.\n2. The friend pushed the lady in the near by pool.\n3. (This was done) to prevent her from being stung by a bee.\n4. (This happened) just moments after the lady's aunt has handed her a glass of champagne.\n5. As she resurfaced and gasped for air, the friend started laughing.\n6. (The friend started) apologizing for her actions.\n7. (The friend was) explaining why she pushed her in the pool.\n8. Though the lady was worried about her dress being ruined, the cousin then told her she was inches away from landing on the wedding cake.",
    "5f37748da58054204f5b433a": "1. Was sitting by the edge of the pool at a wedding.\n2. Had a glass of champagne from your aunt.\n3. A bee was flying in front of your face,\n4. and your friend pushed you in the pool,\n5. claiming she was trying to save you from the bee.\n6. Your dress was ruined.\n7. And your friend laughed\n8. and said a few more inches\n9. and you would have landed on the cake.",
    "5f218e5462e3b6568de0f0e5": "1. It was her cousin's wedding\n2. and her friend had pushed her into the water.\n3. It was a fancy wedding\n4. where everyone dressed to impress.\n5. She had a glass of champagne.\n6. Her dress was ruined.\n7. When she went to gasp for air,\n8. someone says that she was very close to the landing on the cake.",
    "5f2dd11452744f1170ea3545": "",
    "602c64564ad77a557c5cc279": "1. I got pushed into a pool by my cousin,\n2. the reason it happened was there was a bee in a motel garden\n3. and my cousin pushed me to prevent me getting stung.\n4. I landed in the pool\n5. and the first thing to do was to dry off my beautiful dress.\n6. My cousin laughed\n7. and apologised profusely when I got out of the water.\n8. 'A few inches further and you've have landed in the cake' she said.",
    "600dbc400c8bdf5900aa0cd5": "1. I got pushed into a river\n2. at my cousin's wedding,\n3. by my best friend\n4. who was trying to save me from a bee,\n5. I was handed a glass of champagne,\n6. we were all dressed to impress.",
    "5dc1978fdbf8200fe9537083": "1. My cousin pushed me into the pool.\n2. This was at my cousin's wedding\n3. and everyone was dressed to impress.\n4. There was a bee hovering close to my face\n5. and she just tried to warn me about.\n6. My aunt told her to be careful.\n7. That's when she gave a little shove\n8. and I tumbled into the pool.\n9. When I resurfaced she stared at me\n10. and then laughed.\n11. She apologized profusely\n12. and my beautiful dress was ruined.\n13. She said that with a few more inches\n14. I would have landed on the cake.",
    "596e5141fe061d00011e3984": "1. My best friend pushed into the pool.\n2. I was at my cousins wedding reception,\n3. everyone was dressed to impress.\n4. The reason was she saw a bee hovering above my head.\n5. My aunt had passed me a glass of champagne.\n6. Best friends dont always think things through\n7. and she gave me a little shove.\n8. My cousin said \"just a few inches further\n9. and you would have landed on the cake.\"",
    "58a89e40e6afe00001d36058": "1. At a wedding\n2. my friend gave me a small shove\n3. to protect me from a bee.\n4. Unfortunately\n5. I then fell into the swimming pool\n6. fully clothed in my smart dress.\n7. My cousin said\n8. I just missed flattening the wedding cake.",
    "5d416bd5af929100194e80e1": "1. A woman was at her cousin's wedding in a fancy hotel.\n2. Everyone was dressed to impress.\n3. Her Aunt handed her a glass of champagne.\n4. As she did a bee started to buzz around her head.\n5. Her best friend pushed her into the pool.\n6. (Her best friend was) trying to get the bee away.\n7. Her dress was ruined.\n8. Her Aunt laughed.\n9. Her Cousin said if she'd been a few inches more to the side, she'd have landed in the cake.",
    "5a9bec4c6475f900019ffb56": "1. My best friend pushed me into the pool\n2. at my brother's wedding.\n3. This was after my aunt had given me a glass of champagne.\n4. My friend, who had not thought it through,\n5. was trying to save me from a bee.\n6. My dress was ruined\n7. and as I got out and dried myself off,\n8. she laughed\n9. and apologised.\n10. If I had landed a foot more\n11. I would have not the cake.",
    "5c3f2e175fe5c60001ffc302": "1. My best friend pushed me into the water\n2. when we were at my cousins wedding.\n3. She saw a bee\n4. and pushed me\n5. to save me being stung.\n6. My aunt had just handed me a glass of champagne.\n7. I narrowly missed the wedding cake!\n8. My dress was ruined.\n9. My friend laughed\n10. but also apologised.",
    "5e4c4949d7a02705c4f70ebb": "1. Friend pushed me into water\n2. I was at my aunties wedding\n3. and she saw a bee\n4. and gave me a little shove\n5. to save me from being stung\n6. and when I came up gasping for air\n7. she laughed\n8. and apologized profusely\n9. my beautiful dress was ruined",
    "5c714e3c21beb1000181bc74": "1. My best friend pushed me into the pool\n2. this was at my cousin wedding Reception\n3. where my aunt nearly got stung by a bee\n4. my dress was ruined\n5. and my friend apologised profusely",
    "60a520c051c98eb480c2811f": "1. My best friend pushed me in the pool,\n2. we were at my cousin's wedding at a hotel.\n3. Everyone was dressed to impress.\n4. My best friend had seen a bee hovering close to my face\n5. and decided to save me from it,\n6. my aunt had just handed me a glass of champagne at that moment.\n7. My friend gave me a little nudge\n8. and I fell into the pool.\n9. When I submerged my friend was laughing at me,\n10. my beautiful dress was ruined.\n11. She continued to say \"just a few more inches you would have landed on the cake\".",
    "599dacb43c7d1a0001deef97": "1. a girls friend\n2. pushed her\n3. into a pool\n4. at a wedding reception\n5. in a fancy hotel.",
    "5e93641d8028056ac36b16d9": "1. During my cousin's wedding reception,\n2. my best friend pushed me into the pool\n3. to save me from a bee.\n4. I resurfaced,\n5. my dress ruined,\n6. and my cousin jokingly mentioned\n7. I almost landed on the cake.",
    "5ca345b1506fca0016b358bb": "1. My best friend pushed me into the pool\n2. at my cousin's wedding\n3. which was at a posh hotel.\n4. She said\n5. it was because there was a bee near my eye\n6. and she didn't want me to get stung.\n7. I was wearing a lovely dress,\n8. everyone was dressed to impress.\n9. My aunt had just handed me a glass of champagne.\n10. When I surfaced, spluttering,\n11. I wanted to get out of the pool\n12. and dry off.\n13. My friend just laughed\n14. and said I could have landed in the cake.",
    "606c1958e66bcbfde2156006": "1. My best friend pushed me into a pool.\n2. Dressed to impress at her cousins wedding.\n3. Best friend pushed her into the pool as there was a bee hovering above her head.\n4. It was a fancy hotel.\n5. Her aunt had just handed her a glass of champagne.\n6. She said to be careful.\n7. Her friend gave her a small nudge.\n8. She stumbled into the pool.\n9. Naturally her friend just laughed.\n10. But apologised profusely.\n11. Beautiful dress was ruined.\n12. Natural instinct was to get out and dry off.\n13. But her cousin said, a few more steps.\n14. And you would have fallen in the cake.",
    "6070a06a1d49fbecb9ee79d2": "1. Someone was at a wedding.\n2. She was standing outside in the garden,\n3. holding a glass of wine\n4. when she was pushed into a water fountain.\n5. Her friend spotted a bee close by\n6. and pushed her into the water\n7. to save her.\n8. Her dress was ruined\n9. and she very nearly fell on the wedding cake.",
    "62ea45c78e38d6b93c10a235": "1. My best friend pushed me into a pool.\n2. It was at my cousin's wedding where everyone was dressed to impress.\n3. It was in the garden of a fancy hotel.\n4. My aunt had just passed me a glass of champagne.\n5. My friend did it because she spotted a bee.\n6. She didn't want me to get stung.\n7. I told her to be careful.\n8. But she didn't think things through.\n9. She gave me a little shove.\n10. I fell into the pool.\n11. I ruined my dress.\n12. She just started laughing.\n13. She apologised.\n14. I got out.\n15. I had to dry myself off.\n16. My cousin said that if I'd have fallen a few more inches.\n17. I'd have landed in the cake.",
    "5d11dd0790265e00019ba937": "1. My best friend pushed me into the pool at a wedding.\n2. There was a bee near my face.\n3. Everyone was dressed to impress.\n4. My mother had a glass of champagne.\n5. I nearly landed on the cake.\n6. Missed it by a few inches.",
    "62fca9ec379f4b6707aaef85": "1. A woman’s best friend pushed her into a pool\n2. which was during her cousins wedding reception\n3. because she seen a bee near her face\n4. and tried to save her from being stung.\n5. She was given a glass of champagne.\n6. The cousin found it funny\n7. and laughed whilst also apologising profusely.\n8. Everyone was dressed up\n9. as it was a fancy hotel garden\n10. and her dress was ruined from being wet\n11. and she got out\n12. and dried off.",
    "6099089783231a811aee3ad3": "1. My best friend pushed me into the pool.\n2. This happened at my cousin's wedding,\n3. where everyone was dressed to impress.\n4. She did this because she spotted a bee,\n5. hovering near my face -\n6. and she tried to save me from being stung.\n7. While being handed a glass of champagne carefully.\n8. She warned me\n9. and gave me a little shove\n10. and I fell into the water.\n11. I gasped for air\n12. and she started laughing.\n13. My beautiful dress was ruined.\n14. My cousin said that if it was a few more inches,\n15. I would have landed on the cake.",
    "6147724c13bb365774e24af1": "1. My best friend pushed me into a pool.\n2. How it happened was,\n3. we were at my cousin's wedding,\n4. and my friend saw a bee hovering near me.\n5. My aunt had just handed me a glass of champagne\n6. and you know how friends are,\n7. she just started laughing.\n8. My dress was ruined\n9. and my cousin said \"a few more inches\"\n10. she said \"and you would have landed in the cake\".",
    "5f4f92a3ef108806270215c9": "1. They are at a wedding reception\n2. and the protagonist is shoved into the pool\n3. because there's a bee.\n4. She gets out of the pool,\n5. dries off\n6. and the cousin is glad\n7. she didn't fall on to the cake.",
    "5af29f9c0eca060001b153bd": "1. A girl's best friend pushed her into the pool\n2. at her cousin's wedding reception\n3. where everyone was dressed to impress.\n4. The reason she pushed her into the pool was because she saw a bee flying near her head\n5. and didn't want her to get stung.\n6. And so she shoved her into the pool.\n7. The girl's Aunt has also just handed her a glass of champagne.\n8. When the girl came to the surface,\n9. her friend just started laughing.\n10. Her dress was ruined.\n11. She said a few inches further\n12. and she would have landed in the cake!",
    "571a3f73c97ad400083a2ea0": "1. A woman’s best friend pushed her into the pool\n2. while she was holding a glass of champagne\n3. because she said a bee was hovering around her face.\n4. When she got out\n5. with her fancy dress all ruined\n6. her friend laughed hysterically\n7. and said a few more inches\n8. and she would have ruined the wedding cake.",
    "615f4e20d504f648ffd22972": "1. My cousin pushed me into a pool.\n2. This was at a wedding.\n3. It was because of a bee.\n4. She'd seen it hovering near me\n5. and wanted to save me.\n6. My aunty had just passed me a glass of champagne.\n7. I said 'be careful,'\n8. but y'know,\n9. people aren't always.\n10. Then she pushed me into the water.\n11. My beautiful dress was ruined.\n12. She just laughed\n13. and said 'a couple of inches to the left and you'd have landed in the cake,'.",
    "60be17bce1456e0796cde161": "",
    "64730850e5f4a7b6b71fc40a": "1. Wedding at a posh hotel,\n2. the girl in question was just handed a glass of champagne by her aunt\n3. and then her cousin saw a bee near her\n4. and decided to help her\n5. by moving her out of the way of the bee\n6. and in doing so she fell into the pool.\n7. Came up gasping for breathing\n8. her lovely dressed soaked\n9. and her cousin was laughing.\n10. If she had falling a few inches to the side\n11. she would have landed in the wedding cake.",
    "60205f5ba5fe0165fa0e5e01": "1. My cousin pushed me into a pool\n2. at my sister's wedding reception\n3. where everyone was dressed to impress.\n4. Then when i resurfaced\n5. she laughed at me\n6. and said\n7. that if i were pushed a little to the right or to the left\n8. i would have landed on the cake.",
    "631b32b0796f2941b55e7d58": "1. My best friend pushed me into the pool\n2. at my cousins wedding\n3. because a bee was hovering around my face.\n4. My aunt handed me a glass of champagne\n5. and told me to be careful.\n6. My friend started laughing\n7. and the first thing I did was get out\n8. and dry off.\n9. My cousin said that a few inches closer\n10. and I would have fell into the cake.",
    "603f6ea3c439b514c173633d": "1. A girl was going to a wedding\n2. where she met her cousin\n3. and the cousin said something\n4. or spilled champagne over him\n5. and he needed to dry out\n6. and he said something to her\n7. at the end\n8. a few more inches left.",
    "5f60a56c328d6f05ede09874": "1. [pushed into pool]\n2. [by best friend]\n3. [at a wedding reception.]\n4. [saw a bee near her face]\n5. [and tried to save her from being stung.]\n6. [fell a few inches from the cake.]\n7. [dressed to impress,]\n8. [yet the dress was ruined.]\n9. [wedding was at a fancy hotel garden.]",
    "6083ba6abe81fe3fc3c6095f": "1. Invited to cousin's wedding.\n2. Friend pushed her in a lake.\n3. As did not think things through.\n4. Dress ruined.\n5. Few inches more.\n6. And would have landed on the cake.",
    "5e72ad1027f38a1fced5bf6f": "1. This story was about a fancy wedding\n2. at which the storyteller was pushed into a pool by their friend\n3. because of a bee.\n4. Their dress was ruined\n5. and their aunt made a funny remark\n6. at the end.",
    "5cc3289b9e21e200015f0bb3": "1. her friend pushed her into the swimming pool\n2. at her cousins wedding\n3. because of a bee.\n4. when she got out\n5. the cousin said\n6. a few inches more\n7. and it would have been the cake.",
    "5dd5fe643558225b7c9f2857": "1. My best friend pushed me into a swimming pool at a wedding.\n2. This was because a bee was flying near me\n3. as my aunt gave me a drink.\n4. She pushed me\n5. and I fell in,\n6. I came up gasping for air.\n7. I dried off\n8. and my friend just said\n9. I barely missed the wedding cake.",
    "5c129cc7ba99dc0001f0b628": "1. at cousin's wedding posh hotel.\n2. Got handed a glass of champagne by aunt.\n3. Best friend sees a bee close to her face.\n4. gives her a gentle tap.\n5. pushed her into the pool.\n6. Soaked.\n7. lovely dress ruined.\n8. friend laughing.\n9. had to get out of the wet dress.\n10. cousin said.\n11. a few inches more and you'd have landed on the cake.",
    "5eb3138319f0500f2004d2e9": "1. The cousin pushed her into the pond at a wedding\n2. to get her away from a bee\n3. she narrowly missed the cake\n4. and her dress was ruined",
    "5f901c39da08ae0598da82d5": "1. My best friend pushed me into the pool.\n2. It was at my cousin's wedding reception\n3. and everyone was dressed to impress.\n4. She did it to save me from a bee.\n5. My aunt had just given me a glass of champagne\n6. and I told her to be careful.\n7. Sometimes friends don't think\n8. and she gave me a little shove\n9. and I fell into the pool.\n10. My friend just laughed.\n11. The first thing to do was get out\n12. and get dry.\n13. My cousin laughed\n14. and said if I had fallen a little further\n15. I would have landed on the cake.",
    "5e25ca0e637b4103e19e7168": "1. The person was at their cousins wedding\n2. and got pushed into the pool.\n3. The friend spotted a bee by their mouth\n4. so tried to push the person away from it\n5. but pushed them into the pool instead.",
    "5e08848505620518fcdde6f2": "1. She was at her cousins wedding\n2. when she was pushed into the pool by her best friend\n3. as she’d seen a bee near her face.\n4. It was a fancy hotel.\n5. When she resurfaced gasping for air\n6. her best friend was laughing\n7. and apologised profusely.\n8. Her dress was ruined\n9. but she dried herself off.\n10. He cousin said any closer\n11. and she’d of landed on the cake.",
    "5e3589f0f4429c52b06eb457": "1. At a cousins wedding reception,\n2. a female friend pushed me into the pool\n3. triggered by seeing a bee near my face\n4. in the fancy hotel garden.\n5. I had just been passed a glass of champagne by my aunty as well.\n6. Everyone was dressed to impress\n7. and when I resurfaced gasping for air,\n8. my friend laughed\n9. and apologised profusely\n10. while my cousin whose wedding it was,\n11. commented on how close I came to knocking over the wedding cake.",
    "5f54b7bc649418811db24711": "1. they fell into a pool\n2. during a wedding reception.\n3. their friend saw a bee\n4. and tried to stop her from being stung.\n5. They fell into the water\n6. and when they got out gasping for air,\n7. they apologised,\n8. and the cousin said\n9. a few inches more\n10. and they'd have landed on the cake.",
    "5f65597823696e0e9bd8f63a": "1. My best friend pushed me into the water\n2. at my cousin's wedding reception.\n3. She did this\n4. because there was a bee near my face\n5. and she was afraid I'd get stung.\n6. My aunt handed me a glass of champagne.\n7. My dress was ruined.\n8. My friend laughed.\n9. As I was getting out\n10. and dried off,\n11. my cousin said\n12. another couple of inches\n13. and I'd fall into the cake.",
    "5a775b638fe2dc00010579b2": "1. At a wedding reception\n2. and friend pushed me into a pond\n3. because a bee was near my face.\n4. Was only a little push.\n5. I had just been handed a glass of champagne by my aunt.\n6. My friend was laughing at me\n7. as I got out to dry\n8. and said a little further\n9. and you'd have landed in the cake."
  }
}