{
  "narrative": "We moved down to Third and uh Wharton. We had gotten moved but it was like – you remember I told you my father drank but it was still day and after he had gotten in and put the furniture where it was supposed to go my mother left to go to market to get some food to bring into the house. And my father went to take the horses – take the team of horses back. But he didn't come home. He – uh – I stopped somewhere on – I dunno but he – that's where – how he – why he wasn't in the house. And of course I was left there with the kids. Well no sooner did my mother get out of the house – my father went first – then – oh it was such an awful crash came through the window. And I – and I looked and it was a big stone. And then of course they – they – well they stoned the house. And I had sense enough to get the kids into the stairway so that they wouldn't get hurt by flyin' gla- glass. And I said to them “Now you stay there. Don't move 'cause nothing will reach you here. And I'm gonna go and see if I can find mom” – (We call our mother mom.) And they were crying and carryin' on. I was scared to death I really was frightened out of my wits. And I didn't know what to do but I remember saying a prayer as I went out the front door because I didn't know what was gonna hit me when I went out that door. And I ran – I was ten years old at the time this happened – I ran to Fourth street because I knew my mother wa- They had push carts in those days on Fourth street. And it was a Jewish neighborhood and they – they stayed open until – until all hours. Because they would you know however much money they could get they wanted. So uh that's where she was going to do her shopping. And I finally found my mother. I did find her. And while I was trying to tell her what had happened a policeman went by. And my voice was such that you could hardly make out what I was saying. I was so nervous and – and – my voice was shaking so and he wanted to find out what ha- what was wrong with me. And then when he understood what the situation was he turned to my mother and says “This is a bad neighborhood. It's Irish.” And he said “Th- they're known to do things like that Better move out of there.” My mother said “I just moved in how am I gonna move out?” He says “I dunno.” He says “But they don't want any black people in there.” An' he didn't say black 'cause they didn't use black then. But “they don't want anybody in there.” So uh she said “Well you're the law. You're supposed to protect us.” He says “I can't do anything with it.” He was Irish himself. “I can't do anything about it.” So my mother said um “Where is the uh precinct you work from?” And he told her. I forgot now. I was right there with her but I've forgotten where he told her. So uh she said “Well if you can't do anything to help me I'll go see who – if I can't find someone else to help me.” Well in those days black people were so cowed by circumstances an' uniforms an' – an' – an' white people you know they uh many times didn't assert themselves. But thankfully my mother was not one of those kind. And uh she – well I always thought of her as an educated person which she was because she was the only one I knew who had completed high school. She went to Lackawanna uh high school. And uh this was – let me see what year was this happening – well it must have been nineteen twenty-five so you can see what – what the times were. And we went – she took me and we went to the police station. And they also had police wagons with horses attached to them. Believe it or not in those days. [break in the recording] So my mother said to the captain “What are you going to do about it?” And he says “Well lady there's nothing we can do about it.” And she says “You mean to tell me that I have to live under those circumstances and there's nothing that you can do about it?” She says – he says “Well uh uh the only thing I can tell you to do is to move.” He says “Because” – uh he said to me “Did you see anyone?” And I said “No.” He says “Well how can – how can you” – to my mother – “how can you do anything if you don't know who – who to put the blame on?” An' he says “I'm sure there was more than uh than one person.” So my mother said “Well I don't know what I'm going to do.” She says “But one thing I know I'm not going to do is move. Because I have no money to move with.” They took all we had to to pay the rent. In that house you had to pay uh in advance. And she said “If they didn't want me there they should not have rented the house to me. Now the real estate agent should be accountable.” So anyhow she said to him “Well I know one thing you can do.” And he says “What's that?” She says “You can take me home.” He said “Take you home?” She said “Yes in the police patrol.” So – I-I guess they figured “Let's get this lady out of here because she's talking loud and long.” And they had never come up with anybody like that. So they put us in the police patrol and they took us home. We weren't far from from – from where it was – maybe Fifth street – from where we had moved. And uh – course with the horses and the police patrol and the clang – they had a bell that clanged. Clang clang clang – you know they told you about the trolley that went “Clang.” Well this police patrol that bell they had it went “Clang clang clang.” And um all the neighbors came running out to see what was happening. And of course they saw the man came around the back – I can r- see it right now – from where he was sitting up front there where the horses came around and opened the door in the back. And they had a long door in the back where you had to come down steps to get out the back of the – of this police patrol. Well we got out of that police patrol – Before the patrol ever left my mother turned and faced all those people that were standing around and she says “Why you're doing this to me I don't know.” She says “I know that I am different from you color wise but in every other respect I'm just the same as you are and all I'm trying to do is provide a home for my family.” She told them that they had rented the house she told them how much money she had paid she had told them that was all the money she had. And they had paid that rent for a month. She knew she was going to be there for the month. She did not know beyond the month. Whether they'd have enough mother – money to pay it for the next month. But she knew they were going to be there for for the month. She said “It is winter time and it is cold. And I cannot afford to be buying windows.” “Now” she said “Whoever threw the stones I don't know. But you can all see what has happened. And now I'm telling you that we're going to be here for a month. So you might just as well make up your mind to that. If you don't want me here then you people get together and give me enough money to move somewhere else. because I do not have it.” Well of course you know they didn't do that. They probably didn't have any money either. So in the meantime – not in the meantime but during during the period of time that we were there my father became sick. And the neighbors were as nice as anybody could ever have been. When there was trouble they responded just like anyone else. But that was our welcoming to the neighborhood. And it was terrible and it certainly was frightening for me.",
  "recalls": {
    "5fdb96141295b80008c31eb3": "This black family moved from a Jewish to an Irish neighbourhood. When they arrived someone stoned their windows. As the father was drunk, the narrator ran to find the Mum who they thought would know how to resolve the situation given her schooling at Lackanawny. The 'Mom' sought and found a policeman on the street. He said he would like to help but there was nothing he could do even though, or in spite of, he was Irish too. So they went to the station on 5th and explained the situation, how they had the windows stoned, how it would make their place unbearable in the cold of winter as they had no money to fix it; the police at the station also said there was nothing they could do but did offer her a ride back in the police wagon, a wagon still driven by horses even though it was 1925. They were thankful she accepted as she talked long and hard. Clang, Clang clang went the bells as they went down the street which caused all the neighbours to come onto the street upon the wagon's arrival to see what the fuss was about. The mother took the opportunity to explain to those gathered that she had used all the family money to pay a full months rent so she was staying the month, in these cold winter days she was, colour aside, just like them in that she wanted to put a roof over her children's head and if the locals didn't want them there because they were black then they'd have to provide the money for them to move on. Naturally, this didn't happen, as likely the locals were in the same financial predicament however after this episode they became much friendlier, helping out wherever possible in times of need such as when the drunken father became ill.",
    "6460f320e8ba103d47ded9d6": "A family moved into a house in a new neighbourhood. After they had moved in, the father took the horses away and the mother went shopping. While the narrator was at home with the other children, their house was attacked and stones were thrown through the window.  Once the narrator had hidden the children he went to find his mother at the Jewish shop, which stayed open late and served anyone. Once the shopkeeper had heard what had happened he told yhe mother that they lived in a bad neighbourhood and should leave. The mother said she couldn't leave because she had used all her money for the first month's rent. The mother went to the police to complain and they also told her to leave. It was an Irish neighbourhood in the 1920s and, because they were black, they would never fit in. The mother insisted the police drive her home. When she got home, she addressed the neighbours - explaining that she had no money to move and they were stuck with her for the month and better get used to the idea. After that the neighbours were much friendlier and even helped when the father got sick",
    "5c8cdc31745b370017d73ece": "The child was in the house when the parents were out. The father was drinking in the day time and the mother was out shopping in the market. They had just moved to a house on third street. the children were in the house when someone starting throwing rocks at the house. the person telling the story ran to find his mum. They spoke to a policeman who said he couldn't help and they would have to move. The mother said they could not move and asked where his precinct was. they went to the precinct and they said the same thing. The mother insisted they drive them back to the house where she told the rest of the neighbours that if they wanted them to move, they would have to give her the money to move. Nobody did. The father got sick and the neighbours were nice. ",
    "60479c2017ec4a044c2ed68f": "The story was about a family that just moved into a neighborhood. They were black and they had troubles with the people in the neighborhood who were throwing rocks at their windows. The child who was left at home was scared and tried to call his mother. But she did not answer, he waited until he thought it was safe and then came out of his hiding spot. His mother got home and he told her everything that happened. They then called the police, and the police told them that they could do nothing about it. They told them because they are black and this is an Irish neighborhood, they should just move out because the circumstances won't change. The mother was very smart from a very well known high school and told the policeman that she will not move because she does not have enough money. The police insisted on them moving. And she spent the whole time telling them that they don't have any money. The police then offered to take them home because they were tired of her speaking, as she was the first person who actually spoke out on the situation. As they were going out, there were people surrounding them telling them that they had to move out. And they mother said that in order for them to move out all of them had to come up with enough money for a month's rent as they had to pay for that house in advance and she does not have the money to move anywhere else. The story ends with the mother, saying that she will stay where she is and they have to accept that she is there because even if she is black, she is no different to them.",
    "612266e2ea3c172619abba50": "The family had recently moved house. The father wasn’t there and the mother had gone to the store when a window in the house was smashed by people in the neighbourhood. Even though the narrator was scared at what they would find outside, they left the house and tracked down the mother at the store. A policeman heard them tell what had happened and said it’s a neighbourhood of Irish people and they don’t want you there because you are black - he didn’t actually say the word black. This was in 1925 and the narrator was 10. The mother asked which precinct he worked from and they went there. She spoke to someone there who told her she was best to pack up and leave, which she couldn’t afford to do. She made them give a lift home with the police patrol and when they arrived she spoke to the crowd. She said you don’t want me here but I am paid for a month. If you want us out then you need to give us the money to go. Of course the neighbours didn’t. The mother was educated and had been to Lackawanna high school. Later then the dad was ill, the neighbours rallied round.",
    "60ad5baa456e511fb21ba8fb": "This is a story of a family that moved to a new neighbourhood and a ten year old is telling us how they were welcomed by a flock of people who threw stones in their house and broke windows. The ten year old was home alone with their young siblings whilst the mom was out to to some late night shopping in the jewish sho[s that opened until very late. The ten year old was faced with a challenge of calming their siblings down and ask them to hide ina place where they would not be hit by the stones. The ten year old later ran out to look for the mom, being careful not to be hit by the stones. They finally found the mom in the jewish stores and let her know what was happening. Whilst the ten year old was trying to tell their mom, they coul not breath or even utter the words properly because due to being frightened. There were police patrollers around who kind od understood what the ten year old was trying to say and they warned the mom about the are. The advised her to move to another area, as that area was not \"good for them\", and according to them people like them(blacks) were not welcomed in the area. The mother told the patol that there's no way that they can move because they had just moved in and paid rent, ad the people took their money. The mom insisted that the police help them and they told her that there's nothing they can do. She went to the station with them and asked them to take them hoe, which they did. Eventually the family felt accepted in the neghbourhood when their father fell ill, the neighbours came by to visit them and sent well wishes. This all happened withi the Irish community during arounf 1925.",
    "5e4e95ec6a0f23000c442ed2": "a black family move into a new neighbourhood the mother and father go out and leave the children in the house mom goes to get shopping in the Jewish area  the father probably out drinking. the house gets stoned the eldest child moves the younger ones into the stair area away from the windows so they wont get hurt with stones or glass he was very scared but he left the house to go look for his mom. He eventually finds her and tells her what has happened a passing policeman hears and says its a bad area and they should move Mom says she has paid rent and cant afford to move, the policeman says he cant help and no one wants black people there as its mainly an Irish area. the mom is an educated lady and says she will go to his station office for help. she gets them to take her home and tells the neighbours she is  there for a month with no money left to move so they will have to get used to it. Then the father gets sick and the neighbours are nice to them and help the family",
    "6116c9e9f3490c79002fda6e": "The day that she moved into Third and Wharton, when she was 10, her father left to return the team of horses and her mother went to do shopping on Fourth.  Some people began to throw stones through the windows of the house they had rented.  She took the other children into the stairway and told them to stay there because they would be safe from flyin' glass.  She left the house, and prayed, not knowing if they would throw things at them.  She found her mother shopping and explained what had happened.  A police officer came over and asked.  He said that the neighbourhood was bad and they were likely Irish.  He was also Irish.  He said he couldn't do anything. Her mother asked what precinct he was from and he told her, although the narrator didn't remember.  Likely on Fifth.  The captain was told the story and also said he couldn't do anything because the girl didn't see who threw the stones, and it was likely a number of people. Both the original police officer and captain suggested the family move out, because black people were not welcome there.  But her mother refused, as they didn't have any more money, having rented the home for one month with all their money.  She told the Captain to take them home in the Police Patrol, which had a clanging bell and was pulled by horses.  As they got home a crowd had gathered.  Her mother came out the long door in the back and confronted the crowd, saying that despite being a different colour she was the same as them and was staying at least a month, couldn't afford new windows, and if they wanted her to leave they had to give her enough money to go live somewhere else.  The crowd did not do so.  While they lived there, her father got sick, and the neighbours were very helpful and friendly.  But her welcome to the neighbourhood had been terrifying.",
    "5bad47432b86390001ccda32": "Something about a black woman who was being attacked in her own home with a brick through the window, she went to the police and they told her there was nothing they could do. He told her to move, she said i can't afford to move as i have no money. \n\nI dont remember anymore of the story sorry",
    "6466249c27b5e4161f763c32": "The story was about a women who was trying to live in an apartment. When she was trying to pay the rent the owner didn't like her cause she was black. There was some type of altercation and the police were involved .",
    "56c9e4d9b30699000bd974a5": "A boy tells a story about bein 10 years old. At this time he and his family have just moved to the area. He is looking after younger siblings - the father is a drunk and the mother is at market. Stones are thrown through their windows. The boy is able to get his younger siblings to safety away from broken glass deeper inside the house. He goes to find his mother at the market but at the market meets a policeman. He explains the situation and we learn that it was a racially motivated attack. The mother complains to the police about not being able to protect them. She then gets a lift home from the police and lambasts her neighbours. They come to accept her but the father of the family grows ill.",
    "63780dcb8171e255fe423b28": "It was 1925 the person who was telling the story was 10 years old. The father was a drunk. When mother (mom) went to the market on fourth street for food a stone was thrown through the window of the house they were renting. 10 year old who was looking after the kids put them in the stairwell to keep them safe while he / she went to look for the mother. Mother was found and before he/she could speak to her a policeman asked what was wrong. When he explained the policeman said it was an Irish neighbourhood and they did not like blacks and there was nothing he could do to help. The mother was not happy with the response and went to the police station to ask for help. No help was given however she asked to be taken home in police patrol wagon with horses which the police did. Bells on the horses alerted their neighbours in their street - fifth street and came out to see what was happening mother explained about the stone through the window . She explained she could not move out as she had no money as she had spent it on months rent but if they wanted the family to move they could pay their rent for somewhere else. Neighbours could not afford to do this. The father got sick and the neighbours helped the family. The 10 year old was very terrified and scared by the experience. ",
    "6362aa281270ea7fc6656dc7": "The dad was a drunk , he took the horses out one day and never come back.. the house the mother and children moved to was targeted because of her skin colour. Mum was out one day and children was in the house and there was a loud bang, someone had thrown a stone through the window, the oldest child ( I think) got the kids into the hall way and told them to stay there while she went to find mum at the shops. There was glass everywhere. The people had take all the money from the house so she had no money left to afffordbto fix the window. When the oldest child found mum at the shops she couldn’t explain what had happened but at the time a police officer was near by so they explained what had happened he said nothing they can do, they advised her to move as the itish clearly didn’t want them there because of there skin colour, the officer was Irish himself, the mom wasn’t happy with this response and wanted to take it further so she headed to the police station, although they told her exactly the same thing, mum expressed it they want her to leave they can give her the money to do so… this didn’t happen so she had to stay there. The police give her a lift home as mum requested. ",
    "5d72162aef8b6c00019e19a9": "They moved into a new home on third and Wharton, the mother went shopping and the father also left. the10 year old was left in charge of the younger siblings. The neighbours began stoning the house so the10 year old hid the other children in a safe place and went to look for the mother who was shopping in a Jewish shop. The daughter told her mum what happened in ear shot of a police officer who said he couldn’t do anything as they had moved into an Irish neighbourhood and they didn’t like black families moving in. Mum spoke to the neighbours and said she was just like them trying to provide for the family. She couldn5 afford new windows or to move elsewhere she said to the neighbours if they didn’t want her there they could do a whip round as she couldn’t afford to move. The neighbours eventually b3came helpful and helped when the father became I’ll",
    "5bc0941074e76c00019e9479": "This was a tale of a Neighbourhood incident that caused the windows to the property of a new tenant  Family to be broken - the rea was in an Irish enclave close to that of a Jewish community and although the mother of the family had reported the incident to the local Police, without the ability to name or identify the culprits there were no charges brought forward - The family was a Afro-American and living in a white Anglo-Irish American area but once the Mother had confronted the neighbours with her financial plight and her circumstances a sense of community provided support when the father of the family was sick",
    "60bbac6c8f57c38f1b834e80": "we had moved to third and Wharton. My mother went to the shops to get food for the family and my father had gone to fetch the team of horses. Then we heard a loud thunder and it was a stone so I told the kids to go under the stairways so that they could not get hurt and they cried and carrying on. I told them not to move but stay there as I needed to go and get my mother. I was so scared as I went to the door because I did not know what was gone be thrown at me as I opened the door. I went out run to the fourth  street it was not far from where we had moved to. I found my mother and the policemen passed by and I told him what had happened and he said he could not help us with anything. He said we should move but he insisted that he could not help us because they people in that area were Irish and did not want black people there. My mother said we should go to the police station to find someone who could help us but the officer in charge said he could not help us as well.so my mother asked the police officer to take us home with their cart which had a bell which goes clang clang clang. So when we approached our area everyone rushed outside to see when the door was opened for us a lot of people where standing outside and my mother addressed them. My mother told them how much we were charged for rent and said if they wanted us to move they can all contributed money so that we could move and no one contributed. From then there were nice to us  but the welcome was frightening. ",
    "5f4560c565e28d13e5dd5d56": "It's a story about a boy who recently moved to Third and Wharton with his mother. That day his father was drunk but he had put the furniture where it was supposed to be. His left to go to the market to get food that they would eat. His father took the horses but he didn't come back home. At that time the boy was left alone at home with the kids. People threw stones into the house through the windows. He took the kids to a safe place. The boy was scared and he took the phone to call his mother. He prayed for their safety.  The boy was ten years old when this happened. He ran to Fourth Street to look for his mother. It was a Jewish neighborhood. He found his mother on the way but couldn't talk as the police man appeared. The police man asked the mother's boy to move out of the neighborhood because it was dangerous, they don't want black people there. His mother refused and told him that they have just moved in. The police couldn't help his mother.",
    "5e283f576dbb560114ac7714": "We moved house down to fifth and Burnham. We started moving the furniture but my father said it would not all fit but we got it in. My father went to take back the horses after we finished with them. He had not returned so my mother went to look for him. In the meantime some people came and smashed the windows of the house with rocks but luckily none of us got hurt but after that I went to find my mama, she was near by. After that we made it to the local police and asked for help but they said that there was nothing that could be done as we had not seen anybody and didn't even know how many people there was. My mama ended up just asking for the police to take us home which they agreed to. When we got back all the local Irish community gathered round and then my mama spoke telling everybody that she might be black but she is just the same as everybody else in the area and she and her family were not going to move out as they had no money left. Everybody started to treat us as normal after that, even helping us out when my father was sick.",
    "5e13b302a2c6969f3c5d2485": "The child was at home when a brick was thrown through the house of the window scaring the other children in the house.\nThe parents were away from the house at the time and so the youngster left the house to find them.\nThe mother was shopping at the time and she asked for help from the police who were less than helpful, told her that as she was a Black family they were not welcome in what was an Irish area and told her to move.\nShe explained that she had just moved in and had done so using a real estate agent who had been happy to take her money and she now had no money with which to move.\nShe then insisted that they be taken home by the police patrol.\nUpon arriving at the house they were greeted by the neighbours who she assumed had thrown the brick. \nShe addressed them and explained that she could not afford to repair the windows and that winter was coming and requested a stop to this.\nShe told them that she had paid for a month and after that she wasn't sure of their plans unless they were going to pay to have her leave she was staying, so that was that!\nNot long after the father became ill and the neighbours were kind to them.\n\n\n",
    "60a2be69eb4d3bcbff354d5d": "We had just moved to Third and Warton. The neighborhood was Jewish. My mom had just went to the market so I stayed with the kids. I was ten years old at the time. Clang clang clang. The people in the community threw stones at our windows and they got broken so I searched high and low for my mother. When I had explained to her what happened she reported it to the police officer. The police officer said there's nothing much he can do. He suggested we move. But my mom told him that we had just moved from where we were staying and now we should move again because this community doesn't like the color of our skin. She told him that we are the same people just a different color of skin. She continued to tell him how she paid a month's rent so she's not moving. If these people want her to move they should give her money to do so because she doesn't have any. She also said that the agent should've not taken her money because she knows how this community will react to our family staying there. The police officer told my mom that the people of this community don't have money either and therefore can't give any to her so she can leave. My mom said she will stay the entire month because she paid for it. The community will have to accept them. ",
    "5fb402a66cba9801673f2b5c": "We were at third and wharton and father had gone out and mother had gone to the market to buy some food. I was in the house with the children and people started throwing rocks through the window and there was a big crash. I realised what was happening and put the children under the stairs to shelter there. Mother had gone to fourth street to buy food at the market. It was a jewish market and they were open all hours to make as much money as they could. I decided to go find her at the market, I didn't know what was going to happen when I got outside so I said a prayer and then ran all the way there. When I got there I found her and I was trying to tell her what happened but I was so upset my voice was such that she couldn't understand. While I was there a policeman walked by and stopped to see what was happening and we told him. Mother said what are you going to do about it and he said the only thing to do is to move. She said I'm not going to move because I only just moved there. He said it's an Irish neighbourhood and they dont want any black people there. Well he didn't say black, he just said they don't want anybody there. She asked him what precinct he is from to find someone else who would help us and he told us but I can't remember where it was. We went there and spoke to the captain and said what are you going to do about it and he said nothing and said you have to move, same as the other policeman. Mother said well I know one thing you can do and that is to take us home. The policeman took us back to the house from about 5th street and when we got there he got out and helped mother down from the door. All the people were there standing outside and she said to them you all know whats happened and I don't know who did it but I do know I'm not going to move. I just moved in here and spent all my money to rent this house for a month and don't have any more money. You might as well make up your minds that I will be here for this month and if you want me to move then you all can put your money together for me. It is winter and cold and I don't have any money to be buying windows. I don't even know if I will have enough money to stay here for another month. After that the neighbours we very friendly and my dad got sick while we were living there and everyone wanted to help us and was kind. That was my introduction to the neighbourhood and it was terrifying.",
    "5e9ffcf4db51941ad78e04f3": "We moved to Forth and Wharton. My father drank. He took the horses. My mother went to the shops and left me with then kids. Stones broke to windows and I took the kids somewhere safe and then went to get my mother. I was 10 years old and did not know if I would be hit. The shops were open late and I reach my mother. I could hardly tell her what happens my voice failed me. A policemen came and said that he could do nothing it was a bad neighbourhood Irish and they did not like black people. We should move out My mother who was educated and had finished High School said she had only just moved in and could not afford to move out. She wanted to know where precint was. The Captain she spoke to said that he could do nothing.  My mother said that one thing they could do is give us a lift home in a police wagon. We went back in a police wagon that went clank, clank clank pulled by horses.  When we got home my mother addressed the crowd saying that she had only just moved in and had paaid the rent so had nothing left.  If they want her to move out they should pay her rent. They did not do that.  Later my dad fell ill and the neighbours were really nice.",
    "60fe26abdb9284fdf954f6df": "We moved in to Third and Warton and not long after my dad got drunk and went out back to try and take the horses out. My mother had gone to the store to get some groceries on Fourth, not long after my mom, we call mother mom had gone to the store and my father had gone out - there was stones being thrown at our house, I quickly moved my siblings to hide under the stairwell, I told them \"Do not move because you will be safe here and no stone will hit you\". I was very frightened but prepared myself to go look for my mother, but was not sure what would happen immediately I stepped through the door and ran to Fourth as that's where the carts where being pushed, I looked for my mom and found her and while trying to explain what had happened, a police officer happened to pass by, so after I composed myself a bit, I explained to him what had happened and all he could say to my mother and I was \"You have to move\" the town is Irish, my mom being angry and asked how he could say something like that and explained we had only moved here recently and she doesn't have money to move again. The officer said he could not do anything as it sort of a norm here as we are black, he didn't say black because they didn't say that then but that's basically what he meant, the officer was Irish as well. My mom angrily asked for his station and to speak to the captain. We went over to the police station which wasn't too far from where we were, it was on Fifth. We entered and demanded to speak to the captain, we explained the situation and he basically said the same thing as the police officer. I was surprised and impressed by my mom, she stood her ground as she was more educated having gone to school in nineteen twenty-five. She explained to the captain that we have only moved here and have no money to go someplace else, and he said there was not much he could do as there was no one to blame, he also asked me if it was possible that there have been multiple people, which would make it harder to but the blame on someone. My mother suggested arresting the real estate agents as they sold the property to her despite knowing the situation in the town. My mother then said the least they could do was to drop off home and since the captain was tired of us being there because the conversation was long and loud he agreed. We went into the station patrol vehicle that had a bell attached to it and made a  \"Clang clang clang\" sound as we moved, during the journey, due to the bell a number of people came out of their homes to watch what was going on. When we reached our house, my mom turned to address the people watching, she said we had just moved here and paid money for rent for the month and that we were going to stay for the month and that after that she didn't know, she also told them apart from the colour of their skin they were all the same people and that they should get used to us being here. She also suggested that if they all really wanted us to leave they should donate money for the family to move somewhere else, which they didn't because they probably didn't have any money either. After that day, everyone seemed to be nicer and even when my dad was sick they helped and offered whatever they had just like anyone else would. It was all good but my first initially welcome to that area was terrible!",
    "5a86e1a4eea3d300016e7981": "The family had moved into a new neighbourhood and had paid the rent a month up front. The father had gone to tend to the horses and then some people came and threw stones at the house. The family were all afraid and so they fled. they asked for help in a Jewish neighbourhood and then were directed to a police station. The police were unhelpful initially and told the family the solution was to move. the mother explained that due to financial reasons this was impossible. She insisted that the police take them home and so they w=rode in the back of the police wagon with the bell clanging. They arrived home and climbed down the back steps of the wagon to be met by several neighbours watching. The mother gave an impassioned speech about how, despite their colour they were just the same as everyone else. This changed people's opinions and they then helped and supported the family even when the Father became ill. ",
    "5fcfc5d2efeec61409aa6cf7": "It happened in 1925. The narrator was 10. The father was day drinking and out of the house, after he'd moved their furniture into the house. The mother was out shopping. A rock crashed through the windows of the house. The children hid in the hallway to avoid the glass. The oldest of the children ran out of the house to Fourth Street, where the mother was. There, they found a policeman. He told them that this was a bad neighbourhood, and that they should move. He was Irish. The mother told him that they didn't have any money to move, and they had just moved into the house. He said there was nothing he could do. She was a smart black woman, the only one in her family to have finished high school. She asked where the nearest police station was, so that she could ask someone who would be able to do something. At the station, she got the same answer: that there was nothing to be done, except move. She then told them there was one thing they could do: to drive them home in the patrol car. They did. The car made such a clanging noise that all of their neighbours came out of their houses to see what was happening. When she got out of the police car, the mother announced to the neighbours that she knows she looks different due to having different skin colour, but that they could only afford to stay in the house a month. Perhaps they would get enough money to afford to stay another month, but in the meantime, the neighbours only had to put up with them for a month. She didn't know who threw the rock, she told them, but it was winter and it was cold, and she couldn't afford new windows. She said that she had no money to move right away, but if they wanted, the neighbours could give her the money to move. They didn't do that, but afterwards, when the father got sick, they were kind and courteous to the family.",
    "5f6c238ed9915e19408f161b": "A black family moved to an all white neighbourhood and someone through a stone through their window in protest. The mother went to the police station to complain but they didn't want to do anything since it was a white irish neighbourhood. The mother was upset after paying a month's rent, knowing she and her family would have to stay so she told the police to escort her home so the neighbours would all come out to see her with the police (there was a loud bell attached to the police wagon so all neighbours heard it and came outside to watch) When the neighbors were outside the Mom announced that she had no money to move so the neighbours could give her money to move or put up with them. In the end the neighbours came around even being there for the family when the Dad got sick, but it was a scary beginning to moving into the white neighbourhood for this black family ",
    "5c4f30828f1259000172240d": "The story is about a ten year old child in a Black family in 1925. One day they come home, and after their parents go out (their father to fetch some horses, their mother to shop at the local Jewish market which stays open late), someone throws a stone through the window of their home, smashing the glass and scaring the child and their siblings. They go to find their mother, and encounter a policeman. The child and their mother complain to the policeman about what happens; the policeman blames the Irish neighbourhood, being Irish himself, and attributes it to them not wanting Black neighbours. He says he can't do anything about it, so the mother insists on attending his precinct, and speaking to his captain. The captain also claims not to be able to help, so the mother asks him to drive them home in the patrol vehicle. They're dropped off near their home, the noise of the vehicle draws out their neighbours, and she addresses them all, telling them that if they don't want her and her family there, they should pay for them to move house, as she can't afford it, and will be there for at least a month. Thereafter, the neighbours are kind to them, especially when the child's father is sick, but the child holds onto the memory of that frightening welcome to the neighbourhood.",
    "5c6088630112a60001a2b1e7": "A man is recalling a time when, as a ten year old, having just moved to a new rental unit in an Irish neighborhood. He's alone and his mom is at the market and stones start to fly through the windows. He hides his siblings under the stairs and runs out to the market to find his mother. She approaches a police officer who tells her that black people aren't welcome in Irish neighborhoods, and that there's nothing he can do. She tells him that she will go to the precinct and find someone who can help. The man recalls her mother as being unusual among black people of the time in that she was not afraid to confront authority or people in uniforms. When she talks to the police chief at the precinct he repeats the same advice- to move and that he can't help her as she hasn't identified the suspect. She tells him all her money has gone to rent and she can't afford to move. She asks for a ride home, and the officer agrees. She confronts her neighbors, tells them she's paid for a month and can't afford to move anywhere else, and that she will not be moving, and can't afford new windows. She reminds the neighborhood that she's fundamentally the same as them despite her difference in color- that she's trying to look after her family and make ends meet.",
    "5f933255e25f2b0e6f794a54": "A family moved into an area that I presume to be white.  They were a family of colour. There were horses involved at the start of the story. Their house, which was rented, was damaged by stones - which they didn't have the money to fix. They had enough money for one month, paid in advance. After being brought home my police, the family confronted the neighbours who were watching their return and stated that if they were not wanted in the neighbourhood, they could all scrape together some cash for them to move. This didn't happen, and while they were living in the property the father became sick and all the neighbours were nice to them.",
    "60a2df32808ac76c056b37b9": "A black family moved into an Irish neighborhood. While they were moving their stuff in the house, Th mother decided to go buy food at a store while the children stayed with the dad. While the dad was busy with the horses and packages the children had a crash. Someone was throwing stones at their house. The older child quickly ran with the younger children and hid them and told them to stay there as it was safe from glasses and them being hurt. The older boy was very frightened but he bravely went out to go look for his mother. He knew his mom went to a local shop at long street that opens for long hours to get maximum profit. When he got there he tried explaining to his mom what happened when a policeman noticed the commotion. He went to them and asked what the matter was. The child explained everything and the policeman told him there's nothing they could do as it is an Irish neighborhood. He also told her that they would not even know who to put the blame on s they didn't know who threw the stone. He told him the best thing he thins they should do is  move out. The mother was upset and told the man he is not going to do that because she used the last money she had on paying rent . The mother asked the policeman to be taken home and the man escorted them back home. When they got home they found a crowd facing her house. When they were heading to their new place the mom faced the crowd and told them she has nowhere else to go and has no money to move out but if they had money they can contribute to move them out. She told them she is just as the same as them besides the color of her skin and it should not matter. During their time there the father got sick and the neighborhood was extremely nice but the child still remembers the first day as very frightening.",
    "5ea166af93435d0008a8a341": "We moved to Lackton on fourth street. Well, my father was a drunk and went out. Them my mum went out too and I was looking after the kids. Then there was a mighty crash and a brick came through the window. I didnt know where my mom was, I was only 10, but I guess she had gone shopping in the Fifth. it's a Jewish quarter and they stay open all hours, you know, to make money. I found my mom and told her what had happened. She found a policeman, who was Irish, and said that the Irish were dangerous and he couldnt do anything. My mom asked him to take her to the police station where they still had wagons pulled by horses. She found the commissioner who asked her if I'd seen who dunnit. I hadn't and he said there was nothing he could do. They don't like black people round here. My mom was strong and didn't accept that. She told the commissioner to take her home in the police wagon.When they got back to fourth street she stood on the steps of the wagon and said 'Look here I've paid my rent for a month, its all we have and we are not moving. If you want us to move then give us a months rent'. They didnt have any money either. Then dad came back and became sick. They were nice to him and cared for him. ",
    "62d7e6e7eb53424768b99d3b": "girl aged 10 moved to 3rd & warton with her mother , father & kids presumably the siblings . Father drank . As soon as they had moved in the mother went to a shop , the father went out . A crash sounded &  a big stone came through the window ~I moved the kids and told them to stay there . I was scared to death but ran out thinking something might hit me . I ran to the shop . It was owned by jews & stayed open late . I found my mother was telling her what happened & a policeman was there . I tried to tell my story , he told my mother it was a bad irish neighbourhood . policeman was irish too . My mother asked for a lift home in the police wagon . It was 1925 she was black but not cowed by authority as she went to school we got a lift in the police wagon with the horses and the bell clanging we made a lot of noise the policeman told us to move my mother said she had no money ",
    "5f107aa051372032695c8e2f": "In 1925 a black family moved into an irish neighborhood. One day, while the mother of the family was out shopping, the other people in the neighborhood threw rocks at the black family's house. The oldest of the children got the other kids away from the windows, and then, after saying a prayer to himself, ran out the front door to go find his mother. He found her in the market and told her what was happening. When she tried to explain things to the police, the police said that they couldn't do anything about it as there were no witnesses who could identify the culprits. The police also added that she shouldn't have moved to an irish neighborhood in the first place. After hearing this she said they had no choice, and that they were there until the end of the month at least. After asking the police to take her and her son back to her house, she explained this again to the crowd gathered around outside. After that incident the neighbors treated them like any other family in the neighborhood, and though the father of the family got sick during their time there, there were no other incidents while they lived in that house.",
    "605ba57d2842d8291b4afd24": "The writer and family moved to a new neighborhood. On the day they moved, after the father had put the furniture inside the house, left to drink, but that was after the mother had already left to go and do shopping. When the parents were gone, someone or some people in the neighborhood threw stones to their house. The writer, who was 10 years old at the time, took her siblings to hiding to try and protect them. She then left to the store to tell her mother what had happened. While doing that, the policeman came, and she tried to explain what had happened. He told them that they had to move, the neighborhood is Irish, and they don't want people of color. The mother said that they would not move just because they are black. The policemen then took them home and all the neighbors came out when the saw the police horses and heard the bell. The mother addressed them and told that if they wanted her gone, they would have to give her money, otherwise she is not going anywhere. They continued to live there and the Neighbours started to help even when the dad got sick.",
    "63d66d856ec54ad9b9cfa338": "We moved to third, and my father drank and he went out and then my mother went out to get some food.  As soon as she had left someone threw a stone through the window and I put the other chilrden by the stairs and I said that they should stay there because they would be saf there.  I was frightened but I went out.  My mother came back and she saw what had happened and the police came and the police said that this was a bad neighbourhood and we should move. He said it was an Irish neighbourthood and that the Irish did not want us there.  And my other went to the police station with them in a police patrol with a horse.  And she said to the officer that shr could not move because she had no money because she had to pay the rent in advance.  And she said that if the neighbours did not want us there then they should not have taken the rent in advance.  And she said to the police what are you going to do, but the police said there was nothing they could do.  She said there was something they could do, they could take her home in the police patrol which they did.  All the neighbours came out because they heard the noise of the patrol and my mother said that it was winter and she did not have the money to pay for windows.  She said that all she wanted to do was to look after her family and that she had paid in advance and she did not have any money.  After that the neighbours were nice and they were hice when my father was ill but at the start they had not been nice.  ",
    "63f88d4dc904d13656486166": "Mention of third and wharton street. a location, There was banging and stones smashing windows of their home.  The main story teller got her siblings together to a safe place in the house to be protected from the glass. The father had left the house, the mother had gone out. The kids were crying. The story teller went looking for her mother nearby, fourth street. There was shouting. They found their mother. she told them what has happened. It unfolded in the story they were of black decent. Mention of the time of 1925. The word black was not used. The mother wanted help, the police officer was irish and he could not help. He advised they wanted her to move, she couldn't she did not have enough money. She paid inadvance for the month so she would be there at least the month. THe officer told her they didn't see anyone so she could not blame, she wanted more help from the precinct. They explained they couldn't and wouldnt do anymore. It was not a good neighbourhood and she should leave. The story teller recited the conversation between their mother and officer. THe mother demanded to be felt safe or protected, this was not going to happen. SHe asked to be taken home, they went by horse and cart. The loud sound of clang clang clang filled the dark streets and people came to see. She wanted the neighbours to pay so she could move if they wanted her gone. It was a sad recall of colour. ",
    "5d0bedd29d49670018383c20": "They moved to Third and Walden. I was around ten at the time and it was 1925. My father went out of the house and my mom had left to go to the market to do some shopping. \nStones were thrown at our windows and smashed all the glass. I moved the kids to the stairway to keep them safe and they were crying and very scared.\nI left the house and found my mom at the market. She told a police officer what had happened and they told her that the Irish do not like black people, although he did not specifically use the word black. The police man told her that they could not do anything and she should move. The police man was also Irish. My mom said that it is their job to protect them.\nMy mom went to the police station and they also said that they cannot do anything and they should move. My mom said that we cannot afford to move and if they were not going to do anything they should at least take them home in the police patrol wagon. The wagon was pulled by horses and clanged.\nThe police took me and mom home and the neighbours watched us return home with the wagon clanging down the road. My mom told the neighbours that she does not know why they have smashed her windows as even though she is black so different in colour she is otherwise just the same as them. She also said that they do not have the money to move. The rent is paid in advance and she had paid for the month, so she does not know if she can afford next month, but she will be there for at least a month, so if they want her to move then they should pay for her to move.\nLater on my father then got sick and the neighbours treat us the same and helped as they would with any other neighbour.",
    "5a52669aacc75b000179c9b4": "The father drank. The mother went to the shops after moving the furniture into their new home. They rented it was 1925 and it was an Irish community that did not want bkack people there. The house got stoned and the window smashed. The girl went to find her mother to tell her she was in  Jewish shopping area and it opened late so the Jewish people could earn as much money as possible. They went to the police station to report it and the policeman said there was nothing he could do, he was Irish. She said escort me home and all the neighbours will see. When she got home she told all neighbours she had paid one month's rent upfront and could not afford to move so they were staying. The husband got sick and the neighbours were now very helpful. They were quiet poor and it turns out so where the neighbours",
    "5dcc6f91e5e18690a20e74d1": "The narrator and her family are black and they move into an Irish neighbourhood.  They dont know this at the time.\nOne night when the narrators father, who drinks, is out tending the horses and their mother has gone to the shop the house has stones thrown at the windows and the window breaks.\nThe narrator who is only 10 years old, takes their younger siblings into the stairwell to protect them from flying glass.  They are all very scared by the experience and the narrator has to go and find their mom, which is what they call their mother.\nThe narrator knows to go to 4th Street where there is a Jewish shop that is open late. (The narrator comments that they want to make as much money as they can so open all hours)\nThe narrator finds mom and tells her what has happened.  At the same time a policeman hears the story as the narrator is talking loudly and asks what has happened.\nThe policeman is told and is asked what he is going to do.  He replies that they will not be welcome in an Irish neighbourhood and he can do nothing about it, it is said he is Irish himself.\nMom asks his precinct and goes there to complain and see what the captain will do about the incident, to which the Captain explains that if the narrator did not see who threw the stones they cannot know who is to blame.\nThe mom then asks to be taken home in the patrol wagon and the Captain agrees.  The narrator comments that her mom is educated and the only person they knew at the time with a high school diploma.  \nThe narrator mentioned that it was 1925 but I am not sure if that was the date of the incident or when mom graduated high school.\nthe whole neighbourhood come out to the sound of the patrols clanging bell and mom tells everyone that although they are a different skin colour, she and her family are the same in every other way and she only wants to take care of her family just like they do. She has paid all the money she has upfront to live in the house and If they don't want the family there they can give her the money and she will happily move, of course no one offers and the narrator comments that no one would have that sort of money in any case.\nThe narrator tells us that the neighbours were always kind and considerate to them and when her father got sick they were helpful and kind.",
    "60c283d8d82adfb1f4930352": "There is a family who moved out .",
    "60df7ffed00034efd9a002c1": "They moved to Third and Wharton. The father was to bring back the horses but he didnt come back. The narrator was to mind the children while the mother went shopping. When she was gone someone threw stones at the house nd smashed the windows. The narrator went to find their mother as she was shopping in the Jewish district and the shops were open longer. When the narrator found their mother and told her what happened a police man came across them. He said it was a bad area for them to be in but that he could not help them. So they went to the police station to see who could help. The captain said the same, that he could not help and so the mother asked him to bring them home in the police patrol. When they got home a crowd gathered and the mother said she had no money left to move anywhere else, she had paid for a month and if the people did not want her there they would have to give her money so she could move somewhere else. After that they had no more trouble, the neighbours were very good to them when the father was sick.",
    "5e11a7d6feea8982dba1e61c": "We moved to Third and Wharton. I told you my father used to drink, so he went out. My mother went out to buy some food, leaving me alone with the kids. Just after she had left I heard a loud crash. I saw stones coming through the window. I grabbed the kids and hid in the stairs. I told them \"Stay here, nothing can reach you here. I'm going to try to find mom.\" (We called our mother \"Mom\".) I was only 10 years old at the time. I was so scared walking towards the front door, I didn't know what I would see. There were shops nearby, in the Jewish neighbourhood. They were open all hours because they tried to take what money they could get. That's where my mother was. There were carts on the street. I ran up to my mother and started telling her what happened. A police officer went past. I was so scared I could hardly be understood. The police officer stopped, he wanted to find out what had happened and what was wrong with me. He started speaking to my mother. \"You're in a bad neighbourhood. There's nothing anyone can do for you, the people there are Irish.\" He was Irish himself. \"They don't want black people living there.\" But he didn't say black. \"They don't want anyone in that house, you should move.\" \"We can't move.\" My mother said. \"We don't have any money. If you can't do anything then tell me where your precinct is.\" We went to the police station where the officer worked. We spoke to another police officer there. \"You should move.\" he said. A lot of black people were cowed and put down, so they rarely spoke up for themselves, thankfully my mother was not like that. \"We cannot afford to move, surely the estate agency should be held accountable if no one wants someone living in that house. Now if you're not willing to help, I'll tell you what to do.\" \"What?\" asked the officer. \"Drive me home.\" Said my mother. We were driven home by the police in a cart pulled by horses. There were bells on the cart that would clang. Clang, clang, clang. Everyone came out of their houses to see what the noise was over. My mother stood up and spoke to everyone. She told them that we had no money, we had paid rent for a month (we had to pay in advance), we didn't know what would happen in a month but we couldn't leave before then. She told them that we were different from them but that didn't give them a reason to treat us badly. After that my father became ill, but the neighbours were as nice as they could be to us.",
    "62e1975d947d5f6bcb8113bd": "We  had just moved to a property on third and wharton, my father had just finished putting the furniture in when he had to leave to take the horses back. my mother then left to go and get groceries leaving me alone with the kids. My mother was going to get groceries in the jewish shops where they stay open all hours to get as much money as they can. There was a large crash and the kids were screaming, I ushered them under the stairs while I looked to see what it was. A stone had been thrown through the window. I ran out of the house to find my mother, I was so scared, I ran and ran and found her on forth street, I was speaking so low that a passing policeman stopped to see what had happened. My mother asked what he was going to do about it, he said nothing, my mother asked why not as I paid rent for that property and I have no more money. She asked who could help, he said no one can. My mother asked for the precinct to get them to help. My mother was an educated black woman who qualified from high school in 1925. We went to the precinct and they said they cannot help so my mother said you can take us home, they did so in the wagon that was pulled by horses with a bell that went clang. When we stopped there was a step that was put to the back so we could get out and all the neighbours had come out to see what happened. My mother told them that she had paid rent for a month and had no more money so she was going to stay for the month and if they didn't want us stay then they could pay our rent for us to leave. After that my father got sick and our neighbours helped us.",
    "60c00052c391140811ca1d54": "They moved to third. It was day my father drank and took the horses. I was left with kids. I was 10 years old my father said they are terrible neighbours. We went to the police station to report but they said we must leave because I said no my mother was an educated person ",
    "5d336b07d343a00016536032": "This person first started on Wharton. Their father was at a furniture store. One day people started throwing stones at their house. (presumably because they were black and unwanted in the community). Given this and the color of the family's skin, they are told that they will be evicted. The narrator's mother fights against this eviction. The mother argues that she already paid this month's rent and doesn't have money to pay for rent elsewhere. The mother states that this is there home for the month, even if it might not be in the next (because where will the money come from). The mother even says that she doesn't have the money to pay to replace the windows that were shattered by the stones, which will be rough given that it is the winter time. However, the apartment is still home and unless people give her money to leave then this is where she will be for the month. For the narrator this was a traumatizing experience.",
    "5b8ba037bca3400001fad37a": "They moved to third and wharton. Mother went out shopping to fourth street, Father was also out of the house. When they were out of the house the storyteller who was ten at the time, recalled of stones smashing the windows. They moved to other parts of the house for safety, then ran out of the house, they were scared that they were going to get hit by something. She finally met her mother, she was that upset she could barely make out what she was saying. A passing police officer stopped to talk and find out what was wrong. Her mother was very assertive, which was not common among black people of the day. The policeman had said there was nothing he can do, and that it was an irish neighbourhood that was known for trouble. He advised her to move house. The policeman was also irish. She recalled of how she though her mother was educated and that she finished high school, She went to lakawana high school and finished in 1925. The mother wasnt happy with the policemans response, she asked what precinct he worked out of.  The mother went to the precinct on fifth street and spoke to the captain. She recalled of seeing lots of police patrols and horses. The captain was equally unhelpful. saying that because they never seen who threw the stones there is nothing they can do. The mother spoke loud and long, the captain hadnt dealt with someone like this before. The mother then asked for a police patrol to give her a lift home. When she got home there was a crowd waiting for her. She spoke to the crowd, letting them know that they paid for the rent in advance for a month, and dont have enough money to move. Telling them that apart from the colour of her skin, she was the same as them, and if they want her to move they would have to provide the money as she couldnt afford to move out, she was just trying to make a home for her family.  Her father got sick during this time,  the neighbours were now really helpful and looked out for them. Whenever there was any other trouble the neighbours would come out and help them.",
    "5ed931982fb618499fb90bc6": "Father was an alcoholic, people were throwing things at the house, involving sharp glass. I gathered the kids and got them out because it wasn't safe. I was only 10 years old. I went to find my mother, she was shopping in the Jewish district. We spoke to a policeman who was Irish and he said its not safe for us in the area. The Irish people of the area do not like Black people, although he did not use that term. He asked me if I saw who did it I said I hadn't and he said therefore he cant do anything because there is no one to blame. Then we saw another lady who said if they give her enough money she will move away but she said they will not have enough money so we will have to live like this. Then my dad got sick.",
    "64e603dd69223a81a990ae76": "The story starts off with the main character moving to a new neighbourhood. The main plot about one day when her father was drinking, someone threw a rock through the window. The main character was very scared. They reported the situation to the police. They live largley in a jewish neighbourhood and the police immediately attributed the crime to racism. They blamed irish and black people. This became a big issue in the neighborhood and people felt unsafe. Due to this, the main character moves to a new neighborhood which is more friendly and less racist. ",
    "5b618aef12bf660001275c5d": "a girl was in a house with her siblings when stones were being thrown through the window so she told her siblings to hide while she went to the town and found her mother and as she was telling her a policeman walked by and heard the commotion so stopped to ask what happened and they told him and he basically refused to do anything about it as the family were black and the irish didnt like them, the mother decided to go to the police station to talk to someone else and they agreed to take them back home in the patrol car so the people would see that and leave them alone which they did and became helpful when their dad was ill",
    "63ced390ffb149038641f677": "A black Jewish family had moved in to a new home. The father was out drinking and the mother was shopping. The house got attacked with stones breaking the windows the oldest of the children hid the other 2 siblings in a cupboard away from the flying glass so they wouldn't get hurt. The eldest sibling ran out of the house, frightened and looking for there mum. They found there mum down the street where there mum was shopping and tried to explain in tears what had happened. A passing police man heard the commotion and came and asked what was wrong. They explained that they were a new family in the area and there house was being attacked. The police man explained that this would happen to this black family as they lived in a Irish area. The mother was disgusted to learn the police wouldn't help so wanted to see the captain. The mum and child was taken to the station and pleaded there case to the captain but was told exactly the same that the police wouldn't help and the only solution was to move away. The mother had payed a month's Renton the house and had no money left. She demanded that herself and her child to be taken back in the horse drawn wagon. As they sat in the back neighbours appeared as they arrived at there house. The mother exclaimed so the neighbours could hear that they had been attacked and if the group of people who didn't want them there they should get together and give then the money to move as she didn't have the money to leave. Also stating that now they would be cold as there windows were broken and she couldn't afford to fix them. The neighbours had seem to change there mind once the dad got ill and all came together to help the black family and were now friendly to the family.",
    "5ffd80c185e28327669b51f5": "it a story about a family with one kid who was 10 years old at the time ,a mother and father and they moved in to place where black people were not treated ok , and one day an incident happened to them and they went to report this issue but they did not get the help they thought they would get, they were basically told to move from that place but they couldn't because they had no money ",
    "63e52debbbb982734deba89a": "A black family had recently moved into a new neighbourhood of predominantly Irish people. This was in the 1920s. The father went out {he tended to drink) and left his wife and children at home. it was evening time. The mother needed to go and get sosme food so went out to the jewish shop that stayed open longest. She told the eldest child who was 10 to look after the younger children. Suddenly there was a crash that scared the children greatly. The eldest hurried the children under the stairwell for protection and told them to stay there and that they would be safe. \nA stone had been thrown through their house window. T\n\nThe child was scared but went out to find their mother, correctly guessing where she would be and told her what had happened. She was angry and aggrieved at the unfairness of it. They were black but they paid their rent like everyone else. if they didnt want them there why had they allowed them to rent.\nThere was a policeman passing and the mother stopped him asking for him to come and help find who had done this. Although he was sssympathetic to a degree he said the only thing he could suggest was that they moved somewhere else.\nThe mother said she had paid the rent for a month and there was no way she would move. Her job as a mother was to protect her children. The child was proud of his mother who was educated and strong.\nAs the policeman would not help she asked to be taken to someone more senior who could help. Again the answer was that all that they could suggest was that she move.\nShe and the child were taken in the horse drawn police wagon back home. The clanging of the bell alerted the neighbourhood who came out to watch what was happening.\nThe mother alighted and spoke to them saying that apart from the colour of their skin they were all the same. She had paid rent for a month and she was staying for a month. if they wanted to move her they could pay her rent to live elsewhere.\nA while later the father became ill and the people in the neighbourhood behaved towards the family with kindness and empathy.\n\n",
    "584c8539e964030001c316fb": "it is 1925 and coloured boy 10 years old  moved into an Irish neighbourhood with his family while his mum and dad were out he was left with his siblings some one threw a stone through the window so he hid his siblings under the stairs while he went to search for his mother he thinks she went to the Jewish neighbourhood as the shops stayed open longer there he found his mother who informed a police officer, who said they could not do any thing and the Irish people probably did not want them living there. The boys mother explained she had paid a months rent to the real estate agent and could not afford to move. she persuaded the police officer to give her and her son a lift home in the horse drawn police wagon that went clang. When she was dropped of in her neighbour hood all the neighbours were watching as she got out.  She told the neighbours if they wanted her to leave they would have to club together and give her the money to move to some where else. while they were living at the house the boys father feel ill all the neighbours helped out.   ",
    "5c0239caecc5660001424ed6": "A Black family moved to a new neighbourhood. Someone smashed a window in the family's home as it was an Irish area and they didn't want any Black people there. The mother called the police but they would not do anything.\nSo the mother went to the police station to complain. Again the police said they could do nothing as they had no evidence. When the mother got back from the station she said to the neighbours that no matter what they did, she and her family would be staying there for at least a month because she had paid for a month and could not afford to move again unless the people paid her to leave, which is something they would not do and probably could not afford to do.\nIn the end it turned out ok and the family got on well with the neighbours.",
    "5e356b29d87fbf512a4cd090": "We moved to Wharton, my mum went to the shops. There where horses in the road. Somebody stoned our house ane broke all the windows. I went to find my mother who was working in the jewish district. I could barely speak when I found my mother. She was good at talking. Called the police about the stoning of the windows in the house, we thought it was because we were black. My mum said to the neighbours we are just like you. The policeman said we could move, my mum said no. She said they had rented the house for one month, if the neighbours did not like it they could pay for the windows because my mum said she had no money, neither did the neighbours. My father got sick and the neighbours were kind.",
    "6075e12159e69162ee283711": "",
    "5a3adfb705f005000104d2a3": "lived in Third and Warton, his father was an alcoholic and fled on a horse. there was a loud crash in which someone was throwing stones at their windows. the father rushed the kids under the stairway, the narrator was only 10 at the time. this is when his father took off. They moved to fourth street, a jewish town, in which his mother went to a policeman, who was irish, to try and find out who was throwing stones. it was a mixed race community, which caused lots of trouble, where the black men cowed, although they weren't allowed to call them black. The policeman said she doesnt know who to blame so its pointless and his only advised was that she moved. his mother was very poor and could only afford 1 months rent but she knew she was staying put despite not having a lot of money. At the Narrators age of 24/25 he went to fifth street. there was more policeman here with horse wagons, they said there was nothing they could do about these stones. the narrator was terrified at such a young age.  ",
    "5d080cac3ba4580019731a79": "A 10 year old child moved into a new neighbourhood with their mum,dad and siblings.  Just after moving in the mother decided she had to pop out for some shopping, so off she went.  The father then decided he had to out too.  So the children were left alone in new home,  all by themselves. \nSuddenly rocks and stones were being thrown at the front room windows.  The   child took her brothers and sisters and hid underthe stairs.  When the noise stopped shetook out the children and went to find the policemen-.  When the mother was located she was very angry and spoke to a policeman who told her she needed to move house, however the mother argued that she had no money to move house.  She asked the policeman to take them home.   On arriving home the neighbours all came out of their homes to look at who was being driven home by the police. The mother then explained the situation she was in.  If the neighbours wanted the family to leave they must all give her money to do so . She went onto explain that she wanted to make a home  for her family just like themselves, even though her family had different coloured skin to them they were just the same as any other family.\n",
    "5e852dd84fc423121601a0f8": "There was a ten-year-old child who was babysitting one day when, out of nowhere, something struck the window. Their parents were not at home, and they lived in a Jewish neighborhood. Startled by the incident, the child quickly gathered the other kids and moved them to safety.\n\nThe child then decided to investigate what had hit the window. While searching for their mom at a nearby store, they caught the attention of an Irish police officer. The officer inquired why the child appeared scared.\n\nWhen the mom finally arrived and learned about the incident, she asked the officer for assistance. However, the officer regretfully responded, \"I can't do anything about it.\" The mom became upset and requested the officer's captain's name so she could discuss the matter at the police station.\n\nUpon speaking to the police captain, she was met with a similar response. The captain explained that their hands were tied, and they couldn't take any action. Frustrated, the mom expressed her inability to move out of the neighborhood due to financial constraints.",
    "600ed894271cf07f30826df6": "A black family moves to Third and Wharton and their house is attacked by neighbours throwing rocks through their windows. The mother goes out to get police help, but the police officer blames the issue on the Irish neighbourhood and advises that the family move. The mother says she can't and asks where the officer's precinct is. He tells her and she goes there to speak to the captain, who also tells her that there is nothing he can do except to advise her to move. She tells him she has no money as the rent is paid in advance for her home. She asks the captain for a ride home and once she arrives home, she tells her neighbours her situation and after that they were kind neighbours, even helping when the father became ill.",
    "5f392fae9168cc472f0468f6": "One evening when we lived on the corner of 4th and Westbuty my father went out with the team of horses, and then my mother went out and I was there. There was a huge crash and a stone came through the window. I took the others under the stairs and I said you staay there, I'm gonna get Mam, we called our mother mam in those days. I knew she would be shopping somewhere on fourth because there were shops there and they kept open late because they - jews - wanted to make as much as they could. I found here there and told her. There was a policeman there and my voice was so low and shaky that he asked what the problem was. My mother told him and asked him what he could do. I can't do nothing, he said the Irish don't like a black living there - he didn't use the work black, it wasn't used then. So what can i do, my mother said. You'll have to move he said. I can't move she said, I don't have any money. I paid rent in advance so I just can't move. Why did they let me rent it if they don't want us there. Where is your precinct. He told us and we went there. Captain, she said, what can you do. Nothing he said, I'm Irish too, all you can do is move. I can't move she said. I'll tell you one thing you can do for us, take us there in your horse and wagon. He said yes, probably he just wanted to get rid of this woman. He hadn't seen anyone like her before. She was the only black woman I knew who had finished High School. We sat in back of the carriage and the bell wne Clang clang. You know those trams go Clang, well this went Clang Clang Clang. When we got to the house the policeman opened the long back door and we had to walk down the steps. A crowd was looking at us. My mother said. I can't afford to move from here for a month because I paid rent in advance. It's winter and cold. I can't afford to new windows. I'm just like you except for skin wise. I am just the same. So they just accepted us from then on and when my father got sick they all helped and treated us just like one of them. The year probably was nineteen twenty five.",
    "5c98310742270c0014d0287a": "This person lives with their parents and siblings. This person's mother went shopping and father went somewhere. People threw rocks at their house. The narrator ran to mom at 4th street and there were horses. On the way there the narrator saw a policeman. They lived in an Irish neighborhood, where blacks were not welcome. The mom asked the policeman what they can do, nothing could be done. They went to the police station and the chief said to move out. But they had already paid their rent for the month and did not have any money to go anywhere else. So she suggested that if people wanted them gone they get enough money to move out. But those people probably didnt have money either.",
    "60bab50bcdd5d7ad3ee97479": "The story was based in a Jewish neighbourhood, in which a policeman recalls to be a dangerous neighbourhood. Apparently black people aren't allowed to live there. Their mother went out to the market while they hid under the stairs to avoid the flying glass. They were all scared, but the narrator went to find their mother. Along the way she spoke to a policeman, who said everything about the neighbourhood. Later on, the father had to go until hospital. Overall, it was quite a frighening story as reflected upon towards the end by the narrator.",
    "62e952d57a788507f98964ba": "We had to go to Wharton. The house was stoned and there was flying glass everywhere. I had to make sure the kids were safe but I couldn't find mom. We ended up in a Jewish neighborhood and was told they didn't like black people there. At that time you didn't say black people so they said they didn't like other people there.",
    "5cb3d74a0225590017acda81": "the window got smashed the were very scared and voice was shaking they ran to get his mum and the police told the mum they should move because it's full of irish people ",
    "606f18e0f46c7435dd00838c": "A brother and his siblings were left home by their parents. Some unknown people threw stones at the windows of their home, this frightened the 10-year-old and his sisters. he got them to a safe spot on the stairway and went about to look for his mother. He found her at some Jewish shop doing some grocery shopping. He relayed the story of what had happened to his mother, there was a police officer in the vicinity. The boy told the cop what had happened the cop said there was nothing they could do about it and suggested that the boy and his mother move to another neighborhood. Since the area was Irish the boy and his mother were black. The boy's mother refused to move and requested to be taken to the precinct to speak to someone else who could help her. They got on a horse cart as this was back in the 1925s. At the precinct, she was told the same story about not being able to be assisted especially with the identity of the perpetrators not being known. After realizing that she was not getting the help she required she asked to be escorted back home by the police patrol, which had a bell that clanged. The clanging noise aroused the curiosity of the neighbors, they came out of their homes to see what was happening. She got out and addressed them, telling them that unless they were willing to make donations towards her getting her down payment for her monthly rent for the house there was no way she was going anywhere for at least a month as she couldn't afford to pay rent elsewhere. So she was stuck with them and they were stuck with her for at least a month until she could find somewhere else. That was their welcoming into the neighborhood. From then neighbors started warming up to them and would step in to help whenever something happened even the boy's father got ill.",
    "5b0e8d65d282ff00015bb9d1": "A family moved into an Irish community in 1925 and the father went out to the horses and the mother went shopping to 4 th street which was a Jewish area. While array the 10 year old looked after the others. Someone put a brick through the window. They hid under the stairs. The 10 year old went to find his mother and also told a policeman what had happened. The family had paid a months rent so couldn’t afford to move. They went to the police station and were brought home in the police patrol. The mother who was black told the neighbours she was staying a month unless they paid her the money to move on.",
    "636419013bc521fae9f7db90": "A black family moved into a neighborhood. One day something was thrown into the window and shattered the glass. The narrator - a child - ran and found their mother, who reported it to someone (can't recall who). That person said the trouble was owing to the neighborhood being largely Irish and that they didn't want black people living there. The person noted that they themselves were Irish too.  So the mother went to report it to the police, and asked what they would do about it. The police said there was nothing they could do and could only advise that the family moved somewhere else. The mother said that she can't afford to move but asked that police at least give them a lift home in the police car.  Given that it was in the 1920s, the car had a bell that clanged (like the 'clang clang' of a trolley)as they went. The noise caused a small crowd to assemble when then they arrived in the neighborhood. When she got out of the car the mother asked the crowd why they were 'doing this' to them; that they were just like them only looked different.  (at this stage I got distracted and sleepy and missed a few lines). Towards the end the neighbors were friendly. ",
    "5cad04fabd5aa100158dae68": "",
    "60475f1790672f23136c2cc4": "this ten year old was sitting in the house with her siblings when stones were thrown through the window and she told the kids to hide by the staircase to avoid getting hurt, she then opened the door ran in the streets to where her mother worked , and a policeman was close by asked her what happened she told him their house was stoned her mother asked the police officer to help but he said he cannot help all he knows is they wont people like them there(black people) but he could not say it he just said to her they must move. she then told him she cant move because she just moved in, she then told him to take her to the police station where she spoke to another officer who told her he too could not help her the only solution is for her to move, she told him she already paid the months rent with all the money she has so she cant afford to move she asked him to take her home and he took her home in horse pulled police carriage it made a clang clang sound when it went to her house and the neighbours came rushing out to see what was going on then they saw this woman coming out of the carriage and she addressed the public told them she just paid rent with her last money and she cant afford to move so they should get used to having them there because she is not even sure if she will have money for the next rent add to that it is winter and her windows are broken. from that day the people became more neghbourly    ",
    "601f08cba1191642cadf59c1": "A black family live together in a rented house in a Jewish or Irish neighbourhood on fourth street. One day, after the father had had a drink whilst moving furand the mother had gone out,some people started throwing stones at the house, breaking the windows. The daughter was inside and was very afraid and trying to look after the young children in the house and protect them. They ended up calling the police who didn't do anything so they went to the precinct where they explained the situation. These police also didn't do much so the mother asked for a lift back to the house. On the way back, around 5th Street, they saw all the neighbours. The mother was quite smart as she had completed school , finishing around 1925 and spoke to all the neighbours. She told them that apart from their colour, they were the same as everyone else. They paid their rent and didn't have any money to currently move,  explaining that they would stay in the rented house for another month, as they had paid for this.",
    "604a8a4926724aaed69b940b": "From what I recall from the story, there was some racism for black people in an Irish neighborhood. The mother and the child both had to to deal with tough times. The mother/child received word that they could not provide for the child properly, at least that was what the child was complaining about. I know that the mother went to a high school in 1925. I remember something about Younge street. The story was taking place in Canada I believe. That is all I recall words were moving fast. - Thanks  ",
    "5ec83217e7e29110f1f1cde0": "A person moved house, their Dad was a drunk. Their mother went out to the shop and their father also left. Whilst they were left alone a stone was thrown through the window. The person looked after their siblings who were crying. They went to find their mother and eventually found her but a police officer wondered why the person was so distressed. The police man said he could not help and claimed the Mum was loud and talked for a long time. The Mum said he was being racist because of her skin colour. She then asked for a lift home.",
    "5daa828510839e0016aa193b": "It's about a black family moving into a neighbourhood that is hostile to those that aren't white. There are three kids and their parents, the kids are left at home while the parents are out. Suddenly their window is hit and broken by a rock, the assumed eldest of the kids takes them away from the window to hide while the assumed eldest goes to find their mother. Their mother goes to the police and tries to see what they can do, but all they can say is for them to leave the neighbourhood. So the mother takes it on herself to speak to the neighbours, and that's all i got.\n",
    "56e6f0dec89073000de74780": "When the boy was about 10 years old, his family moved to a house on Third and Wharton. On the day they moved in, his father left to get the horses and his mother went to get groceries at the store owned by Jewish people that opened later than usual. He was left home minding his younger siblings and someone threw stones through the windows. He moved the kids under the stairs to be safe from the glass and went to find his mother on 4th street. A passing policeman heard him telling his mom what happened and she asked him what he was going to do. He said there was nothing he could do and that they should probably move because they weren't welcome. She asked him where his station was and went their to see if anyone could help her. They told her the same thing but gave them a ride home on the police carriage when she asked. When she arrived, she told her neighbors that had gathered because of the loud noise for the carriage bells, that she would be there for a month because she had paid for a month and if they wanted her to leave then they could give her the money. Nobody bothered them after that and were even quite friendly when his Dad got sick.",
    "5716a297c5aca200128d2c52": "There is a family that just moved to a rental house on Third and Wharton. The story is told from the perspective of a child aged 10 and set around 1925 so there are horses and carts. The father was a drunk and had to go out and get the horses. The mother left the house and came back on that day. When the whole family was in the house a stone came crashing through the window and broke it. There were people outside throwing stones at the house. The narrator gathered the younger children in the stairway so they would not be harmed and the mother ran out of the house. The narrator followed. They went to fourth street because that was a Jewish neighbourhood where things were open late and there were horses and carts. They came across a policeman who was Irish. He said it is a bad neighbourhood and an Irish one. He said they don't want black people living there and that is why the stone was thrown at the window and told the mother they should just move. The mother and narrator walk to the precint on fifth street where the policeman worked. She spoke to another police who told her the same thing and she should move. She said that they do not have the money and they gave all their money for rent and the least he could do was take them home. The policeman took them in a police horse and cart with a large bell on it. So all the neighbours came out of their homes to see it. The mother then tells them how she has no money and will definitely be there for the month but maybe not longer if they cannot afford the next months rent. She tells the crowd that they can give her money to move if they don't want them there but they do not give money. The father becomes ill during this and the neighbours act nice and help. The mother said they cannot afford to fix the window and it is cold. ",
    "62ade6ed8f62ae5ea2ac12e1": "It’s 1925, a black family moved into a house in an Irish neighbourhood and had stones thrown through their window so went to the police and the police told them to move but they couldn’t afford to as they had paid a months rent so had no money. Police took the home, the mum shouted at the neighbours, and then the neighbours were all nice when the dad got sick. The author was 10.",
    "603659d5c391045d1e4b332b": "We moved to Third and Whardoff. My father went out - did I tell you he drank? And my mother went to the store to get some things for our home. When my father left people began throwing stones - stones flying through the window. Of course, I was left at home with the children. So I rushed them to the stairway, because that was the only place where they wouldn't get hit by flying glass. Once they were there I said \"You stay here, I am going to get mom\" (We called our mother mom). I ran out the door and didn't know what to expect. I ran to Fourth. The neighbourhood was Jewish, and so the stores stayed open until late. Any bit of money they could earn, they did. When I reached my mother I couldn't make sense in what I was saying. A passing policeman heard the commotion and wanted to find out why I was in such a state. Once he found out, he told my mother that the neighbourhood is Irish, and that we should move out because we're black. He didn't say 'black' but he said \"They don't want somebody living there\". My mother said to him that she had spent all of her savings on that months rent, and didn't have enough to move. She said \"You're civil service, you must protect us\". He said that he couldn't do that - he was Irish too. My mother asked \"Where is the precinct you work\". He told her, but I don't remember the exact details, even though I was standing with my mother. We went to the precinct and spoke to the head officer, but he told my mother the same thing \"Move away\". She explained the situation to him, but he said he couldn't help. She finally said \"The least you can do is drive me home\". So he did. The police car, hors and cart, mad a clanging sound. Clang clang clang. As we turned the corner - the precinct wasn't far, maybe on Fifth - everyone turned and came out of their homes to hear the noise. The policeman sat up front, and we were let out the wide back door of the cart. As my mother got out she turned to face all the people and asked \"Why do you do this to me? We are the same, maybe not color wise, but in every other respect, we are the same. I have spent all of my savings on moving here. We are living here for a month at least, I don't have enough to move away. I am just trying to provide a home for my family. I don't have enough money to fix my windows, so unless you want to get together and pay for me to move, I am staying for a month\". Of course they didn't pay, but during that month, my father got sick. The people were as sweet as can be.",
    "5d5e66b3844f160001f24150": "The child was left home alone except for his/her siblings because his mum had gone shopping and his father had gone to (I think) take some horses back to their stables. Shortly after his mother left there was a huge crash and a window in the house was smashed. The child was afraid, but he managed to move the younger children into the stairwell where no stones could reach. He ran out to look for his mother who was shopping in the Jewish area, where shop-keepers worked long hours to maximise their income. He managed to find her and tell her what had happened. She asked for directions to the police station and she, and the child, went there. The police were sympathetic but unable to offer any help. They didn't expressly say it, but they indicated that the trouble was because the family are black and this is a predominantly Irish neighbourhood. Their only suggestion was that she move the family into a different area. The mother was indignant at this and pointed out that she could not afford to move again. As the police could not offer any help, she asked them to at least take her and the child home, which they did, in a noisy, horse-drawn police vehicle. The noise brought out all her neighbours, which gave the mdother the opportunity to address them all. She told them that she could not afford to move, she had paid a month's rent on the property and would be there for at least that time. After that, who knew. She was defiant and strong when she spoke to them, pointed out that other than skin colour they were the same and that she should be allowed to live there in peace.",
    "5a5f945176d1c60001ab7e30": "We moved onto Third and Wharton. My father drank a lot and when he took the team of horses, used to move us in, back, he then didn't return. My mother left the house to buy some food from the Jewish shop as they stayed open all hours. I was in charge of the children. I was ten years old. After my mother and father left, there was an almighty crash. A stone had been thrown through the window. I told the children to hide in the stairweel so that they wouldn't be injured. The house was stoned. I ran out of the house to find my mother. When I was telling her what happened, a policeman heard me. He said it was a rough area and that the Irish didn't want black people there, though he didn't say black. My mother asked him what he was going to do and he said there was nothing he could do and we should move. He was Irish too. My mother said we had spent the money on rent for a month so couldn't move. She asked him where his station was and we went there to see the captain but he said the same. The captain wasn't used to a black woman standing up for herself as most were cowed by the white people. She made him bring us home in the police patrol, which was a cart with horses. It was 1925. At the house, she told the people waiting that she would be there for the month as she had paid the rent and that, apart from being black, she was the same as them. Later, my father became ill and the neighbours were helpful. ",
    "64287b2deed56861af146830": "We arrived at 3rd & Wharton, it was olden times. We were in the front room when we heard a crash, looked and there was a stone in the middle of the room. They were smashing the windows. Mum took us to the stairs so we wouldn’t get hit by flying glass. We were told it was an Irish neighbourhood and they didn’t want black people there. Mum told them she had paid all the money she had to move in, so there was no way she would move out. She said it was the real estate agents fault. This was in 1925 and horse pulled police cabins. We rode in one and went home. It was a very terrifying experience for me.",
    "60c1d285791d2605d8d7d131": "In the 1920s, a boy was living with her mother and father and siblings in an irish neighborhood. they were a black family who rented in an irish neighborhood for a month, the boy's father went to attend the horses outside and the mother went to fourth street which is a market. The boy was home alone with just his younger siblings when he heard a loud noise crashing through the window. The loud crash was a rock that was thrown through the window. the boy managed to keep his siblings protected from the window glass by standing on the staircase. he was scared and ran outside to find his mom at fourth street.\nWhen the boy found his mother there was surprisingly a policeman passing by. He managed to explain the story of what happened to the policeman and his mother. the policeman was understanding but mentioned that there was nothing he could do to help, probably due to the racial segregation existing at those times. The mother was relentless and opted to go to the nearest police station to find someone to help with this matter if this policeman can't. She went to the police station where they told her the same thing and suggested she moved out. She mentions she can't move out because she paid the rent for the month with her last money and asked the policeman take her home in his carriage instead. when she arrived she told the irish people in the neighborhood if the want her to leave they must collectively contribute enough money for her to move out because she doesn't have any money left over to move out. After her speech, the neighborhood treated her better and more neighborly after that.",
    "5e98ce846515431026d195c6": "We move to a new neighbourhood. We made from a different neighbourhood as my dad was an alcoholic. We moved in and my dad went out to drink. My mum went out to go shopping. I was left at home. Then a stone came through the window and smash the window. I was scared. But I went outside and there were people. I didn’t know what to do. I had to look after the children. The children were in the hallway. I had to find my mum.\n\nMy mum had gone to a place a place where you can get what you want for money. A shop. My mum was shopping. I found my mum and tried to tell her what had happened. A police man had come by and tried to say what had happened. The policeman said this is a bad neighbourhood. People called us black but they didn’t say black back them. My mum asked the police man to help but he said he couldn’t help. He said we should move. This is a bad neighbourhood. This is an Irish neighbourhood. my mum said you need to find who did this. The policeman said he could not help you did not see them. You do not know who to blame. He told my mum that we should move. But she said she couldn’t move. She paid rent upfront. This is all the money she had. The estate agent is to blame if they didn’t want us living here they should’ve rented us the house. My mum told the police officer to take us back in the patrol car. We drove back home in the patrol car. When we got back home we had to get out the back of the patrol car. It was one of those ones that have steps to get out the back. As we were driving, the car goes, clang clang clang, that’s the sound of the car. When we got back all the neighbours had come out to see what was happening. My mum said that if you don’t want us here you can’t do anything I have rented this house. I have spent all my money on rent. I will be here for a month I can’t afford windows. my mum was smart. She went to high school. This is 1925. Soon after we moved in my dad got sick. The neighbours were supportive like you would expect. The neighbours did what you would expect neighbours to do. ",
    "5fad0a601ab00734f83bf339": "A black family is moving into a white neighborhood. Mom and Dad leave the house and someone throws a stone through the window while the kids are there. They have enough sense to run upstairs and the eldest decides to go look for their mother as they know where they are. The eldest finds the mother and they talk to a police officer who urges them to leave, the mom refuses and demands to be taken to the precinct. There she talks to the officer's superior and also ends up nowhere with him, this is when she asks to be taken home with a police patrol. When they get home, the neighbors are looking outside to see them and the mom gives them a piece of her mind. Some of the neighbors are nice and help the family and the dad becomes sick.",
    "60c0c4333e49151d768bb35b": "The incident the narrator is telling took place in 1925 in New York City. The narrator was 10 years old at the time and he and his family had just rented a house and moved their furniture in. It was an IRish neighbourhood and not integrated. They must have been the first black family that had tried to live there. The father and the mother had had to go out separately on errands, leaving the narrator to look after his siblings. Suddenly a rock came through the front window, followed by a shower of other stones. The narrator hid his siblings on the stairs where they would be safe from flying glass and went out to find his mom, who was shopping in the Jewish neighbourhood a little way away. He was telling his mom about the attack when a policeman came by and heard their conversation. The policeman, who was Irish himself said that he couldn't do anything, especially since the narrator didn't know who had attacked them. The policeman said that the only thing they could do was move out of the neighbourhood. The mother stood up to the policeman and said she could not move for lack of money and that they had paid a month's rent in advance. Perhaps the real estate agent should not have rented them the house? Then they went to the police station, where the other policemen were equally unhelpful, advising them to move out. But the police drove them home and the whole neighbourhood saw them arrive in the police wagon. The mother then explained to the neighbours that she realized they were different but she couldn't move because it was winter and she had no money to go anywhere else. Eventually, the neighbours actually became helpful and showed the kind of solidarity neighbours should show to each other.",
    "64e7dcdda57ceb0c4584ffe5": "A family moved to an Irish neighbourhood on a street called Wharton. One day when the father was out tending to the horses and the mom was out shopping, someone started throwing stones through the windows. The 10 year old child of the family told the other kids to hide so they wouldn't be hurt. The child then ran out to fifth street to search for their mom. Upon finding the mom, the mom then talks to a police officer and asks for help. The officer, who is also Irish, says that there is nothing he can do and implies that moving out of that neighbourhood is the best course of action. Unsatisfied with this answer, the mom goes to the police station to talk to someone higher up. She is received better here, but is still told nothing can be done because she didn't see who threw the stones. The officer gives the mom a ride back home in a carriage with the clanging bells. The mom then addresses the neighbourhood and tells them they will be there for at least the next month and so they should be more accepting of them.",
    "5fc423afc5dad58229f0c1c0": "Honestly, that felt like pure nonsense and it's difficult to recall. I remember there were race issues. They were staying for a month. She didn't have any money to pay rent. She went to the police to complain. She was being kicked out of her place, and she just wanted a place for her family. Her son was telling the story. There was a lot of stuttering and repetition.",
    "5f0d5e8b03b5db770f95690d": "We moved into a neighbourhood between Third and Walton, where mainly Irish people lived. My father was a drunk and used to manage the horses. One day when my mother had gone shopping, people began to throw stones at our house. We were scared and didn't know what to do. I went out to look for my mom who I spotted near a Jewish neighbourhood, their shops were always open till late because they wanted to make money. I told her what had happened when we spotted a policeman. My mom told him what had happened but he wasn't interested in helping us. He implied that people of our colour didn't belong in an Irish neighbourhood. My mom enquired about this his precinct and then we made our way there. We went through various cases ad they admitted that they couldn't help, so my mom asked them to take us back in a patrol car. When we returned, my mom spoke to the people in the neighbourhood and asked them to either give us enough money to move out or leave as be. Following this incident, we were able to move on and enjoy ourselves with the support of people in our neighbourhood.",
    "64ac5569f232b08a6da326bd": "The story is told from the perspective of a 10-year-old child. The family, a mom, dad, and 2 - 3 children (not sure if it said), had just moved into a house in a predominately Irish area. The dad went out to check on the horses, while the mom went to the store down the road (on Fifth) that was run by Jewish people and open 24 hours. When the kids were home alone, somebody(ies) threw a rock into one of their windows. At this time, the narrator explains how they put their siblings into a room or closet nearby and told them that they would be safe there. The narrator then runs to the store their mom went to and starts explaining what was happening. A police officer arrives and they explain to the police officer what has happened. The police officer tells them that this neighborhood is Irish and that they do not like the new family living in that house because they are black. Since this was 1925, there has been A LOT of outward racial prejudice, racism, and oppression. The police officer told them to move, to which the mom had made him aware that they did not have enough money to move and that they spent all their money on the rent for this new place. The mom then asked to go to the precinct where this officer works and the officer took the mom and child to the precinct. Here, the mom spoke with another officer (possibly a supervisor) about the situation and got a pretty similar response. She reiterated that she had to spend all of the money paying for rent upfront. She also states that they should not have rented to her if they did not want her there and that the realtor should be liable. The police officer also asked the child if they saw the face of the person who threw the rock, to which the kid did not and the police officer stated they cannot do anything without anyone to blame. With this, the mom asked the officer to give them a ride home. The officer took them home in a horse and buggy with bells on it. The bells were being rung as they arrived home (making a \"clang\" sound, as described) and the neighbors were outside watching. The mom and child were let out, walking down the steps from the buggy/carriage to peering eyes. The mom then addressed people in the neighbourhood letting them know that the family will be there for the month since they have already paid, that they do not have enough money to move, and don't know if they will even have enough money for next month's rent. She then posited that if they do not want them to live there, they can raise the funds themselves to move them out. The narrator then continues to explain that nobody raised the funds themselves, speculating that they don't have the money either and that the neighbors were being as \"normal\" or \"typical\" as one can hope. We also learn that the father falls ill. ",
    "6160c8f657e3c4094b01614a": "A family moved into a new neighbourhood, they were a black family, different from everyone else in the area which was composed of irish people. As soon as they moved into the house some locals threw stones through the family's windows causing the younger members of the family to be scared.\nThe mother of the family requested help from the police officer, who was also irish and he wasn't very helpful, he seemed to share the same disdain for the family, though more veiled due to his position. The officers only solution to the familys predicament was to move away, the mother said she couldnt possibly since she has just moved in, paid for a months rent so told the officer and whoever else nearby that was listening that they have no choice but to accept that they will be there for at least a month and if they want them to leave that badly they should pool together enough money so they can afford to move away, they of course didn't do this since they are likely struggling just as much as them.\nRelations within the community got a lot better, when the father became ill, the community was very attentive and helpful.",
    "614b8cd74302e5942b70bde6": "Their father drank and mother went to get food but father didn't come home. I was there with the kids and my mother went out of the house too and then a crash happened and it was a big stone through our window. I went to find mom and I ran to fourth street in a Jewish neighborhood and I found my mom and then we talked to a cop who said you better move out of there it is a bad neighborhood and that he couldn't do anything to help my mom. Mom didn't have enough money to move though so the cops took us home and then mom said she has rented the house for a month so she told the cops that the only way she will move is if they give her the money to do so. Our neighbors were nice though and helped us out.",
    "5954fca53e9d73000192588f": "The child was around 10 years old and had recently moved in to a rented house in a new neighbourhood. The child had been in the house with their siblings. The child's mother had gone to the shop and the child's father had gone to tend the horses. While the parents were away the house was stoned. The child tried to make their siblings safe and then left the house to find their mother.\n\nThey found the mother at the shop and while trying to communicate to her what had happened they were overheard by a policeman. The mother asked the policeman for assistance but he replied there was nothing he could do. He suggested that the family should move to another area (there appears to have been issues with racism in the neighbourhood). The mother advised that moving was unaffordable and went with the child to the police station to seek assistance.\n\nAt the police station the mother confronted another police officer and asked for assistance. The officer declined to investigate as no suspects had been identified. The officer was not prepared to make any effort to investigate or find the criminals. The mother is described as being educated, having completed high school and despite experiencing prejudice and discrimination was not afraid to try and secure her basic rights. \n\nThe mother requested that she and her child were transported back to the property in the police vehicle. The police vehicle was a horse drawn cart with a bell.\n\nOn arriving at the property the mother and child exited the police vehicle and the mother addressed her neighbours who had gathered nearby. She explained the she had paid a month rent and could not afford to move, nor could she afford the cost of window replacement. She acknowledged that despite the difference in her skin colour she had much in common with others in the neighbourhood.\n\nSpeaking frankly appears to have made an impact as the description of how the family were treated after this shows some improvement, especially when the father became ill. ",
    "6318e2c61780455450fe4199": "It was 1930 in the USA. I'm a black child aged 10 and we'd just moved into an Irish neighbourhood. My father had gone out and hadn't returned so we were worried. Suddenly, stones began hitting the windows, so my mother went out to see what was happening, and I went with her. We saw that people were throwing stones at our house. We found a police officer, who advised us to move out of the neighbourhood as we wouldn't be welcome.\n\nWe went to the police station to report the incident. My mother told the office in charge that the police should protect them. He asked if my mother had seen the face of anyone throwing stones. She said she hadn't, so the officer asked how he could punish anyone if he didn't know who to punish. \n\nMy mother asked him to drive us home, so he did. To my admiration, my mother said to the stone-throwers that we'd just moved in to the house and we didn't have enough money to pay to move out, so she asked the people to collectively find enough money to give us so we could move out. People didn't give us any money, but they did leave us alone. However, the whole experience made my father unwell.",
    "5c3cc3bad06aa00001ebc484": "We had just gotten moved to Third and Horton. My mother went to get food and my father left with the horses - to take the pack of horses back. I was alone in the house with the kids. Then they started throwing the stones. I was so scared, I was only 10 years old. I got the kids out of there and ran and ran to Fourth which was a Jewish neighbourhood. Then I found my mother and told her what had happened.She told a policeman what had happened but I was so scared that my voice shook. He said, \"It's an Irish neighbourhood, you'll have to move\". My mother, the smartest person I know, she's the only person I know that completed high school, she went to Lackawanna high school. My mother said she's not moving, we just moved and haven't got any money to move again. The policeman said we had to move. He was Irish himself. The year was around 1925 and times were what they were. My mother told him to drive us home in the patrol car, it went clang, clang a great bell that rang, clang, clang. A crowd of people were on the streets. My mother got out of the police patrol around where the horses came. She told the people that they we didn't have enough money to move and if the people wanted her to move they had to get together and find the money for them to move. We already paid 1 months rent and couldn't afford to move again. Of course that never happened and when my father got sick the neighbours were as nice as could be.",
    "5fb2e72ac95e4c9ab7a082da": "The brief summary of the story is that a family moved into a new neighborhood. When they arrived a stone was thrown into their window. The police arrived and explained to the family that it is because they are in an irish community. and that their kind if not welcome, they are most likely a black family. The cop says there is nothing they can do and suggest that the family moves. The family is in shock and cant believe that this how the police answered them.",
    "55881a68fdf99b1c9154fe4a": "The dad was a drunk and was at home and had to put the furniture in the right place.  Then the dad left and the mum left to go to the shops and they were left with the kids.  Then someone through stones thorough the window.  So they moved the kids to hide so they would not get hurt.  They went through the door but was scared as they did not know what would be thrown.  They went to look for they mom who was at fourth street.  The shops shut late as they wanted to make as much money as possible.  They found there mom and told them what happended it took a while to make her understand.  A policeman was passing and the sound of their voice stopped the policeman.  They told the policeman what happended and he said that it was a bad area the people were irish and they did not like black people.  They should move.  The mum said they had just moved there and could not afford to move.  the Policeman said there was nothing he could do, and the mum said where was the precint so she could find someone who could help her.  At the precint she spoke to the captain, he said there was nothing he could do and she should move.  the mum asked for a lift home and they were taken home by horse and cart and there was a clang noise from the cart.  Once home all the neighbours were watching and the mum asked them why they did what they did, and that she would be here for at least a month, as she had no money to move.  or if they wanted her to move they needed to give her the money to move.  While they were there the dad got sick and the neighbours were kind and helpful",
    "6416d1aad8b7e8743fac6df0": "They moved to third and wantan. Dad was a drinker and mum went to shops on fourth street where there were horses and carts. During this time both parents were gone the neighbours threw stones through the window the narrator took their siblings to the stairwell to keep them safe from the glass. She told them to stay there while she went to look for mother. She found mother and explained what had happened. Fourth street was a lot of Jews but it was an Irish community. A policeman approached and they explained what had happened he said it is because they were black. Mother took her to the police station to do somehting about it. She spent a long time talking there and the police said their was nothing they could do and she should move. She said she couldnt as they had no money and that the police needed to drop them home. The police did to stop the long and tiredsome talking. WHen they arrived home the mother explained to neighbours they would be staying as they had no money and that if the neighbours didn't want them there then they should put money together to pay them to pay eslewhere. FATher got sick while they lived there and the neighbours were nice. ",
    "5f35050d72e95343c64aef66": "we moved down Third and Waton  with our father and mother . My father drank a lot . my mother had gone to get food from the market and my father left us at this new home to take horses back . I was left alone to look after the other kids but there was an awful crash and I went to look , a big stone had been thrown through the window and there was glass everywhere . I got the other kids into the stairway and told them to stay there as I need to go find mum. They were crying because they were scared . I needed to go to 4th street where the jewish shops were . I was 10 year old when this happened . I eventually found mum who went to the police , I was nervous and shaking . The police told mum it was a bad neighbourhood , mainly Irish people. They didn't like black people although the policeman didn't say black but its what he meant , he also was Irish . The police said there's not much we can do about it and asked did I see who did it , I said no that I hadn't seen . he said the only thing to do was move. My mother said we only just moved in and we had no money as we had paid a months rent in advance . we couldn't move . it was Winter and very cold .  Mother said the least you can do is take us home in the police wagon . They took us home and mother told the neighbourhood we would be staying a month at least and that we were just the same as everyone else apart from having a different colour skin . Father got ill during the time there but the neighbour was very good to us .",
    "5ee7b0a316b7d10662171450": "There was a family which was Irish and lived in a place where they were racist towards Black people however nobody was educated there apart from the mother so she had sense. Someone did something and they went to the police station and the neighbours all were scared."
  },
  "segmentation": "1.We moved down to Third and Wharton.\n2.We had gotten moved\n3.but it was like – you remember I told you my father drank,\n4.but it was still day,\n5.and after he had gotten in and put the furniture where it was supposed to go, my mother left, to go to market to get some food to bring into the house.\n6.And my father went to take the horses – take the team of horses back.\n7.But he didn't come home.\n8.He – stopped somewhere on – I dunno,\n9.but he – how he – why he wasn't in the house.\n10.And of course I was left there with the kids.\n11.Well no sooner did my mother get out of the house – my father went first – then – oh it was such an awful crash came through the window.\n12.And I – and I looked and it was a big stone.\n13.And then of course they – they – well they stoned the house.\n14.And I had sense enough to get the kids into the stairway so that they wouldn't get hurt by flyin' glass.\n15.And I said to them, “Now you stay there.\n16.Don't move 'cause nothing will reach you here.\n17.And I'm gonna go and see if I can find mom” –\n18.(We call our mother mom.)\n19.And they were crying\n20.and carryin' on.\n21.I was scared to death,\n22.I really was frightened out of my wits.\n23.And I didn't know what to do,\n24.but I remember saying a prayer as I went out the front door because I didn't know what was gonna hit me when I went out that door.\n25.And I ran –\n26.I was ten years old at the time this happened –\n27.I ran to Fourth street, because I knew my mother wa-\n28.They had push carts in those days, on Fourth street.\n29.And it was a Jewish neighborhood\n30.and they – they stayed open until – until all hours.\n31.Because they would, you know, however much money they could get they wanted.\n32.So uh that's where she was going to do her shopping.\n33.And I finally found my mother.\n34.I did find her.\n35.And while I was trying to tell her what had happened\n36.a policeman went by.\n37.And my voice was such that you could hardly make out what I was saying.\n38.I was so nervous and – and – my voice was shaking so,\n39.and he wanted to find out what ha- what was wrong with me.\n40.And then when he understood what the situation was he turned to my mother\n41.and says, “This is a bad neighborhood.\n42.It's Irish.”\n43.And he said, “They're known to do things like that,\n44.Better move out of there.”\n45.My mother said, “I just moved in, how am I gonna move out?”\n46.He says, “I dunno.”\n47.He says, “But they don't want any black people in there.”\n48.An' he didn't say black 'cause they didn't use black then.\n49.But “they don't want anybody in there.”\n50.So uh, she said, “Well you're the law.\n51.You're supposed to protect us.”\n52.He says, “I can't do anything with it.”\n53.He was Irish himself.\n54.“I can't do anything about it.”\n55.So my mother said um, “Where is the uh precinct you work from?”\n56.And he told her.\n57.I forgot now.\n58.I was right there with her\n59.but I've forgotten where he told her.\n60.So uh she said, “Well if you can't do anything to help me, I'll go see who – if I can't find someone else to help me.”\n61.Well in those days black people were so cowed by circumstances an' uniforms and white people, you know, they uh many times didn't assert themselves.\n62.But thankfully my mother was not one of those kind.\n63.And she – well I always thought of her as an educated person which she was because she was the only one I knew who had completed high school.\n64.She went to Lackawanna high school.\n65.And this was – let me see what year was this happening – well it must have been nineteen twenty-five, so you can see what – what the times were.\n66.And we went – she took me, and we went to the police station.\n67.And they also had police wagons with horses attached to them. Believe it or not in those days.\n68.So my mother said, to the captain, “What are you going to do about it?”\n69.And he says, “Well lady there's nothing we can do about it.”\n70.And she says, “You mean to tell me that I have to live under those circumstances and there's nothing that you can do about it?”\n71.She says – he says, “Well uh the only thing I can tell you to do is to move.”\n72.He says, “Because” – he said to me, “Did you see anyone?”\n73.And I said, “No.”\n74.He says, “Well how can – how can you” – to my mother – “how can you do anything if you don't know who – who to put the blame on?”\n75.An' he says, “I'm sure there was more than one person.”\n76.So my mother said, “Well I don't know what I'm going to do.”\n77.She says, “But one thing I know I'm not going to do is move. Because I have no money to move with.”\n78.They took all we had to, to pay the rent.\n79.In that house you had to pay in advance.\n80.And she said, “If they didn't want me there they should not have rented the house to me.\n81.Now the real estate agent should be accountable.”\n82.So anyhow, she said to him, “Well I know one thing you can do.”\n83.And he says, “What's that?”\n84.She says, “You can take me home.”\n85.He said, “Take you home?”\n86.She said, “Yes in the police patrol.”\n87.So – I guess they figured “Let's get this lady out of here because she's talking loud and long.”\n88.And they had never come up with anybody like that.\n89.So they put us in the police patrol\n90.and they took us home.\n91.We weren't far from – from where it was – maybe Fifth street – from where we had moved.\n92.And – course with the horses and the police patrol, and the clang –\n93.they had a bell that clanged. Clang clang clang –\n94.you know they told you about the trolley that went “Clang.”\n95.Well this police patrol that bell they had, it went “Clang clang clang.”\n96.And um all the neighbors came running out to see what was happening.\n97.And of course they saw the man came around the back –\n98.I can see it right now – from where he was sitting up front there where the horses came around,\n99.and opened the door in the back.\n100.And they had a long door in the back where you had to come down steps to get out the back of the – of this police patrol.\n101.Well we got out of that police patrol –\n102.Before the patrol ever left my mother turned\n103.and faced all those people that were standing around,\n104.and she says, “Why you're doing this to me I don't know.”\n105.She says, “I know that I am different from you, color wise,\n106.but in every other respect I'm just the same as you are,\n107.and all I'm trying to do is provide a home for my family.”\n108.She told them that they had rented the house,\n109.she told them how much money she had paid,\n110.she had told them that was all the money she had.\n111.And they had paid that rent for a month.\n112.She knew she was going to be there for the month.\n113.She did not know beyond the month.\n114.Whether they'd have enough money to pay it for the next month.\n115.But she knew they were going to be there for the month.\n116.She said, “It is winter time and it is cold.\n117.And I cannot afford to be buying windows.”\n118.“Now” she said, “Whoever threw the stones I don't know.\n119.But you can all see what has happened.\n120.And now I'm telling you that we're going to be here for a month.\n121.So you might just as well make up your mind to that.\n122.If you don't want me here then you people get together and give me enough money to move somewhere else, because I do not have it.”\n123.Well of course you know they didn't do that.\n124.They probably didn't have any money either.\n125.So in the meantime – not in the meantime but during, during the period of time that we were there, my father became sick.\n126.And the neighbors were as nice as anybody could ever have been.\n127.When there was trouble they responded just like anyone else.\n128.But that was our welcoming to the neighborhood.\n129.And it was terrible\n130.and it certainly was frightening for me.",
  "recalls segmented": {
    "5fdb96141295b80008c31eb3": "1. This black family moved from a Jewish to an Irish neighbourhood.\n2. When they arrived someone stoned their windows.\n3. As the father was drunk, the narrator ran to find the Mum who they thought would know how to resolve the situation given her schooling at Lackanawny.\n4. The 'Mom' sought and found a policeman on the street.\n5. He said he would like to help but there was nothing he could do even though, or in spite of, he was Irish too.\n6. So they went to the station on 5th and explained the situation, how they had the windows stoned, how it would make their place unbearable in the cold of winter as they had no money to fix it.\n7. The police at the station also said there was nothing they could do but did offer her a ride back in the police wagon, a wagon still driven by horses even though it was\n1925.\n8. They were thankful she accepted as she talked long and hard.\n9. Clang, Clang clang went the bells as they went down the street which caused all the neighbours to come onto the street upon the wagon's arrival to see what the fuss was about.\n10. The mother took the opportunity to explain to those gathered that she had used all the family money to pay a full months rent so she was staying the month, in these cold winter days she was, colour aside, just like them in that she wanted to put a roof over her children's head and if the locals didn't want them there because they were black then they'd have to provide the money for them to move on.\n11. Naturally, this didn't happen, as likely the locals were in the same financial predicament.\n12. However after this episode they became much friendlier, helping out wherever possible in times of need such as when the drunken father became ill.",
    "6460f320e8ba103d47ded9d6": "1. A family moved into a house in a new neighbourhood.\n2. After they had moved in,\n3. the father took the horses away\n4. and the mother went shopping.\n5. While the narrator was at home with the other children,\n6. their house was attacked\n7. and stones were thrown through the window.\n8. Once the narrator had hidden the children\n9. he went to find his mother at the Jewish shop,\n10. which stayed open late\n11. and served anyone.\n12. Once the shopkeeper had heard what had happened\n13. he told the mother that they lived in a bad neighbourhood\n14. and should leave.\n15. The mother said she couldn't leave\n16. because she had used all her money for the first month's rent.\n17. The mother went to the police to complain\n18. and they also told her to leave.\n19. It was an Irish neighbourhood in the 1920s\n20. and, because they were black, they would never fit in.\n21. The mother insisted the police drive her home.\n22. When she got home,\n23. she addressed the neighbours - explaining that she had no money to move\n24. and they were stuck with her for the month\n25. and better get used to the idea.\n26. After that the neighbours were much friendlier\n27. and even helped when the father got sick.",
    "5c8cdc31745b370017d73ece": "1. The child was in the house\n2. when the parents were out.\n3. The father was drinking in the day time\n4. and the mother was out shopping in the market.\n5. They had just moved to a house on third street.\n6. The children were in the house\n7. when someone starting throwing rocks at the house.\n8. The person telling the story ran to find his mum.\n9. They spoke to a policeman\n10. who said he couldn't help\n11. and they would have to move.\n12. The mother said they could not move\n13. and asked where his precinct was.\n14. They went to the precinct\n15. and they said the same thing.\n16. The mother insisted they drive them back to the house\n17. where she told the rest of the neighbours that if they wanted them to move, they would have to give her the money to move.\n18. Nobody did.\n19. The father got sick\n20. and the neighbours were nice.",
    "60479c2017ec4a044c2ed68f": "1. The story was about a family that just moved into a neighborhood.\n2. They were black.\n3. They had troubles with the people in the neighborhood who were throwing rocks at their windows.\n4. The child who was left at home was scared.\n5. He tried to call his mother.\n6. But she did not answer.\n7. He waited until he thought it was safe.\n8. Then he came out of his hiding spot.\n9. His mother got home.\n10. He told her everything that happened.\n11. They then called the police.\n12. The police told them that they could do nothing about it.\n13. They told them because they are black and this is an Irish neighborhood, they should just move out because the circumstances won't change.\n14. The mother was very smart from a very well known high school.\n15. She told the policeman that she will not move because she does not have enough money.\n16. The police insisted on them moving.\n17. She spent the whole time telling them that they don't have any money.\n18. The police then offered to take them home because they were tired of her speaking.\n19. She was the first person who actually spoke out on the situation.\n20. As they were going out, there were people surrounding them telling them that they had to move out.\n21. The mother said that in order for them to move out all of them had to come up with enough money for a month's rent.\n22. They had to pay for that house in advance.\n23. She does not have the money to move anywhere else.\n24. The story ends with the mother, saying that she will stay where she is.\n25. They have to accept that she is there.\n26. Because even if she is black, she is no different to them.",
    "612266e2ea3c172619abba50": "1. The family had recently moved house.\n2. The father wasn’t there\n3. and the mother had gone to the store\n4. when a window in the house was smashed by people in the neighbourhood.\n5. Even though the narrator was scared at what they would find outside,\n6. they left the house\n7. and tracked down the mother at the store.\n8. A policeman heard them tell what had happened\n9. and said it’s a neighbourhood of Irish people\n10. and they don’t want you there because you are black -\n11. he didn’t actually say the word black.\n12. This was in 1925\n13. and the narrator was\n10.\n14. The mother asked which precinct he worked from\n15. and they went there.\n16. She spoke to someone there\n17. who told her she was best to pack up and leave,\n18. which she couldn’t afford to do.\n19. She made them give a lift home with the police patrol\n20. and when they arrived she spoke to the crowd.\n21. She said you don’t want me here but I am paid for a month.\n22. If you want us out then you need to give us the money to go.\n23. Of course the neighbours didn’t.\n24. The mother was educated\n25. and had been to Lackawanna high school.\n26. Later then the dad was ill,\n27. the neighbours rallied round.",
    "60ad5baa456e511fb21ba8fb": "1. This is a story of a family\n2. that moved to a new neighbourhood\n3. and a ten year old is telling us how they were welcomed\n4. by a flock of people\n5. who threw stones in their house\n6. and broke windows.\n7. The ten year old was home alone\n8. with their young siblings\n9. whilst the mom was out to do some late night shopping\n10. in the Jewish shops\n11. that opened until very late.\n12. The ten year old was faced with a challenge\n13. of calming their siblings down\n14. and ask them to hide in a place\n15. where they would not be hit by the stones.\n16. The ten year old later ran out\n17. to look for the mom,\n18. being careful not to be hit by the stones.\n19. They finally found the mom in the Jewish stores\n20. and let her know what was happening.\n21. Whilst the ten year old was trying to tell their mom,\n22. they could not breathe\n23. or even utter the words properly\n24. because due to being frightened.\n25. There were police patrollers around\n26. who kind of understood what the ten year old was trying to say\n27. and they warned the mom about the area.\n28. They advised her to move to another area,\n29. as that area was not \"good for them\",\n30. and according to them people like them(blacks) were not welcomed in the area.\n31. The mother told the patrol\n32. that there's no way that they can move\n33. because they had just moved in\n34. and paid rent,\n35. and the people took their money.\n36. The mom insisted that the police help them\n37. and they told her that there's nothing they can do.\n38. She went to the station with them\n39. and asked them to take them home,\n40. which they did.\n41. Eventually the family felt accepted in the neighbourhood\n42. when their father fell ill,\n43. the neighbours came by to visit them\n44. and sent well wishes.\n45. This all happened within the Irish community\n46. during around 1925.",
    "5e4e95ec6a0f23000c442ed2": "1. A black family move into a new neighbourhood.\n2. The mother and father go out.\n3. They leave the children in the house.\n4. Mom goes to get shopping in the Jewish area.\n5. The father is probably out drinking.\n6. The house gets stoned.\n7. The eldest child moves the younger ones into the stair area.\n8. They move away from the windows.\n9. They do this so they won't get hurt with stones or glass.\n10. He was very scared.\n11. But he left the house to go look for his mom.\n12. He eventually finds her.\n13. He tells her what has happened.\n14. A passing policeman hears.\n15. He says it's a bad area.\n16. He says they should move.\n17. Mom says she has paid rent.\n18. She says she can't afford to move.\n19. The policeman says he can't help.\n20. He says no one wants black people there.\n21. He says it's mainly an Irish area.\n22. The mom is an educated lady.\n23. She says she will go to his station office for help.\n24. She gets them to take her home.\n25. She tells the neighbours she is there for a month.\n26. She says she has no money left to move.\n27. She says they will have to get used to it.\n28. Then the father gets sick.\n29. The neighbours are nice to them.\n30. They help the family.",
    "6116c9e9f3490c79002fda6e": "1. The day that she moved into Third and Wharton,\n2. when she was 10,\n3. her father left to return the team of horses\n4. and her mother went to do shopping on Fourth.\n5. Some people began to throw stones through the windows of the house they had rented.\n6. She took the other children into the stairway\n7. and told them to stay there\n8. because they would be safe from flyin' glass.\n9. She left the house,\n10. and prayed,\n11. not knowing if they would throw things at them.\n12. She found her mother shopping\n13. and explained what had happened.\n14. A police officer came over and asked.\n15. He said that the neighbourhood was bad\n16. and they were likely Irish.\n17. He was also Irish.\n18. He said he couldn't do anything.\n19. Her mother asked what precinct he was from\n20. and he told her,\n21. although the narrator didn't remember.\n22. Likely on Fifth.\n23. The captain was told the story\n24. and also said he couldn't do anything\n25. because the girl didn't see who threw the stones,\n26. and it was likely a number of people.\n27. Both the original police officer and captain suggested the family move out,\n28. because black people were not welcome there.\n29. But her mother refused,\n30. as they didn't have any more money,\n31. having rented the home for one month with all their money.\n32. She told the Captain to take them home in the Police Patrol,\n33. which had a clanging bell\n34. and was pulled by horses.\n35. As they got home a crowd had gathered.\n36. Her mother came out the long door in the back\n37. and confronted the crowd,\n38. saying that despite being a different colour she was the same as them\n39. and was staying at least a month,\n40. couldn't afford new windows,\n41. and if they wanted her to leave they had to give her enough money to go live somewhere else.\n42. The crowd did not do so.\n43. While they lived there,\n44. her father got sick,\n45. and the neighbours were very helpful and friendly.\n46. But her welcome to the neighbourhood had been terrifying.",
    "5bad47432b86390001ccda32": "1. Something about a black woman\n2. who was being attacked in her own home\n3. with a brick through the window,\n4. she went to the police\n5. and they told her\n6. there was nothing they could do.\n7. He told her to move,\n8. she said\n9. i can't afford to move\n10. as i have no money.\n11. I dont remember\n12. anymore of the story\n13. sorry.",
    "6466249c27b5e4161f763c32": "1. The story was about a woman\n2. who was trying to live in an apartment.\n3. When she was trying to pay the rent\n4. the owner didn't like her\n5. cause she was black.\n6. There was some type of altercation\n7. and the police were involved.",
    "56c9e4d9b30699000bd974a5": "1. A boy tells a story about being 10 years old.\n2. At this time he and his family have just moved to the area.\n3. He is looking after younger siblings.\n4. The father is a drunk.\n5. The mother is at market.\n6. Stones are thrown through their windows.\n7. The boy is able to get his younger siblings to safety away from broken glass deeper inside the house.\n8. He goes to find his mother at the market.\n9. But at the market, he meets a policeman.\n10. He explains the situation.\n11. We learn that it was a racially motivated attack.\n12. The mother complains to the police about not being able to protect them.\n13. She then gets a lift home from the police.\n14. She lambasts her neighbours.\n15. They come to accept her.\n16. But the father of the family grows ill.",
    "63780dcb8171e255fe423b28": "1. It was 1925\n2. the person who was telling the story was 10 years old.\n3. The father was a drunk.\n4. When mother (mom) went to the market on fourth street for food\n5. a stone was thrown through the window of the house they were renting.\n6. 10 year old who was looking after the kids put them in the stairwell to keep them safe\n7. while he / she went to look for the mother.\n8. Mother was found\n9. and before he/she could speak to her\n10. a policeman asked what was wrong.\n11. When he explained\n12. the policeman said it was an Irish neighbourhood\n13. and they did not like blacks\n14. and there was nothing he could do to help.\n15. The mother was not happy with the response\n16. and went to the police station to ask for help.\n17. No help was given\n18. however she asked to be taken home in police patrol wagon with horses\n19. which the police did.\n20. Bells on the horses alerted their neighbours in their street - fifth street\n21. and came out to see what was happening\n22. mother explained about the stone through the window.\n23. She explained she could not move out as she had no money\n24. as she had spent it on months rent\n25. but if they wanted the family to move they could pay their rent for somewhere else.\n26. Neighbours could not afford to do this.\n27. The father got sick\n28. and the neighbours helped the family.\n29. The 10 year old was very terrified and scared by the experience.",
    "6362aa281270ea7fc6656dc7": "1. The dad was a drunk.\n2. He took the horses out one day.\n3. (He) never come back.\n4. The house the mother and children moved to was targeted because of her skin colour.\n5. Mum was out one day.\n6. Children was in the house.\n7. There was a loud bang.\n8. Someone had thrown a stone through the window.\n9. The oldest child (I think) got the kids into the hall way.\n10. (She) told them to stay there while she went to find mum at the shops.\n11. There was glass everywhere.\n12. The people had take all the money from the house.\n13. So she had no money left to afford to fix the window.\n14. When the oldest child found mum at the shops she couldn’t explain what had happened.\n15. But at the time a police officer was near by.\n16. So they explained what had happened.\n17. He said nothing they can do.\n18. They advised her to move as the itish clearly didn’t want them there because of there skin colour.\n19. The officer was Irish himself.\n20. The mom wasn’t happy with this response.\n21. (She) wanted to take it further.\n22. So she headed to the police station.\n23. Although they told her exactly the same thing.\n24. Mum expressed it they want her to leave they can give her the money to do so.\n25. This didn’t happen.\n26. So she had to stay there.\n27. The police give her a lift home as mum requested.",
    "5d72162aef8b6c00019e19a9": "1. They moved into a new home on third and Wharton,\n2. the mother went shopping\n3. and the father also left.\n4. the10 year old was left in charge of the younger siblings.\n5. The neighbours began stoning the house\n6. so the10 year old hid the other children in a safe place\n7. and went to look for the mother\n8. who was shopping in a Jewish shop.\n9. The daughter told her mum what happened\n10. in ear shot of a police officer\n11. who said he couldn’t do anything\n12. as they had moved into an Irish neighbourhood\n13. and they didn’t like black families moving in.\n14. Mum spoke to the neighbours\n15. and said she was just like them trying to provide for the family.\n16. She couldn5 afford new windows\n17. or to move elsewhere\n18. she said to the neighbours if they didn’t want her there they could do a whip round\n19. as she couldn’t afford to move.\n20. The neighbours eventually b3came helpful\n21. and helped when the father became I’ll.",
    "5bc0941074e76c00019e9479": "1. This was a tale of a Neighbourhood incident\n2. that caused the windows to the property of a new tenant Family to be broken\n3. the area was in an Irish enclave close to that of a Jewish community\n4. and although the mother of the family had reported the incident to the local Police,\n5. without the ability to name or identify the culprits\n6. there were no charges brought forward\n7. The family was Afro-American\n8. and living in a white Anglo-Irish American area\n9. but once the Mother had confronted the neighbours with her financial plight and her circumstances\n10. a sense of community provided support\n11. when the father of the family was sick.",
    "60bbac6c8f57c38f1b834e80": "1. We had moved to third and Wharton.\n2. My mother went to the shops to get food for the family.\n3. My father had gone to fetch the team of horses.\n4. Then we heard a loud thunder.\n5. It was a stone.\n6. So I told the kids to go under the stairways.\n7. They could not get hurt.\n8. They cried and carrying on.\n9. I told them not to move.\n10. Stay there as I needed to go and get my mother.\n11. I was so scared as I went to the door.\n12. I did not know what was gone be thrown at me as I opened the door.\n13. I went out run to the fourth street.\n14. It was not far from where we had moved to.\n15. I found my mother.\n16. The policemen passed by.\n17. I told him what had happened.\n18. He said he could not help us with anything.\n19. He said we should move.\n20. He insisted that he could not help us.\n21. They people in that area were Irish and did not want black people there.\n22. My mother said we should go to the police station to find someone who could help us.\n23. The officer in charge said he could not help us as well.\n24. My mother asked the police officer to take us home with their cart which had a bell which goes clang clang clang.\n25. So when we approached our area everyone rushed outside to see.\n26. When the door was opened for us a lot of people where standing outside.\n27. My mother addressed them.\n28. My mother told them how much we were charged for rent.\n29. She said if they wanted us to move they can all contributed money.\n30. So that we could move.\n31. No one contributed.\n32. From then there were nice to us.\n33. But the welcome was frightening.",
    "5f4560c565e28d13e5dd5d56": "1. It's a story about a boy\n2. who recently moved to Third and Wharton with his mother.\n3. That day his father was drunk\n4. but he had put the furniture where it was supposed to be.\n5. His left to go to the market\n6. to get food that they would eat.\n7. His father took the horses\n8. but he didn't come back home.\n9. At that time the boy was left alone at home with the kids.\n10. People threw stones into the house through the windows.\n11. He took the kids to a safe place.\n12. The boy was scared\n13. and he took the phone to call his mother.\n14. He prayed for their safety.\n15. The boy was ten years old when this happened.\n16. He ran to Fourth Street to look for his mother.\n17. It was a Jewish neighborhood.\n18. He found his mother on the way\n19. but couldn't talk as the police man appeared.\n20. The police man asked the mother's boy to move out of the neighborhood\n21. because it was dangerous,\n22. they don't want black people there.\n23. His mother refused\n24. and told him that they have just moved in.\n25. The police couldn't help his mother.",
    "5e283f576dbb560114ac7714": "1. We moved house down to fifth and Burnham.\n2. We started moving the furniture.\n3. My father said it would not all fit.\n4. We got it in.\n5. My father went to take back the horses after we finished with them.\n6. He had not returned.\n7. My mother went to look for him.\n8. In the meantime some people came and smashed the windows of the house with rocks.\n9. Luckily none of us got hurt.\n10. After that I went to find my mama.\n11. She was near by.\n12. After that we made it to the local police and asked for help.\n13. They said that there was nothing that could be done as we had not seen anybody and didn't even know how many people there was.\n14. My mama ended up just asking for the police to take us home.\n15. They agreed to.\n16. When we got back all the local Irish community gathered round.\n17. Then my mama spoke telling everybody that she might be black but she is just the same as everybody else in the area.\n18. She and her family were not going to move out as they had no money left.\n19. Everybody started to treat us as normal after that.\n20. Even helping us out when my father was sick.",
    "5e13b302a2c6969f3c5d2485": "1. The child was at home\n2. when a brick was thrown through the house of the window\n3. scaring the other children in the house.\n4. The parents were away from the house at the time\n5. and so the youngster left the house to find them.\n6. The mother was shopping at the time\n7. and she asked for help from the police\n8. who were less than helpful,\n9. told her that as she was a Black family they were not welcome in what was an Irish area\n10. and told her to move.\n11. She explained that she had just moved in\n12. and had done so using a real estate agent\n13. who had been happy to take her money\n14. and she now had no money with which to move.\n15. She then insisted that they be taken home by the police patrol.\n16. Upon arriving at the house they were greeted by the neighbours\n17. who she assumed had thrown the brick.\n18. She addressed them\n19. and explained that she could not afford to repair the windows\n20. and that winter was coming\n21. and requested a stop to this.\n22. She told them that she had paid for a month\n23. and after that she wasn't sure of their plans\n24. unless they were going to pay to have her leave she was staying,\n25. so that was that!\n26. Not long after the father became ill\n27. and the neighbours were kind to them.",
    "60a2be69eb4d3bcbff354d5d": "1. We had just moved to Third and Warton.\n2. The neighborhood was Jewish.\n3. My mom had just went to the market so I stayed with the kids.\n4. I was ten years old at the time.\n5. Clang clang clang.\n6. The people in the community threw stones at our windows and they got broken so I searched high and low for my mother.\n7. When I had explained to her what happened she reported it to the police officer.\n8. The police officer said there's nothing much he can do.\n9. He suggested we move.\n10. But my mom told him that we had just moved from where we were staying and now we should move again because this community doesn't like the color of our skin.\n11. She told him that we are the same people just a different color of skin.\n12. She continued to tell him how she paid a month's rent so she's not moving.\n13. If these people want her to move they should give her money to do so because she doesn't have any.\n14. She also said that the agent should've not taken her money because she knows how this community will react to our family staying there.\n15. The police officer told my mom that the people of this community don't have money either and therefore can't give any to her so she can leave.\n16. My mom said she will stay the entire month because she paid for it.\n17. The community will have to accept them.",
    "5fb402a66cba9801673f2b5c": "1. We were at third and wharton\n2. and father had gone out\n3. and mother had gone to the market to buy some food.\n4. I was in the house with the children\n5. and people started throwing rocks through the window\n6. and there was a big crash.\n7. I realised what was happening\n8. and put the children under the stairs to shelter there.\n9. Mother had gone to fourth street to buy food at the market.\n10. It was a jewish market\n11. and they were open all hours to make as much money as they could.\n12. I decided to go find her at the market,\n13. I didn't know what was going to happen when I got outside\n14. so I said a prayer\n15. and then ran all the way there.\n16. When I got there I found her\n17. and I was trying to tell her what happened\n18. but I was so upset my voice was such that she couldn't understand.\n19. While I was there a policeman walked by\n20. and stopped to see what was happening\n21. and we told him.\n22. Mother said what are you going to do about it\n23. and he said the only thing to do is to move.\n24. She said I'm not going to move because I only just moved there.\n25. He said it's an Irish neighbourhood\n26. and they dont want any black people there.\n27. Well he didn't say black,\n28. he just said they don't want anybody there.\n29. She asked him what precinct he is from to find someone else who would help us\n30. and he told us but I can't remember where it was.\n31. We went there and spoke to the captain\n32. and said what are you going to do about it\n33. and he said nothing\n34. and said you have to move, same as the other policeman.\n35. Mother said well I know one thing you can do\n36. and that is to take us home.\n37. The policeman took us back to the house from about 5th street\n38. and when we got there he got out and helped mother down from the door.\n39. All the people were there standing outside\n40. and she said to them you all know whats happened\n41. and I don't know who did it\n42. but I do know I'm not going to move.\n43. I just moved in here and spent all my money to rent this house for a month\n44. and don't have any more money.\n45. You might as well make up your minds that I will be here for this month\n46. and if you want me to move then you all can put your money together for me.\n47. It is winter and cold\n48. and I don't have any money to be buying windows.\n49. I don't even know if I will have enough money to stay here for another month.\n50. After that the neighbours we very friendly\n51. and my dad got sick while we were living there\n52. and everyone wanted to help us\n53. and was kind.\n54. That was my introduction to the neighbourhood\n55. and it was terrifying.",
    "5e9ffcf4db51941ad78e04f3": "1. We moved to Forth and Wharton.\n2. My father drank.\n3. He took the horses.\n4. My mother went to the shops and left me with the kids.\n5. Stones broke to windows and I took the kids somewhere safe and then went to get my mother.\n6. I was 10 years old and did not know if I would be hit.\n7. The shops were open late and I reached my mother.\n8. I could hardly tell her what happens my voice failed me.\n9. A policeman came and said that he could do nothing it was a bad neighbourhood Irish and they did not like black people.\n10. We should move out.\n11. My mother who was educated and had finished High School said she had only just moved in and could not afford to move out.\n12. She wanted to know where the precinct was.\n13. The Captain she spoke to said that he could do nothing.\n14. My mother said that one thing they could do is give us a lift home in a police wagon.\n15. We went back in a police wagon that went clank, clank, clank pulled by horses.\n16. When we got home my mother addressed the crowd saying that she had only just moved in and had paid the rent so had nothing left.\n17. If they want her to move out they should pay her rent.\n18. They did not do that.\n19. Later my dad fell ill and the neighbours were really nice.",
    "60fe26abdb9284fdf954f6df": "1. We moved in to Third and Warton\n2. and not long after my dad got drunk\n3. and went out back to try and take the horses out.\n4. My mother had gone to the store to get some groceries on Fourth,\n5. not long after my mom, we call mother mom had gone to the store\n6. and my father had gone out\n7. there was stones being thrown at our house,\n8. I quickly moved my siblings to hide under the stairwell,\n9. I told them \"Do not move because you will be safe here and no stone will hit you\".\n10. I was very frightened\n11. but prepared myself to go look for my mother,\n12. but was not sure what would happen immediately I stepped through the door\n13. and ran to Fourth as that's where the carts where being pushed,\n14. I looked for my mom and found her\n15. and while trying to explain what had happened, a police officer happened to pass by,\n16. so after I composed myself a bit,\n17. I explained to him what had happened\n18. and all he could say to my mother and I was \"You have to move\"\n19. the town is Irish,\n20. my mom being angry and asked how he could say something like that\n21. and explained we had only moved here recently\n22. and she doesn't have money to move again.\n23. The officer said he could not do anything as it sort of a norm here as we are black,\n24. he didn't say black because they didn't say that then but that's basically what he meant,\n25. the officer was Irish as well.\n26. My mom angrily asked for his station and to speak to the captain.\n27. We went over to the police station which wasn't too far from where we were,\n28. it was on Fifth.\n29. We entered and demanded to speak to the captain,\n30. we explained the situation and he basically said the same thing as the police officer.\n31. I was surprised and impressed by my mom,\n32. she stood her ground as she was more educated having gone to school in nineteen twenty-five.\n33. She explained to the captain that we have only moved here and have no money to go someplace else,\n34. and he said there was not much he could do as there was no one to blame,\n35. he also asked me if it was possible that there have been multiple people, which would make it harder to but the blame on someone.\n36. My mother suggested arresting the real estate agents as they sold the property to her despite knowing the situation in the town.\n37. My mother then said the least they could do was to drop off home\n38. and since the captain was tired of us being there because the conversation was long and loud he agreed.\n39. We went into the station patrol vehicle that had a bell attached to it\n40. and made a  \"Clang clang clang\" sound as we moved,\n41. during the journey, due to the bell a number of people came out of their homes to watch what was going on.\n42. When we reached our house, my mom turned to address the people watching,\n43. she said we had just moved here and paid money for rent for the month\n44. and that we were going to stay for the month\n45. and that after that she didn't know,\n46. she also told them apart from the colour of their skin they were all the same people\n47. and that they should get used to us being here.\n48. She also suggested that if they all really wanted us to leave they should donate money for the family to move somewhere else,\n49. which they didn't because they probably didn't have any money either.\n50. After that day, everyone seemed to be nicer\n51. and even when my dad was sick they helped and offered whatever they had just like anyone else would.\n52. It was all good\n53. but my first initially welcome to that area was terrible!",
    "5a86e1a4eea3d300016e7981": "1. The family had moved into a new neighbourhood\n2. and had paid the rent a month up front.\n3. The father had gone to tend to the horses\n4. and then some people came\n5. and threw stones at the house.\n6. The family were all afraid\n7. and so they fled.\n8. They asked for help in a Jewish neighbourhood\n9. and then were directed to a police station.\n10. The police were unhelpful initially\n11. and told the family the solution was to move.\n12. The mother explained that due to financial reasons this was impossible.\n13. She insisted that the police take them home\n14. and so they rode in the back of the police wagon with the bell clanging.\n15. They arrived home\n16. and climbed down the back steps of the wagon\n17. to be met by several neighbours watching.\n18. The mother gave an impassioned speech about how, despite their colour they were just the same as everyone else.\n19. This changed people's opinions\n20. and they then helped and supported the family\n21. even when the Father became ill.",
    "5fcfc5d2efeec61409aa6cf7": "1. It happened in\n1925.\n2. The narrator was\n10.\n3. The father was day drinking and out of the house,\n4. after he'd moved their furniture into the house.\n5. The mother was out shopping.\n6. A rock crashed through the windows of the house.\n7. The children hid in the hallway to avoid the glass.\n8. The oldest of the children ran out of the house to Fourth Street,\n9. where the mother was.\n10. There, they found a policeman.\n11. He told them that this was a bad neighbourhood,\n12. and that they should move.\n13. He was Irish.\n14. The mother told him that they didn't have any money to move,\n15. and they had just moved into the house.\n16. He said there was nothing he could do.\n17. She was a smart black woman,\n18. the only one in her family to have finished high school.\n19. She asked where the nearest police station was,\n20. so that she could ask someone who would be able to do something.\n21. At the station, she got the same answer:\n22. that there was nothing to be done,\n23. except move.\n24. She then told them there was one thing they could do:\n25. to drive them home in the patrol car.\n26. They did.\n27. The car made such a clanging noise\n28. that all of their neighbours came out of their houses to see what was happening.\n29. When she got out of the police car,\n30. the mother announced to the neighbours that she knows she looks different due to having different skin colour,\n31. but that they could only afford to stay in the house a month.\n32. Perhaps they would get enough money to afford to stay another month,\n33. but in the meantime, the neighbours only had to put up with them for a month.\n34. She didn't know who threw the rock, she told them,\n35. but it was winter and it was cold,\n36. and she couldn't afford new windows.\n37. She said that she had no money to move right away,\n38. but if they wanted, the neighbours could give her the money to move.\n39. They didn't do that,\n40. but afterwards, when the father got sick, they were kind and courteous to the family.",
    "5f6c238ed9915e19408f161b": "1. A black family moved to an all white neighbourhood\n2. and someone through a stone through their window in protest.\n3. The mother went to the police station to complain\n4. but they didn't want to do anything\n5. since it was a white irish neighbourhood.\n6. The mother was upset after paying a month's rent,\n7. knowing she and her family would have to stay\n8. so she told the police to escort her home\n9. so the neighbours would all come out to see her with the police\n10. (there was a loud bell attached to the police wagon\n11. so all neighbours heard it\n12. and came outside to watch)\n13. When the neighbors were outside\n14. the Mom announced that she had no money to move\n15. so the neighbours could give her money to move\n16. or put up with them.\n17. In the end the neighbours came around\n18. even being there for the family when the Dad got sick,\n19. but it was a scary beginning to moving into the white neighbourhood\n20. for this black family.",
    "5c4f30828f1259000172240d": "1. The story is about a ten year old child in a Black family in\n1925.\n2. One day they come home,\n3. and after their parents go out\n4. (their father to fetch some horses,\n5. their mother to shop at the local Jewish market which stays open late),\n6. someone throws a stone through the window of their home,\n7. smashing the glass\n8. and scaring the child and their siblings.\n9. They go to find their mother,\n10. and encounter a policeman.\n11. The child and their mother complain to the policeman about what happens;\n12. the policeman blames the Irish neighbourhood,\n13. being Irish himself,\n14. and attributes it to them not wanting Black neighbours.\n15. He says he can't do anything about it,\n16. so the mother insists on attending his precinct,\n17. and speaking to his captain.\n18. The captain also claims not to be able to help,\n19. so the mother asks him to drive them home in the patrol vehicle.\n20. They're dropped off near their home,\n21. the noise of the vehicle draws out their neighbours,\n22. and she addresses them all,\n23. telling them that if they don't want her and her family there,\n24. they should pay for them to move house,\n25. as she can't afford it,\n26. and will be there for at least a month.\n27. Thereafter, the neighbours are kind to them,\n28. especially when the child's father is sick,\n29. but the child holds onto the memory of that frightening welcome to the neighbourhood.",
    "5c6088630112a60001a2b1e7": "1. A man is recalling a time\n2. when, as a ten year old, having just moved to a new rental unit in an Irish neighborhood.\n3. He's alone\n4. and his mom is at the market\n5. and stones start to fly through the windows.\n6. He hides his siblings under the stairs\n7. and runs out to the market to find his mother.\n8. She approaches a police officer\n9. who tells her that black people aren't welcome in Irish neighborhoods,\n10. and that there's nothing he can do.\n11. She tells him that she will go to the precinct\n12. and find someone who can help.\n13. The man recalls her mother as being unusual among black people of the time\n14. in that she was not afraid to confront authority or people in uniforms.\n15. When she talks to the police chief at the precinct\n16. he repeats the same advice- to move\n17. and that he can't help her as she hasn't identified the suspect.\n18. She tells him all her money has gone to rent\n19. and she can't afford to move.\n20. She asks for a ride home,\n21. and the officer agrees.\n22. She confronts her neighbors,\n23. tells them she's paid for a month\n24. and can't afford to move anywhere else,\n25. and that she will not be moving,\n26. and can't afford new windows.\n27. She reminds the neighborhood that she's fundamentally the same as them despite her difference in color-\n28. that she's trying to look after her family\n29. and make ends meet.",
    "5f933255e25f2b0e6f794a54": "1. A family moved into an area\n2. that I presume to be white.\n3. They were a family of colour.\n4. There were horses involved at the start of the story.\n5. Their house, which was rented,\n6. was damaged by stones\n7. which they didn't have the money to fix.\n8. They had enough money for one month,\n9. paid in advance.\n10. After being brought home by police,\n11. the family confronted the neighbours\n12. who were watching their return\n13. and stated that if they were not wanted in the neighbourhood,\n14. they could all scrape together some cash for them to move.\n15. This didn't happen,\n16. and while they were living in the property\n17. the father became sick\n18. and all the neighbours were nice to them.",
    "60a2df32808ac76c056b37b9": "1. A black family moved into an Irish neighborhood.\n2. While they were moving their stuff in the house,\n3. The mother decided to go buy food at a store\n4. while the children stayed with the dad.\n5. While the dad was busy with the horses and packages\n6. the children had a crash.\n7. Someone was throwing stones at their house.\n8. The older child quickly ran with the younger children\n9. and hid them\n10. and told them to stay there\n11. as it was safe from glasses\n12. and them being hurt.\n13. The older boy was very frightened\n14. but he bravely went out to go look for his mother.\n15. He knew his mom went to a local shop at long street\n16. that opens for long hours to get maximum profit.\n17. When he got there\n18. he tried explaining to his mom what happened\n19. when a policeman noticed the commotion.\n20. He went to them\n21. and asked what the matter was.\n22. The child explained everything\n23. and the policeman told him there's nothing they could do\n24. as it is an Irish neighborhood.\n25. He also told her that they would not even know who to put the blame on\n26. as they didn't know who threw the stone.\n27. He told him the best thing he thinks they should do is move out.\n28. The mother was upset\n29. and told the man he is not going to do that\n30. because she used the last money she had on paying rent.\n31. The mother asked the policeman to be taken home\n32. and the man escorted them back home.\n33. When they got home\n34. they found a crowd facing her house.\n35. When they were heading to their new place\n36. the mom faced the crowd\n37. and told them she has nowhere else to go\n38. and has no money to move out\n39. but if they had money they can contribute to move them out.\n40. She told them she is just as the same as them\n41. besides the color of her skin\n42. and it should not matter.\n43. During their time there\n44. the father got sick\n45. and the neighborhood was extremely nice\n46. but the child still remembers the first day as very frightening.",
    "5ea166af93435d0008a8a341": "1. We moved to Lackton on fourth street.\n2. Well, my father was a drunk and went out.\n3. Then my mum went out too and I was looking after the kids.\n4. Then there was a mighty crash and a brick came through the window.\n5. I didn't know where my mom was, I was only 10, but I guess she had gone shopping in the Fifth.\n6. It's a Jewish quarter and they stay open all hours, you know, to make money.\n7. I found my mom and told her what had happened.\n8. She found a policeman, who was Irish, and said that the Irish were dangerous and he couldn't do anything.\n9. My mom asked him to take her to the police station where they still had wagons pulled by horses.\n10. She found the commissioner who asked her if I'd seen who dunnit.\n11. I hadn't and he said there was nothing he could do.\n12. They don't like black people round here.\n13. My mom was strong and didn't accept that.\n14. She told the commissioner to take her home in the police wagon.\n15. When they got back to fourth street she stood on the steps of the wagon and said 'Look here I've paid my rent for a month, its all we have and we are not moving.\n16. If you want us to move then give us a months rent'.\n17. They didn't have any money either.\n18. Then dad came back and became sick.\n19. They were nice to him and cared for him.",
    "62d7e6e7eb53424768b99d3b": "1. Girl aged 10 moved to 3rd & Warton with her mother, father & kids presumably the siblings.\n2. Father drank.\n3. As soon as they had moved in the mother went to a shop.\n4. The father went out.\n5. A crash sounded & a big stone came through the window.\n6. I moved the kids and told them to stay there.\n7. I was scared to death but ran out thinking something might hit me.\n8. I ran to the shop.\n9. It was owned by Jews & stayed open late.\n10. I found my mother was telling her what happened & a policeman was there.\n11. I tried to tell my story.\n12. He told my mother it was a bad Irish neighbourhood.\n13. Policeman was Irish too.\n14. My mother asked for a lift home in the police wagon.\n15. It was 1925 she was black but not cowed by authority.\n16. As she went to school we got a lift in the police wagon with the horses and the bell clanging.\n17. We made a lot of noise.\n18. The policeman told us to move.\n19. My mother said she had no money.",
    "5f107aa051372032695c8e2f": "1. In 1925 a black family moved into an irish neighborhood.\n2. One day, while the mother of the family was out shopping, the other people in the neighborhood threw rocks at the black family's house.\n3. The oldest of the children got the other kids away from the windows,\n4. and then, after saying a prayer to himself, ran out the front door to go find his mother.\n5. He found her in the market and told her what was happening.\n6. When she tried to explain things to the police, the police said that they couldn't do anything about it as there were no witnesses who could identify the culprits.\n7. The police also added that she shouldn't have moved to an irish neighborhood in the first place.\n8. After hearing this she said they had no choice,\n9. and that they were there until the end of the month at least.\n10. After asking the police to take her and her son back to her house, she explained this again to the crowd gathered around outside.\n11. After that incident the neighbors treated them like any other family in the neighborhood,\n12. and though the father of the family got sick during their time there, there were no other incidents while they lived in that house.",
    "605ba57d2842d8291b4afd24": "1. The writer and family moved to a new neighborhood.\n2. On the day they moved,\n3. after the father had put the furniture inside the house,\n4. left to drink,\n5. but that was after the mother had already left to go and do shopping.\n6. When the parents were gone,\n7. someone or some people in the neighborhood threw stones to their house.\n8. The writer, who was 10 years old at the time,\n9. took her siblings to hiding to try and protect them.\n10. She then left to the store to tell her mother what had happened.\n11. While doing that,\n12. the policeman came,\n13. and she tried to explain what had happened.\n14. He told them that they had to move,\n15. the neighborhood is Irish,\n16. and they don't want people of color.\n17. The mother said that they would not move just because they are black.\n18. The policemen then took them home\n19. and all the neighbors came out when they saw the police horses and heard the bell.\n20. The mother addressed them\n21. and told that if they wanted her gone, they would have to give her money, otherwise she is not going anywhere.\n22. They continued to live there\n23. and the Neighbours started to help even when the dad got sick.",
    "63d66d856ec54ad9b9cfa338": "1. We moved to third,\n2. and my father drank\n3. and he went out\n4. and then my mother went out to get some food.\n5. As soon as she had left\n6. someone threw a stone through the window\n7. and I put the other children by the stairs\n8. and I said that they should stay there\n9. because they would be safe there.\n10. I was frightened\n11. but I went out.\n12. My mother came back\n13. and she saw what had happened\n14. and the police came\n15. and the police said that this was a bad neighbourhood\n16. and we should move.\n17. He said it was an Irish neighbourhood\n18. and that the Irish did not want us there.\n19. And my mother went to the police station with them in a police patrol with a horse.\n20. And she said to the officer that she could not move\n21. because she had no money\n22. because she had to pay the rent in advance.\n23. And she said that if the neighbours did not want us there\n24. then they should not have taken the rent in advance.\n25. And she said to the police what are you going to do,\n26. but the police said there was nothing they could do.\n27. She said there was something they could do,\n28. they could take her home in the police patrol\n29. which they did.\n30. All the neighbours came out\n31. because they heard the noise of the patrol\n32. and my mother said that it was winter\n33. and she did not have the money to pay for windows.\n34. She said that all she wanted to do was to look after her family\n35. and that she had paid in advance\n36. and she did not have any money.\n37. After that the neighbours were nice\n38. and they were nice when my father was ill\n39. but at the start they had not been nice.",
    "63f88d4dc904d13656486166": "1. Mention of third and wharton street.\n2. A location,\n3. There was banging and stones smashing windows of their home.\n4. The main story teller got her siblings together to a safe place in the house to be protected from the glass.\n5. The father had left the house,\n6. The mother had gone out.\n7. The kids were crying.\n8. The story teller went looking for her mother nearby, fourth street.\n9. There was shouting.\n10. They found their mother.\n11. She told them what has happened.\n12. It unfolded in the story they were of black decent.\n13. Mention of the time of\n1925.\n14. The word black was not used.\n15. The mother wanted help,\n16. The police officer was irish and he could not help.\n17. He advised they wanted her to move,\n18. She couldn't she did not have enough money.\n19. She paid in advance for the month so she would be there at least the month.\n20. The officer told her they didn't see anyone so she could not blame,\n21. She wanted more help from the precinct.\n22. They explained they couldn't and wouldn't do anymore.\n23. It was not a good neighbourhood and she should leave.\n24. The story teller recited the conversation between their mother and officer.\n25. The mother demanded to be felt safe or protected,\n26. This was not going to happen.\n27. She asked to be taken home,\n28. They went by horse and cart.\n29. The loud sound of clang clang clang filled the dark streets and people came to see.\n30. She wanted the neighbours to pay so she could move if they wanted her gone.\n31. It was a sad recall of colour.",
    "5d0bedd29d49670018383c20": "1. They moved to Third and Walden.\n2. I was around ten at the time.\n3. It was\n1925.\n4. My father went out of the house.\n5. My mom had left to go to the market to do some shopping.\n6. Stones were thrown at our windows.\n7. The stones smashed all the glass.\n8. I moved the kids to the stairway.\n9. I moved the kids to keep them safe.\n10. They were crying.\n11. They were very scared.\n12. I left the house.\n13. I found my mom at the market.\n14. She told a police officer what had happened.\n15. They told her that the Irish do not like black people.\n16. He did not specifically use the word black.\n17. The police man told her that they could not do anything.\n18. The police man told her that she should move.\n19. The police man was also Irish.\n20. My mom said that it is their job to protect them.\n21. My mom went to the police station.\n22. They also said that they cannot do anything.\n23. They said that they should move.\n24. My mom said that we cannot afford to move.\n25. My mom said that if they were not going to do anything they should at least take them home in the police patrol wagon.\n26. The wagon was pulled by horses.\n27. The wagon clanged.\n28. The police took me and mom home.\n29. The neighbours watched us return home.\n30. The wagon clanged down the road.\n31. My mom told the neighbours that she does not know why they have smashed her windows.\n32. She said that even though she is black so different in colour she is otherwise just the same as them.\n33. She also said that they do not have the money to move.\n34. The rent is paid in advance.\n35. She had paid for the month.\n36. She does not know if she can afford next month.\n37. She will be there for at least a month.\n38. She said that if they want her to move then they should pay for her to move.\n39. Later on my father then got sick.\n40. The neighbours treat us the same.\n41. The neighbours helped as they would with any other neighbour.",
    "5a52669aacc75b000179c9b4": "1. The father drank.\n2. The mother went to the shops after moving the furniture into their new home.\n3. They rented it.\n4. It was\n1925.\n5. It was an Irish community.\n6. That community did not want black people there.\n7. The house got stoned.\n8. The window smashed.\n9. The girl went to find her mother.\n10. She wanted to tell her mother she was in a Jewish shopping area.\n11. It opened late.\n12. The Jewish people could earn as much money as possible.\n13. They went to the police station to report it.\n14. The policeman said there was nothing he could do.\n15. He was Irish.\n16. She said escort me home.\n17. All the neighbours will see.\n18. When she got home she told all neighbours she had paid one month's rent upfront.\n19. She could not afford to move.\n20. So they were staying.\n21. The husband got sick.\n22. The neighbours were now very helpful.\n23. They were quite poor.\n24. It turns out so were the neighbours.",
    "5dcc6f91e5e18690a20e74d1": "1. The narrator and her family are black\n2. and they move into an Irish neighbourhood.\n3. They dont know this at the time.\n4. One night when the narrators father, who drinks, is out tending the horses\n5. and their mother has gone to the shop\n6. the house has stones thrown at the windows\n7. and the window breaks.\n8. The narrator who is only 10 years old, takes their younger siblings into the stairwell\n9. to protect them from flying glass.\n10. They are all very scared by the experience\n11. and the narrator has to go and find their mom,\n12. which is what they call their mother.\n13. The narrator knows to go to 4th Street\n14. where there is a Jewish shop that is open late.\n15. (The narrator comments that they want to make as much money as they can so open all hours)\n16. The narrator finds mom\n17. and tells her what has happened.\n18. At the same time a policeman hears the story\n19. as the narrator is talking loudly\n20. and asks what has happened.\n21. The policeman is told\n22. and is asked what he is going to do.\n23. He replies that they will not be welcome in an Irish neighbourhood\n24. and he can do nothing about it,\n25. it is said he is Irish himself.\n26. Mom asks his precinct\n27. and goes there to complain\n28. and see what the captain will do about the incident,\n29. to which the Captain explains that if the narrator did not see who threw the stones they cannot know who is to blame.\n30. The mom then asks to be taken home in the patrol wagon\n31. and the Captain agrees.\n32. The narrator comments that her mom is educated\n33. and the only person they knew at the time with a high school diploma.\n34. The narrator mentioned that it was 1925\n35. but I am not sure if that was the date of the incident or when mom graduated high school.\n36. the whole neighbourhood come out to the sound of the patrols clanging bell\n37. and mom tells everyone that although they are a different skin colour, she and her family are the same in every other way\n38. and she only wants to take care of her family just like they do.\n39. She has paid all the money she has upfront to live in the house\n40. and If they don't want the family there they can give her the money\n41. and she will happily move,\n42. of course no one offers\n43. and the narrator comments that no one would have that sort of money in any case.\n44. The narrator tells us that the neighbours were always kind and considerate to them\n45. and when her father got sick they were helpful and kind.",
    "60c283d8d82adfb1f4930352": "1. There is a family\n2. who moved out .",
    "60df7ffed00034efd9a002c1": "1. They moved to Third and Wharton.\n2. The father was to bring back the horses.\n3. But he didn't come back.\n4. The narrator was to mind the children.\n5. While the mother went shopping.\n6. When she was gone someone threw stones at the house.\n7. And smashed the windows.\n8. The narrator went to find their mother.\n9. As she was shopping in the Jewish district.\n10. And the shops were open longer.\n11. When the narrator found their mother.\n12. And told her what happened.\n13. A police man came across them.\n14. He said it was a bad area for them to be in.\n15. But that he could not help them.\n16. So they went to the police station.\n17. To see who could help.\n18. The captain said the same.\n19. That he could not help.\n20. And so the mother asked him to bring them home in the police patrol.\n21. When they got home a crowd gathered.\n22. And the mother said she had no money left to move anywhere else.\n23. She had paid for a month.\n24. And if the people did not want her there.\n25. They would have to give her money.\n26. So she could move somewhere else.\n27. After that they had no more trouble.\n28. The neighbours were very good to them.\n29. When the father was sick.",
    "5e11a7d6feea8982dba1e61c": "1. We moved to Third and Wharton.\n2. I told you my father used to drink,\n3. so he went out.\n4. My mother went out to buy some food,\n5. leaving me alone with the kids.\n6. Just after she had left I heard a loud crash.\n7. I saw stones coming through the window.\n8. I grabbed the kids\n9. and hid in the stairs.\n10. I told them \"Stay here, nothing can reach you here.\n11. I'm going to try to find mom.\"\n12. (We called our mother \"Mom\".)\n13. I was only 10 years old at the time.\n14. I was so scared walking towards the front door,\n15. I didn't know what I would see.\n16. There were shops nearby, in the Jewish neighbourhood.\n17. They were open all hours because they tried to take what money they could get.\n18. That's where my mother was.\n19. There were carts on the street.\n20. I ran up to my mother\n21. and started telling her what happened.\n22. A police officer went past.\n23. I was so scared I could hardly be understood.\n24. The police officer stopped,\n25. he wanted to find out what had happened\n26. and what was wrong with me.\n27. He started speaking to my mother.\n28. \"You're in a bad neighbourhood.\n29. There's nothing anyone can do for you,\n30. the people there are Irish.\"\n31. He was Irish himself.\n32. \"They don't want black people living there.\"\n33. But he didn't say black.\n34. \"They don't want anyone in that house,\n35. you should move.\"\n36. \"We can't move.\" My mother said.\n37. \"We don't have any money.\n38. If you can't do anything then tell me where your precinct is.\"\n39. We went to the police station where the officer worked.\n40. We spoke to another police officer there.\n41. \"You should move.\" he said.\n42. A lot of black people were cowed and put down,\n43. so they rarely spoke up for themselves,\n44. thankfully my mother was not like that.\n45. \"We cannot afford to move,\n46. surely the estate agency should be held accountable if no one wants someone living in that house.\n47. Now if you're not willing to help,\n48. I'll tell you what to do.\"\n49. \"What?\" asked the officer.\n50. \"Drive me home.\" Said my mother.\n51. We were driven home by the police in a cart pulled by horses.\n52. There were bells on the cart that would clang.\n53. Clang, clang, clang.\n54. Everyone came out of their houses to see what the noise was over.\n55. My mother stood up and spoke to everyone.\n56. She told them that we had no money,\n57. we had paid rent for a month (we had to pay in advance),\n58. we didn't know what would happen in a month\n59. but we couldn't leave before then.\n60. She told them that we were different from them\n61. but that didn't give them a reason to treat us badly.\n62. After that my father became ill,\n63. but the neighbours were as nice as they could be to us.",
    "62e1975d947d5f6bcb8113bd": "1. We had just moved to a property on third and wharton,\n2. my father had just finished putting the furniture in when he had to leave to take the horses back.\n3. my mother then left to go and get groceries leaving me alone with the kids.\n4. My mother was going to get groceries in the jewish shops where they stay open all hours to get as much money as they can.\n5. There was a large crash and the kids were screaming,\n6. I ushered them under the stairs while I looked to see what it was.\n7. A stone had been thrown through the window.\n8. I ran out of the house to find my mother,\n9. I was so scared,\n10. I ran and ran and found her on forth street,\n11. I was speaking so low that a passing policeman stopped to see what had happened.\n12. My mother asked what he was going to do about it,\n13. he said nothing,\n14. my mother asked why not as I paid rent for that property and I have no more money.\n15. She asked who could help,\n16. he said no one can.\n17. My mother asked for the precinct to get them to help.\n18. My mother was an educated black woman who qualified from high school in\n1925.\n19. We went to the precinct and they said they cannot help\n20. so my mother said you can take us home,\n21. they did so in the wagon that was pulled by horses with a bell that went clang.\n22. When we stopped there was a step that was put to the back so we could get out\n23. and all the neighbours had come out to see what happened.\n24. My mother told them that she had paid rent for a month and had no more money\n25. so she was going to stay for the month\n26. and if they didn't want us stay then they could pay our rent for us to leave.\n27. After that my father got sick\n28. and our neighbours helped us.",
    "60c00052c391140811ca1d54": "1. They moved to third.\n2. It was day my father drank and took the horses.\n3. I was left with kids.\n4. I was 10 years old my father said they are terrible neighbours.\n5. We went to the police station to report but they said we must leave.\n6. Because I said no my mother was an educated person.",
    "5d336b07d343a00016536032": "1. This person first started on Wharton.\n2. Their father was at a furniture store.\n3. One day people started throwing stones at their house.\n4. (presumably because they were black and unwanted in the community).\n5. Given this and the color of the family's skin, they are told that they will be evicted.\n6. The narrator's mother fights against this eviction.\n7. The mother argues that she already paid this month's rent and doesn't have money to pay for rent elsewhere.\n8. The mother states that this is their home for the month, even if it might not be in the next (because where will the money come from).\n9. The mother even says that she doesn't have the money to pay to replace the windows that were shattered by the stones, which will be rough given that it is the winter time.\n10. However, the apartment is still home and unless people give her money to leave then this is where she will be for the month.\n11. For the narrator this was a traumatizing experience.",
    "5b8ba037bca3400001fad37a": "1. They moved to third and wharton.\n2. Mother went out shopping to fourth street.\n3. Father was also out of the house.\n4. When they were out of the house the storyteller who was ten at the time, recalled of stones smashing the windows.\n5. They moved to other parts of the house for safety.\n6. Then ran out of the house.\n7. They were scared that they were going to get hit by something.\n8. She finally met her mother.\n9. She was that upset she could barely make out what she was saying.\n10. A passing police officer stopped to talk and find out what was wrong.\n11. Her mother was very assertive, which was not common among black people of the day.\n12. The policeman had said there was nothing he can do.\n13. And that it was an irish neighbourhood that was known for trouble.\n14. He advised her to move house.\n15. The policeman was also irish.\n16. She recalled of how she though her mother was educated and that she finished high school.\n17. She went to lakawana high school and finished in\n1925.\n18. The mother wasnt happy with the policemans response.\n19. She asked what precinct he worked out of.\n20. The mother went to the precinct on fifth street and spoke to the captain.\n21. She recalled of seeing lots of police patrols and horses.\n22. The captain was equally unhelpful.\n23. Saying that because they never seen who threw the stones there is nothing they can do.\n24. The mother spoke loud and long.\n25. The captain hadnt dealt with someone like this before.\n26. The mother then asked for a police patrol to give her a lift home.\n27. When she got home there was a crowd waiting for her.\n28. She spoke to the crowd.\n29. Letting them know that they paid for the rent in advance for a month.\n30. And dont have enough money to move.\n31. Telling them that apart from the colour of her skin, she was the same as them.\n32. And if they want her to move they would have to provide the money as she couldnt afford to move out.\n33. She was just trying to make a home for her family.\n34. Her father got sick during this time.\n35. The neighbours were now really helpful and looked out for them.\n36. Whenever there was any other trouble the neighbours would come out and help them.",
    "5ed931982fb618499fb90bc6": "1. Father was an alcoholic,\n2. people were throwing things at the house,\n3. involving sharp glass.\n4. I gathered the kids\n5. and got them out\n6. because it wasn't safe.\n7. I was only 10 years old.\n8. I went to find my mother,\n9. she was shopping in the Jewish district.\n10. We spoke to a policeman\n11. who was Irish\n12. and he said its not safe for us in the area.\n13. The Irish people of the area do not like Black people,\n14. although he did not use that term.\n15. He asked me if I saw who did it\n16. I said I hadn't\n17. and he said therefore he cant do anything\n18. because there is no one to blame.\n19. Then we saw another lady\n20. who said if they give her enough money she will move away\n21. but she said they will not have enough money\n22. so we will have to live like this.\n23. Then my dad got sick.",
    "64e603dd69223a81a990ae76": "1. The story starts off with the main character moving to a new neighbourhood.\n2. The main plot about one day when her father was drinking,\n3. someone threw a rock through the window.\n4. The main character was very scared.\n5. They reported the situation to the police.\n6. They live largely in a Jewish neighbourhood\n7. and the police immediately attributed the crime to racism.\n8. They blamed Irish and black people.\n9. This became a big issue in the neighborhood\n10. and people felt unsafe.\n11. Due to this, the main character moves to a new neighborhood\n12. which is more friendly and less racist.",
    "5b618aef12bf660001275c5d": "1. A girl was in a house with her siblings\n2. when stones were being thrown through the window\n3. so she told her siblings to hide\n4. while she went to the town\n5. and found her mother\n6. and as she was telling her\n7. a policeman walked by\n8. and heard the commotion\n9. so stopped to ask what happened\n10. and they told him\n11. and he basically refused to do anything about it\n12. as the family were black\n13. and the Irish didn't like them\n14. the mother decided to go to the police station\n15. to talk to someone else\n16. and they agreed to take them back home in the patrol car\n17. so the people would see that\n18. and leave them alone\n19. which they did\n20. and became helpful when their dad was ill.",
    "63ced390ffb149038641f677": "1. A black Jewish family had moved in to a new home.\n2. The father was out drinking\n3. and the mother was shopping.\n4. The house got attacked with stones breaking the windows\n5. the oldest of the children hid the other 2 siblings in a cupboard away from the flying glass\n6. so they wouldn't get hurt.\n7. The eldest sibling ran out of the house,\n8. frightened and looking for there mum.\n9. They found there mum down the street\n10. where there mum was shopping\n11. and tried to explain in tears what had happened.\n12. A passing police man heard the commotion\n13. and came and asked what was wrong.\n14. They explained that they were a new family in the area\n15. and there house was being attacked.\n16. The police man explained that this would happen to this black family as they lived in a Irish area.\n17. The mother was disgusted to learn the police wouldn't help\n18. so wanted to see the captain.\n19. The mum and child was taken to the station\n20. and pleaded there case to the captain\n21. but was told exactly the same that the police wouldn't help\n22. and the only solution was to move away.\n23. The mother had payed a month's Renton the house\n24. and had no money left.\n25. She demanded that herself and her child to be taken back in the horse drawn wagon.\n26. As they sat in the back neighbours appeared as they arrived at there house.\n27. The mother exclaimed so the neighbours could hear that they had been attacked\n28. and if the group of people who didn't want them there they should get together and give then the money to move\n29. as she didn't have the money to leave.\n30. Also stating that now they would be cold as there windows were broken\n31. and she couldn't afford to fix them.\n32. The neighbours had seem to change there mind once the dad got ill\n33. and all came together to help the black family\n34. and were now friendly to the family.",
    "5ffd80c185e28327669b51f5": "1. it a story about a family with one kid\n2. who was 10 years old at the time\n3. a mother and father\n4. and they moved in to place\n5. where black people were not treated ok\n6. and one day an incident happened to them\n7. and they went to report this issue\n8. but they did not get the help they thought they would get\n9. they were basically told to move from that place\n10. but they couldn't\n11. because they had no money",
    "63e52debbbb982734deba89a": "1. A black family had recently moved into a new neighbourhood of predominantly Irish people.\n2. This was in the 1920s.\n3. The father went out (he tended to drink) and left his wife and children at home.\n4. It was evening time.\n5. The mother needed to go and get some food so went out to the Jewish shop that stayed open longest.\n6. She told the eldest child who was 10 to look after the younger children.\n7. Suddenly there was a crash that scared the children greatly.\n8. The eldest hurried the children under the stairwell for protection and told them to stay there and that they would be safe.\n9. A stone had been thrown through their house window.\n10. The child was scared but went out to find their mother, correctly guessing where she would be and told her what had happened.\n11. She was angry and aggrieved at the unfairness of it.\n12. They were black but they paid their rent like everyone else.\n13. If they didn't want them there why had they allowed them to rent.\n14. There was a policeman passing and the mother stopped him asking for him to come and help find who had done this.\n15. Although he was sympathetic to a degree he said the only thing he could suggest was that they moved somewhere else.\n16. The mother said she had paid the rent for a month and there was no way she would move.\n17. Her job as a mother was to protect her children.\n18. The child was proud of his mother who was educated and strong.\n19. As the policeman would not help she asked to be taken to someone more senior who could help.\n20. Again the answer was that all that they could suggest was that she move.\n21. She and the child were taken in the horse drawn police wagon back home.\n22. The clanging of the bell alerted the neighbourhood who came out to watch what was happening.\n23. The mother alighted and spoke to them saying that apart from the colour of their skin they were all the same.\n24. She had paid rent for a month and she was staying for a month.\n25. If they wanted to move her they could pay her rent to live elsewhere.\n26. A while later the father became ill and the people in the neighbourhood behaved towards the family with kindness and empathy.",
    "584c8539e964030001c316fb": "1. It is 1925\n2. and coloured boy 10 years old moved into an Irish neighbourhood with his family\n3. while his mum and dad were out\n4. he was left with his siblings\n5. some one threw a stone through the window\n6. so he hid his siblings under the stairs\n7. while he went to search for his mother\n8. he thinks she went to the Jewish neighbourhood\n9. as the shops stayed open longer there\n10. he found his mother\n11. who informed a police officer,\n12. who said they could not do any thing\n13. and the Irish people probably did not want them living there.\n14. The boys mother explained she had paid a months rent to the real estate agent\n15. and could not afford to move.\n16. she persuaded the police officer to give her and her son a lift home\n17. in the horse drawn police wagon that went clang.\n18. When she was dropped of in her neighbour hood\n19. all the neighbours were watching as she got out.\n20. She told the neighbours if they wanted her to leave they would have to club together and give her the money to move to some where else.\n21. while they were living at the house\n22. the boys father feel ill\n23. all the neighbours helped out.",
    "5c0239caecc5660001424ed6": "1. A Black family moved to a new neighbourhood.\n2. Someone smashed a window in the family's home.\n3. It was an Irish area.\n4. They didn't want any Black people there.\n5. The mother called the police.\n6. They would not do anything.\n7. So the mother went to the police station to complain.\n8. Again the police said they could do nothing.\n9. They had no evidence.\n10. When the mother got back from the station, she said to the neighbours that no matter what they did, she and her family would be staying there for at least a month.\n11. She had paid for a month.\n12. She could not afford to move again unless the people paid her to leave.\n13. This is something they would not do.\n14. They probably could not afford to do.\n15. In the end, it turned out ok.\n16. The family got on well with the neighbours.",
    "5e356b29d87fbf512a4cd090": "1. We moved to Wharton,\n2. my mum went to the shops.\n3. There where horses in the road.\n4. Somebody stoned our house\n5. and broke all the windows.\n6. I went to find my mother\n7. who was working in the jewish district.\n8. I could barely speak when I found my mother.\n9. She was good at talking.\n10. Called the police about the stoning of the windows in the house,\n11. we thought it was because we were black.\n12. My mum said to the neighbours we are just like you.\n13. The policeman said we could move,\n14. my mum said no.\n15. She said they had rented the house for one month,\n16. if the neighbours did not like it they could pay for the windows\n17. because my mum said she had no money,\n18. neither did the neighbours.\n19. My father got sick\n20. and the neighbours were kind.",
    "6075e12159e69162ee283711": "",
    "5a3adfb705f005000104d2a3": "1. Lived in Third and Warton,\n2. his father was an alcoholic\n3. and fled on a horse.\n4. There was a loud crash\n5. in which someone was throwing stones at their windows.\n6. The father rushed the kids under the stairway,\n7. the narrator was only 10 at the time.\n8. This is when his father took off.\n9. They moved to fourth street,\n10. a Jewish town,\n11. in which his mother went to a policeman,\n12. who was Irish,\n13. to try and find out who was throwing stones.\n14. It was a mixed race community,\n15. which caused lots of trouble,\n16. where the black men cowed,\n17. although they weren't allowed to call them black.\n18. The policeman said she doesn't know who to blame\n19. so it's pointless\n20. and his only advised was that she moved.\n21. His mother was very poor\n22. and could only afford 1 months rent\n23. but she knew she was staying put despite not having a lot of money.\n24. At the Narrators age of 24/25 he went to fifth street.\n25. There was more policeman here with horse wagons,\n26. they said there was nothing they could do about these stones.\n27. The narrator was terrified at such a young age.",
    "5d080cac3ba4580019731a79": "1. A 10 year old child moved into a new neighbourhood with their mum, dad and siblings.\n2. Just after moving in the mother decided she had to pop out for some shopping,\n3. so off she went.\n4. The father then decided he had to out too.\n5. So the children were left alone in new home,\n6. all by themselves.\n7. Suddenly rocks and stones were being thrown at the front room windows.\n8. The child took her brothers and sisters and hid under the stairs.\n9. When the noise stopped she took out the children and went to find the policemen.\n10. When the mother was located she was very angry and spoke to a policeman\n11. who told her she needed to move house,\n12. however the mother argued that she had no money to move house.\n13. She asked the policeman to take them home.\n14. On arriving home the neighbours all came out of their homes to look at who was being driven home by the police.\n15. The mother then explained the situation she was in.\n16. If the neighbours wanted the family to leave they must all give her money to do so.\n17. She went onto explain that she wanted to make a home for her family just like themselves,\n18. even though her family had different coloured skin to them they were just the same as any other family.",
    "5e852dd84fc423121601a0f8": "1. There was a ten-year-old child\n2. who was babysitting one day\n3. when, out of nowhere, something struck the window.\n4. Their parents were not at home,\n5. and they lived in a Jewish neighborhood.\n6. Startled by the incident,\n7. the child quickly gathered the other kids\n8. and moved them to safety.\n9. The child then decided to investigate what had hit the window.\n10. While searching for their mom at a nearby store,\n11. they caught the attention of an Irish police officer.\n12. The officer inquired why the child appeared scared.\n13. When the mom finally arrived\n14. and learned about the incident,\n15. she asked the officer for assistance.\n16. However, the officer regretfully responded, \"I can't do anything about it.\"\n17. The mom became upset\n18. and requested the officer's captain's name\n19. so she could discuss the matter at the police station.\n20. Upon speaking to the police captain,\n21. she was met with a similar response.\n22. The captain explained that their hands were tied,\n23. and they couldn't take any action.\n24. Frustrated, the mom expressed her inability to move out of the neighborhood\n25. due to financial constraints.",
    "600ed894271cf07f30826df6": "1. A black family moves to Third and Wharton\n2. and their house is attacked by neighbours throwing rocks through their windows.\n3. The mother goes out to get police help,\n4. but the police officer blames the issue on the Irish neighbourhood\n5. and advises that the family move.\n6. The mother says she can't\n7. and asks where the officer's precinct is.\n8. He tells her\n9. and she goes there to speak to the captain,\n10. who also tells her that there is nothing he can do except to advise her to move.\n11. She tells him she has no money as the rent is paid in advance for her home.\n12. She asks the captain for a ride home\n13. and once she arrives home,\n14. she tells her neighbours her situation\n15. and after that they were kind neighbours,\n16. even helping when the father became ill.",
    "5f392fae9168cc472f0468f6": "1. One evening when we lived on the corner of 4th and Westbuty my father went out with the team of horses,\n2. and then my mother went out\n3. and I was there.\n4. There was a huge crash\n5. and a stone came through the window.\n6. I took the others under the stairs\n7. and I said you stay there,\n8. I'm gonna get Mam,\n9. we called our mother mam in those days.\n10. I knew she would be shopping somewhere on fourth\n11. because there were shops there\n12. and they kept open late\n13. because they - jews - wanted to make as much as they could.\n14. I found her there\n15. and told her.\n16. There was a policeman there\n17. and my voice was so low and shaky\n18. that he asked what the problem was.\n19. My mother told him\n20. and asked him what he could do.\n21. I can't do nothing, he said\n22. the Irish don't like a black living there - he didn't use the work black, it wasn't used then.\n23. So what can i do, my mother said.\n24. You'll have to move he said.\n25. I can't move she said,\n26. I don't have any money.\n27. I paid rent in advance so I just can't move.\n28. Why did they let me rent it if they don't want us there.\n29. Where is your precinct.\n30. He told us\n31. and we went there.\n32. Captain, she said, what can you do.\n33. Nothing he said, I'm Irish too, all you can do is move.\n34. I can't move she said.\n35. I'll tell you one thing you can do for us, take us there in your horse and wagon.\n36. He said yes, probably he just wanted to get rid of this woman.\n37. He hadn't seen anyone like her before.\n38. She was the only black woman I knew who had finished High School.\n39. We sat in back of the carriage\n40. and the bell went Clang clang.\n41. You know those trams go Clang, well this went Clang Clang Clang.\n42. When we got to the house the policeman opened the long back door\n43. and we had to walk down the steps.\n44. A crowd was looking at us.\n45. My mother said.\n46. I can't afford to move from here for a month because I paid rent in advance.\n47. It's winter and cold.\n48. I can't afford to new windows.\n49. I'm just like you except for skin wise.\n50. I am just the same.\n51. So they just accepted us from then on\n52. and when my father got sick they all helped\n53. and treated us just like one of them.\n54. The year probably was nineteen twenty five.",
    "5c98310742270c0014d0287a": "1. This person lives with their parents and siblings.\n2. This person's mother went shopping.\n3. Father went somewhere.\n4. People threw rocks at their house.\n5. The narrator ran to mom at 4th street.\n6. There were horses.\n7. On the way there the narrator saw a policeman.\n8. They lived in an Irish neighborhood.\n9. Where blacks were not welcome.\n10. The mom asked the policeman what they can do.\n11. Nothing could be done.\n12. They went to the police station.\n13. The chief said to move out.\n14. But they had already paid their rent for the month.\n15. And did not have any money to go anywhere else.\n16. So she suggested that if people wanted them gone they get enough money to move out.\n17. But those people probably didn't have money either.",
    "60bab50bcdd5d7ad3ee97479": "1. The story was based in a Jewish neighbourhood,\n2. in which a policeman recalls to be a dangerous neighbourhood.\n3. Apparently black people aren't allowed to live there.\n4. Their mother went out to the market\n5. while they hid under the stairs to avoid the flying glass.\n6. They were all scared,\n7. but the narrator went to find their mother.\n8. Along the way she spoke to a policeman,\n9. who said everything about the neighbourhood.\n10. Later on, the father had to go until hospital.\n11. Overall, it was quite a frighening story\n12. as reflected upon towards the end by the narrator.",
    "62e952d57a788507f98964ba": "1. We had to go to Wharton.\n2. The house was stoned\n3. and there was flying glass everywhere.\n4. I had to make sure the kids were safe\n5. but I couldn't find mom.\n6. We ended up in a Jewish neighborhood\n7. and was told they didn't like black people there.\n8. At that time you didn't say black people\n9. so they said they didn't like other people there.",
    "5cb3d74a0225590017acda81": "1. the window got smashed\n2. they were very scared\n3. and voice was shaking\n4. they ran to get his mum\n5. and the police told the mum\n6. they should move\n7. because it's full of Irish people",
    "606f18e0f46c7435dd00838c": "1. A brother and his siblings were left home by their parents.\n2. Some unknown people threw stones at the windows of their home.\n3. This frightened the 10-year-old and his sisters.\n4. He got them to a safe spot on the stairway.\n5. He went about to look for his mother.\n6. He found her at some Jewish shop doing some grocery shopping.\n7. He relayed the story of what had happened to his mother.\n8. There was a police officer in the vicinity.\n9. The boy told the cop what had happened.\n10. The cop said there was nothing they could do about it.\n11. The cop suggested that the boy and his mother move to another neighborhood.\n12. Since the area was Irish, the boy and his mother were black.\n13. The boy's mother refused to move.\n14. She requested to be taken to the precinct to speak to someone else who could help her.\n15. They got on a horse cart as this was back in the 1925s.\n16. At the precinct, she was told the same story about not being able to be assisted.\n17. Especially with the identity of the perpetrators not being known.\n18. After realizing that she was not getting the help she required, she asked to be escorted back home by the police patrol.\n19. The police patrol had a bell that clanged.\n20. The clanging noise aroused the curiosity of the neighbors.\n21. They came out of their homes to see what was happening.\n22. She got out and addressed them.\n23. She told them that unless they were willing to make donations towards her getting her down payment for her monthly rent for the house, there was no way she was going anywhere.\n24. She couldn't afford to pay rent elsewhere for at least a month.\n25. So she was stuck with them and they were stuck with her for at least a month until she could find somewhere else.\n26. That was their welcoming into the neighborhood.\n27. From then, neighbors started warming up to them.\n28. They would step in to help whenever something happened.\n29. Even the boy's father got ill.",
    "5b0e8d65d282ff00015bb9d1": "1. A family moved into an Irish community in 1925\n2. and the father went out to the horses\n3. and the mother went shopping to 4 th street\n4. which was a Jewish area.\n5. While array the 10 year old looked after the others.\n6. Someone put a brick through the window.\n7. They hid under the stairs.\n8. The 10 year old went to find his mother\n9. and also told a policeman what had happened.\n10. The family had paid a months rent\n11. so couldn’t afford to move.\n12. They went to the police station\n13. and were brought home in the police patrol.\n14. The mother who was black told the neighbours she was staying a month\n15. unless they paid her the money to move on.",
    "636419013bc521fae9f7db90": "1. A black family moved into a neighborhood.\n2. One day something was thrown into the window.\n3. [Something] shattered the glass.\n4. The narrator - a child - ran.\n5. [The child] found their mother.\n6. [The mother] reported it to someone.\n7. [The mother] can't recall who [she reported it to].\n8. That person said the trouble was owing to the neighborhood being largely Irish.\n9. [The person said] they didn't want black people living there.\n10. The person noted that they themselves were Irish too.\n11. So the mother went to report it to the police.\n12. [The mother] asked what they would do about it.\n13. The police said there was nothing they could do.\n14. [The police] could only advise that the family moved somewhere else.\n15. The mother said that she can't afford to move.\n16. [The mother] asked that police at least give them a lift home in the police car.\n17. Given that it was in the 1920s, the car had a bell that clanged.\n18. [The bell] clanged like the 'clang clang' of a trolley as they went.\n19. The noise caused a small crowd to assemble.\n20. [The crowd] assembled when they arrived in the neighborhood.\n21. When she got out of the car the mother asked the crowd why they were 'doing this' to them.\n22. [The mother said] they were just like them only looked different.\n23. At this stage I got distracted and sleepy.\n24. [I] missed a few lines.\n25. Towards the end the neighbors were friendly.",
    "5cad04fabd5aa100158dae68": "",
    "60475f1790672f23136c2cc4": "1. This ten year old was sitting in the house with her siblings\n2. when stones were thrown through the window\n3. and she told the kids to hide by the staircase to avoid getting hurt,\n4. she then opened the door\n5. ran in the streets to where her mother worked ,\n6. and a policeman was close by\n7. asked her what happened\n8. she told him their house was stoned\n9. her mother asked the police officer to help\n10. but he said he cannot help\n11. all he knows is they wont people like them there(black people)\n12. but he could not say it\n13. he just said to her they must move.\n14. she then told him she cant move because she just moved in,\n15. she then told him to take her to the police station\n16. where she spoke to another officer\n17. who told her he too could not help her\n18. the only solution is for her to move,\n19. she told him she already paid the months rent with all the money she has\n20. so she cant afford to move\n21. she asked him to take her home\n22. and he took her home in horse pulled police carriage\n23. it made a clang clang sound when it went to her house\n24. and the neighbours came rushing out to see what was going on\n25. then they saw this woman coming out of the carriage\n26. and she addressed the public\n27. told them she just paid rent with her last money\n28. and she cant afford to move\n29. so they should get used to having them there\n30. because she is not even sure if she will have money for the next rent\n31. add to that it is winter and her windows are broken.\n32. from that day the people became more neighbourly.",
    "601f08cba1191642cadf59c1": "1. A black family live together in a rented house in a Jewish or Irish neighbourhood on fourth street.\n2. One day, after the father had had a drink whilst moving fur and the mother had gone out, some people started throwing stones at the house, breaking the windows.\n3. The daughter was inside and was very afraid and trying to look after the young children in the house and protect them.\n4. They ended up calling the police who didn't do anything so they went to the precinct where they explained the situation.\n5. These police also didn't do much so the mother asked for a lift back to the house.\n6. On the way back, around 5th Street, they saw all the neighbours.\n7. The mother was quite smart as she had completed school, finishing around 1925 and spoke to all the neighbours.\n8. She told them that apart from their colour, they were the same as everyone else.\n9. They paid their rent and didn't have any money to currently move, explaining that they would stay in the rented house for another month, as they had paid for this.",
    "604a8a4926724aaed69b940b": "1. From what I recall from the story,\n2. there was some racism for black people in an Irish neighborhood.\n3. The mother and the child both had to deal with tough times.\n4. The mother/child received word that they could not provide for the child properly,\n5. at least that was what the child was complaining about.\n6. I know that the mother went to a high school in\n1925.\n7. I remember something about Younge street.\n8. The story was taking place in Canada I believe.\n9. That is all I recall words were moving fast.\n10. Thanks.",
    "5ec83217e7e29110f1f1cde0": "1. A person moved house,\n2. their Dad was a drunk.\n3. Their mother went out to the shop\n4. and their father also left.\n5. Whilst they were left alone\n6. a stone was thrown through the window.\n7. The person looked after their siblings\n8. who were crying.\n9. They went to find their mother\n10. and eventually found her\n11. but a police officer wondered why the person was so distressed.\n12. The police man said he could not help\n13. and claimed the Mum was loud\n14. and talked for a long time.\n15. The Mum said he was being racist\n16. because of her skin colour.\n17. She then asked for a lift home.",
    "5daa828510839e0016aa193b": "1. It's about a black family moving into a neighbourhood\n2. that is hostile to those that aren't white.\n3. There are three kids and their parents,\n4. the kids are left at home while the parents are out.\n5. Suddenly their window is hit and broken by a rock,\n6. the assumed eldest of the kids takes them away from the window to hide\n7. while the assumed eldest goes to find their mother.\n8. Their mother goes to the police\n9. and tries to see what they can do,\n10. but all they can say is for them to leave the neighbourhood.\n11. So the mother takes it on herself to speak to the neighbours,\n12. and that's all i got.",
    "56e6f0dec89073000de74780": "1. When the boy was about 10 years old,\n2. his family moved to a house on Third and Wharton.\n3. On the day they moved in,\n4. his father left to get the horses\n5. and his mother went to get groceries at the store owned by Jewish people that opened later than usual.\n6. He was left home minding his younger siblings\n7. and someone threw stones through the windows.\n8. He moved the kids under the stairs to be safe from the glass\n9. and went to find his mother on 4th street.\n10. A passing policeman heard him telling his mom what happened\n11. and she asked him what he was going to do.\n12. He said there was nothing he could do\n13. and that they should probably move because they weren't welcome.\n14. She asked him where his station was\n15. and went there to see if anyone could help her.\n16. They told her the same thing\n17. but gave them a ride home on the police carriage when she asked.\n18. When she arrived,\n19. she told her neighbors that had gathered because of the loud noise for the carriage bells,\n20. that she would be there for a month because she had paid for a month\n21. and if they wanted her to leave then they could give her the money.\n22. Nobody bothered them after that\n23. and were even quite friendly when his Dad got sick.",
    "5716a297c5aca200128d2c52": "1. There is a family that just moved to a rental house on Third and Wharton.\n2. The story is told from the perspective of a child aged 10 and set around 1925 so there are horses and carts.\n3. The father was a drunk and had to go out and get the horses.\n4. The mother left the house and came back on that day.\n5. When the whole family was in the house a stone came crashing through the window and broke it.\n6. There were people outside throwing stones at the house.\n7. The narrator gathered the younger children in the stairway so they would not be harmed and the mother ran out of the house.\n8. The narrator followed.\n9. They went to fourth street because that was a Jewish neighbourhood where things were open late and there were horses and carts.\n10. They came across a policeman who was Irish.\n11. He said it is a bad neighbourhood and an Irish one.\n12. He said they don't want black people living there and that is why the stone was thrown at the window and told the mother they should just move.\n13. The mother and narrator walk to the precint on fifth street where the policeman worked.\n14. She spoke to another police who told her the same thing and she should move.\n15. She said that they do not have the money and they gave all their money for rent and the least he could do was take them home.\n16. The policeman took them in a police horse and cart with a large bell on it.\n17. So all the neighbours came out of their homes to see it.\n18. The mother then tells them how she has no money and will definitely be there for the month but maybe not longer if they cannot afford the next months rent.\n19. She tells the crowd that they can give her money to move if they don't want them there but they do not give money.\n20. The father becomes ill during this and the neighbours act nice and help.\n21. The mother said they cannot afford to fix the window and it is cold.",
    "62ade6ed8f62ae5ea2ac12e1": "1. It’s 1925,\n2. a black family moved into a house in an Irish neighbourhood\n3. and had stones thrown through their window\n4. so went to the police\n5. and the police told them to move\n6. but they couldn’t afford to\n7. as they had paid a months rent\n8. so had no money.\n9. Police took the home,\n10. the mum shouted at the neighbours,\n11. and then the neighbours were all nice\n12. when the dad got sick.\n13. The author was 10.",
    "603659d5c391045d1e4b332b": "1. We moved to Third and Whardoff.\n2. My father went out - did I tell you he drank?\n3. And my mother went to the store to get some things for our home.\n4. When my father left people began throwing stones - stones flying through the window.\n5. Of course, I was left at home with the children.\n6. So I rushed them to the stairway, because that was the only place where they wouldn't get hit by flying glass.\n7. Once they were there I said \"You stay here, I am going to get mom\" (We called our mother mom).\n8. I ran out the door and didn't know what to expect.\n9. I ran to Fourth.\n10. The neighbourhood was Jewish, and so the stores stayed open until late.\n11. Any bit of money they could earn, they did.\n12. When I reached my mother I couldn't make sense in what I was saying.\n13. A passing policeman heard the commotion and wanted to find out why I was in such a state.\n14. Once he found out, he told my mother that the neighbourhood is Irish, and that we should move out because we're black.\n15. He didn't say 'black' but he said \"They don't want somebody living there\".\n16. My mother said to him that she had spent all of her savings on that months rent, and didn't have enough to move.\n17. She said \"You're civil service, you must protect us\".\n18. He said that he couldn't do that - he was Irish too.\n19. My mother asked \"Where is the precinct you work\".\n20. He told her, but I don't remember the exact details, even though I was standing with my mother.\n21. We went to the precinct and spoke to the head officer, but he told my mother the same thing \"Move away\".\n22. She explained the situation to him, but he said he couldn't help.\n23. She finally said \"The least you can do is drive me home\".\n24. So he did.\n25. The police car, hors and cart, mad a clanging sound.\n26. Clang clang clang.\n27. As we turned the corner - the precinct wasn't far, maybe on Fifth - everyone turned and came out of their homes to hear the noise.\n28. The policeman sat up front, and we were let out the wide back door of the cart.\n29. As my mother got out she turned to face all the people and asked \"Why do you do this to me?\n30. We are the same, maybe not color wise, but in every other respect, we are the same.\n31. I have spent all of my savings on moving here.\n32. We are living here for a month at least, I don't have enough to move away.\n33. I am just trying to provide a home for my family.\n34. I don't have enough money to fix my windows, so unless you want to get together and pay for me to move, I am staying for a month\".\n35. Of course they didn't pay, but during that month, my father got sick.\n36. The people were as sweet as can be.",
    "5d5e66b3844f160001f24150": "1. The child was left home alone except for his/her siblings\n2. because his mum had gone shopping\n3. and his father had gone to (I think) take some horses back to their stables.\n4. Shortly after his mother left\n5. there was a huge crash\n6. and a window in the house was smashed.\n7. The child was afraid,\n8. but he managed to move the younger children into the stairwell where no stones could reach.\n9. He ran out to look for his mother\n10. who was shopping in the Jewish area,\n11. where shop-keepers worked long hours to maximise their income.\n12. He managed to find her\n13. and tell her what had happened.\n14. She asked for directions to the police station\n15. and she, and the child, went there.\n16. The police were sympathetic\n17. but unable to offer any help.\n18. They didn't expressly say it,\n19. but they indicated that the trouble was because the family are black\n20. and this is a predominantly Irish neighbourhood.\n21. Their only suggestion was that she move the family into a different area.\n22. The mother was indignant at this\n23. and pointed out that she could not afford to move again.\n24. As the police could not offer any help,\n25. she asked them to at least take her and the child home,\n26. which they did, in a noisy, horse-drawn police vehicle.\n27. The noise brought out all her neighbours,\n28. which gave the mother the opportunity to address them all.\n29. She told them that she could not afford to move,\n30. she had paid a month's rent on the property\n31. and would be there for at least that time.\n32. After that, who knew.\n33. She was defiant and strong when she spoke to them,\n34. pointed out that other than skin colour they were the same\n35. and that she should be allowed to live there in peace.",
    "5a5f945176d1c60001ab7e30": "1. We moved onto Third and Wharton.\n2. My father drank a lot.\n3. When he took the team of horses, used to move us in, back, he then didn't return.\n4. My mother left the house to buy some food from the Jewish shop as they stayed open all hours.\n5. I was in charge of the children.\n6. I was ten years old.\n7. After my mother and father left, there was an almighty crash.\n8. A stone had been thrown through the window.\n9. I told the children to hide in the stairwell so that they wouldn't be injured.\n10. The house was stoned.\n11. I ran out of the house to find my mother.\n12. When I was telling her what happened, a policeman heard me.\n13. He said it was a rough area and that the Irish didn't want black people there, though he didn't say black.\n14. My mother asked him what he was going to do.\n15. He said there was nothing he could do and we should move.\n16. He was Irish too.\n17. My mother said we had spent the money on rent for a month so couldn't move.\n18. She asked him where his station was.\n19. We went there to see the captain but he said the same.\n20. The captain wasn't used to a black woman standing up for herself as most were cowed by the white people.\n21. She made him bring us home in the police patrol, which was a cart with horses.\n22. It was\n1925.\n23. At the house, she told the people waiting that she would be there for the month as she had paid the rent and that, apart from being black, she was the same as them.\n24. Later, my father became ill.\n25. The neighbours were helpful.",
    "64287b2deed56861af146830": "1. We arrived at 3rd & Wharton,\n2. it was olden times.\n3. We were in the front room\n4. when we heard a crash,\n5. looked and there was a stone in the middle of the room.\n6. They were smashing the windows.\n7. Mum took us to the stairs\n8. so we wouldn’t get hit by flying glass.\n9. We were told it was an Irish neighbourhood\n10. and they didn’t want black people there.\n11. Mum told them she had paid all the money she had to move in,\n12. so there was no way she would move out.\n13. She said it was the real estate agents fault.\n14. This was in 1925\n15. and horse pulled police cabins.\n16. We rode in one\n17. and went home.\n18. It was a very terrifying experience for me.",
    "60c1d285791d2605d8d7d131": "1. In the 1920s, a boy was living with her mother and father and siblings in an irish neighborhood.\n2. They were a black family who rented in an irish neighborhood for a month.\n3. The boy's father went to attend the horses outside.\n4. The mother went to fourth street which is a market.\n5. The boy was home alone with just his younger siblings.\n6. He heard a loud noise crashing through the window.\n7. The loud crash was a rock that was thrown through the window.\n8. The boy managed to keep his siblings protected from the window glass by standing on the staircase.\n9. He was scared and ran outside to find his mom at fourth street.\n10. When the boy found his mother there was surprisingly a policeman passing by.\n11. He managed to explain the story of what happened to the policeman and his mother.\n12. The policeman was understanding but mentioned that there was nothing he could do to help.\n13. Probably due to the racial segregation existing at those times.\n14. The mother was relentless and opted to go to the nearest police station to find someone to help with this matter if this policeman can't.\n15. She went to the police station where they told her the same thing and suggested she moved out.\n16. She mentions she can't move out because she paid the rent for the month with her last money.\n17. She asked the policeman take her home in his carriage instead.\n18. When she arrived she told the irish people in the neighborhood if they want her to leave they must collectively contribute enough money for her to move out because she doesn't have any money left over to move out.\n19. After her speech, the neighborhood treated her better and more neighborly after that.",
    "5e98ce846515431026d195c6": "1. We move to a new neighbourhood.\n2. We made from a different neighbourhood as my dad was an alcoholic.\n3. We moved in and my dad went out to drink.\n4. My mum went out to go shopping.\n5. I was left at home.\n6. Then a stone came through the window and smash the window.\n7. I was scared.\n8. But I went outside and there were people.\n9. I didn’t know what to do.\n10. I had to look after the children.\n11. The children were in the hallway.\n12. I had to find my mum.\n13. My mum had gone to a place a place where you can get what you want for money.\n14. A shop.\n15. My mum was shopping.\n16. I found my mum and tried to tell her what had happened.\n17. A police man had come by and tried to say what had happened.\n18. The policeman said this is a bad neighbourhood.\n19. People called us black but they didn’t say black back them.\n20. My mum asked the police man to help but he said he couldn’t help.\n21. He said we should move.\n22. This is a bad neighbourhood.\n23. This is an Irish neighbourhood.\n24. my mum said you need to find who did this.\n25. The policeman said he could not help you did not see them.\n26. You do not know who to blame.\n27. He told my mum that we should move.\n28. But she said she couldn’t move.\n29. She paid rent upfront.\n30. This is all the money she had.\n31. The estate agent is to blame if they didn’t want us living here they should’ve rented us the house.\n32. My mum told the police officer to take us back in the patrol car.\n33. We drove back home in the patrol car.\n34. When we got back home we had to get out the back of the patrol car.\n35. It was one of those ones that have steps to get out the back.\n36. As we were driving, the car goes, clang clang clang, that’s the sound of the car.\n37. When we got back all the neighbours had come out to see what was happening.\n38. My mum said that if you don’t want us here you can’t do anything I have rented this house.\n39. I have spent all my money on rent.\n40. I will be here for a month I can’t afford windows.\n41. my mum was smart.\n42. She went to high school.\n43. This is\n1925.\n44. Soon after we moved in my dad got sick.\n45. The neighbours were supportive like you would expect.\n46. The neighbours did what you would expect neighbours to do.",
    "5fad0a601ab00734f83bf339": "1. A black family is moving into a white neighborhood.\n2. Mom and Dad leave the house\n3. and someone throws a stone through the window\n4. while the kids are there.\n5. They have enough sense to run upstairs\n6. and the eldest decides to go look for their mother\n7. as they know where they are.\n8. The eldest finds the mother\n9. and they talk to a police officer\n10. who urges them to leave,\n11. the mom refuses\n12. and demands to be taken to the precinct.\n13. There she talks to the officer's superior\n14. and also ends up nowhere with him,\n15. this is when she asks to be taken home with a police patrol.\n16. When they get home,\n17. the neighbors are looking outside to see them\n18. and the mom gives them a piece of her mind.\n19. Some of the neighbors are nice\n20. and help the family\n21. and the dad becomes sick.",
    "60c0c4333e49151d768bb35b": "1. The incident the narrator is telling took place in 1925 in New York City.\n2. The narrator was 10 years old at the time.\n3. He and his family had just rented a house and moved their furniture in.\n4. It was an Irish neighbourhood and not integrated.\n5. They must have been the first black family that had tried to live there.\n6. The father and the mother had had to go out separately on errands.\n7. This left the narrator to look after his siblings.\n8. Suddenly a rock came through the front window.\n9. This was followed by a shower of other stones.\n10. The narrator hid his siblings on the stairs where they would be safe from flying glass.\n11. He went out to find his mom.\n12. His mom was shopping in the Jewish neighbourhood a little way away.\n13. He was telling his mom about the attack.\n14. A policeman came by and heard their conversation.\n15. The policeman, who was Irish himself, said that he couldn't do anything.\n16. This was especially since the narrator didn't know who had attacked them.\n17. The policeman said that the only thing they could do was move out of the neighbourhood.\n18. The mother stood up to the policeman.\n19. She said she could not move for lack of money.\n20. They had paid a month's rent in advance.\n21. Perhaps the real estate agent should not have rented them the house?\n22. Then they went to the police station.\n23. The other policemen were equally unhelpful.\n24. They advised them to move out.\n25. But the police drove them home.\n26. The whole neighbourhood saw them arrive in the police wagon.\n27. The mother then explained to the neighbours that she realized they were different.\n28. She couldn't move because it was winter.\n29. She had no money to go anywhere else.\n30. Eventually, the neighbours actually became helpful.\n31. They showed the kind of solidarity neighbours should show to each other.",
    "64e7dcdda57ceb0c4584ffe5": "1. A family moved to an Irish neighbourhood on a street called Wharton.\n2. One day when the father was out tending to the horses and the mom was out shopping, someone started throwing stones through the windows.\n3. The 10 year old child of the family told the other kids to hide so they wouldn't be hurt.\n4. The child then ran out to fifth street to search for their mom.\n5. Upon finding the mom, the mom then talks to a police officer and asks for help.\n6. The officer, who is also Irish, says that there is nothing he can do and implies that moving out of that neighbourhood is the best course of action.\n7. Unsatisfied with this answer, the mom goes to the police station to talk to someone higher up.\n8. She is received better here, but is still told nothing can be done because she didn't see who threw the stones.\n9. The officer gives the mom a ride back home in a carriage with the clanging bells.\n10. The mom then addresses the neighbourhood and tells them they will be there for at least the next month and so they should be more accepting of them.",
    "5fc423afc5dad58229f0c1c0": "1. Honestly,\n2. that felt like pure nonsense\n3. and it's difficult to recall.\n4. I remember\n5. there were race issues.\n6. They were staying for a month.\n7. She didn't have any money to pay rent.\n8. She went to the police to complain.\n9. She was being kicked out of her place,\n10. and she just wanted a place for her family.\n11. Her son was telling the story.\n12. There was a lot of stuttering\n13. and repetition.",
    "5f0d5e8b03b5db770f95690d": "1. We moved into a neighbourhood between Third and Walton,\n2. where mainly Irish people lived.\n3. My father was a drunk\n4. and used to manage the horses.\n5. One day when my mother had gone shopping,\n6. people began to throw stones at our house.\n7. We were scared\n8. and didn't know what to do.\n9. I went out to look for my mom\n10. who I spotted near a Jewish neighbourhood,\n11. their shops were always open till late\n12. because they wanted to make money.\n13. I told her what had happened\n14. when we spotted a policeman.\n15. My mom told him what had happened\n16. but he wasn't interested in helping us.\n17. He implied that people of our colour didn't belong in an Irish neighbourhood.\n18. My mom enquired about this his precinct\n19. and then we made our way there.\n20. We went through various cases\n21. ad they admitted that they couldn't help,\n22. so my mom asked them to take us back in a patrol car.\n23. When we returned,\n24. my mom spoke to the people in the neighbourhood\n25. and asked them to either give us enough money to move out or leave as be.\n26. Following this incident,\n27. we were able to move on\n28. and enjoy ourselves with the support of people in our neighbourhood.",
    "64ac5569f232b08a6da326bd": "1. The story is told from the perspective of a 10-year-old child.\n2. The family, a mom, dad, and 2 - 3 children (not sure if it said), had just moved into a house in a predominately Irish area.\n3. The dad went out to check on the horses,\n4. while the mom went to the store down the road (on Fifth) that was run by Jewish people and open 24 hours.\n5. When the kids were home alone, somebody(ies) threw a rock into one of their windows.\n6. At this time, the narrator explains how they put their siblings into a room or closet nearby and told them that they would be safe there.\n7. The narrator then runs to the store their mom went to and starts explaining what was happening.\n8. A police officer arrives and they explain to the police officer what has happened.\n9. The police officer tells them that this neighborhood is Irish and that they do not like the new family living in that house because they are black.\n10. Since this was 1925, there has been A LOT of outward racial prejudice, racism, and oppression.\n11. The police officer told them to move,\n12. to which the mom had made him aware that they did not have enough money to move and that they spent all their money on the rent for this new place.\n13. The mom then asked to go to the precinct where this officer works and the officer took the mom and child to the precinct.\n14. Here, the mom spoke with another officer (possibly a supervisor) about the situation and got a pretty similar response.\n15. She reiterated that she had to spend all of the money paying for rent upfront.\n16. She also states that they should not have rented to her if they did not want her there and that the realtor should be liable.\n17. The police officer also asked the child if they saw the face of the person who threw the rock,\n18. to which the kid did not and the police officer stated they cannot do anything without anyone to blame.\n19. With this, the mom asked the officer to give them a ride home.\n20. The officer took them home in a horse and buggy with bells on it.\n21. The bells were being rung as they arrived home (making a \"clang\" sound, as described) and the neighbors were outside watching.\n22. The mom and child were let out, walking down the steps from the buggy/carriage to peering eyes.\n23. The mom then addressed people in the neighbourhood letting them know that the family will be there for the month since they have already paid, that they do not have enough money to move, and don't know if they will even have enough money for next month's rent.\n24. She then posited that if they do not want them to live there, they can raise the funds themselves to move them out.\n25. The narrator then continues to explain that nobody raised the funds themselves, speculating that they don't have the money either and that the neighbors were being as \"normal\" or \"typical\" as one can hope.\n26. We also learn that the father falls ill.",
    "6160c8f657e3c4094b01614a": "1. A family moved into a new neighbourhood,\n2. they were a black family,\n3. different from everyone else in the area\n4. which was composed of irish people.\n5. As soon as they moved into the house\n6. some locals threw stones through the family's windows\n7. causing the younger members of the family to be scared.\n8. The mother of the family requested help from the police officer,\n9. who was also irish\n10. and he wasn't very helpful,\n11. he seemed to share the same disdain for the family,\n12. though more veiled due to his position.\n13. The officers only solution to the familys predicament was to move away,\n14. the mother said she couldnt possibly since she has just moved in,\n15. paid for a months rent\n16. so told the officer and whoever else nearby that was listening\n17. that they have no choice but to accept that they will be there for at least a month\n18. and if they want them to leave that badly they should pool together enough money so they can afford to move away,\n19. they of course didn't do this since they are likely struggling just as much as them.\n20. Relations within the community got a lot better,\n21. when the father became ill,\n22. the community was very attentive and helpful.",
    "614b8cd74302e5942b70bde6": "1. Their father drank\n2. and mother went to get food\n3. but father didn't come home.\n4. I was there with the kids\n5. and my mother went out of the house too\n6. and then a crash happened\n7. and it was a big stone through our window.\n8. I went to find mom\n9. and I ran to fourth street in a Jewish neighborhood\n10. and I found my mom\n11. and then we talked to a cop\n12. who said you better move out of there\n13. it is a bad neighborhood\n14. and that he couldn't do anything to help my mom.\n15. Mom didn't have enough money to move though\n16. so the cops took us home\n17. and then mom said she has rented the house for a month\n18. so she told the cops that the only way she will move is if they give her the money to do so.\n19. Our neighbors were nice though\n20. and helped us out.",
    "5954fca53e9d73000192588f": "1. The child was around 10 years old\n2. and had recently moved in to a rented house in a new neighbourhood.\n3. The child had been in the house with their siblings.\n4. The child's mother had gone to the shop\n5. and the child's father had gone to tend the horses.\n6. While the parents were away the house was stoned.\n7. The child tried to make their siblings safe\n8. and then left the house to find their mother.\n9. They found the mother at the shop\n10. and while trying to communicate to her what had happened they were overheard by a policeman.\n11. The mother asked the policeman for assistance\n12. but he replied there was nothing he could do.\n13. He suggested that the family should move to another area\n14. (there appears to have been issues with racism in the neighbourhood).\n15. The mother advised that moving was unaffordable\n16. and went with the child to the police station to seek assistance.\n17. At the police station the mother confronted another police officer\n18. and asked for assistance.\n19. The officer declined to investigate as no suspects had been identified.\n20. The officer was not prepared to make any effort to investigate or find the criminals.\n21. The mother is described as being educated, having completed high school\n22. and despite experiencing prejudice and discrimination was not afraid to try and secure her basic rights.\n23. The mother requested that she and her child were transported back to the property in the police vehicle.\n24. The police vehicle was a horse drawn cart with a bell.\n25. On arriving at the property the mother and child exited the police vehicle\n26. and the mother addressed her neighbours who had gathered nearby.\n27. She explained the she had paid a month rent\n28. and could not afford to move,\n29. nor could she afford the cost of window replacement.\n30. She acknowledged that despite the difference in her skin colour she had much in common with others in the neighbourhood.\n31. Speaking frankly appears to have made an impact\n32. as the description of how the family were treated after this shows some improvement,\n33. especially when the father became ill.",
    "6318e2c61780455450fe4199": "1. It was 1930 in the USA.\n2. I'm a black child aged 10 and we'd just moved into an Irish neighbourhood.\n3. My father had gone out and hadn't returned so we were worried.\n4. Suddenly, stones began hitting the windows,\n5. so my mother went out to see what was happening,\n6. and I went with her.\n7. We saw that people were throwing stones at our house.\n8. We found a police officer,\n9. who advised us to move out of the neighbourhood as we wouldn't be welcome.\n10. We went to the police station to report the incident.\n11. My mother told the office in charge that the police should protect them.\n12. He asked if my mother had seen the face of anyone throwing stones.\n13. She said she hadn't,\n14. so the officer asked how he could punish anyone if he didn't know who to punish.\n15. My mother asked him to drive us home,\n16. so he did.\n17. To my admiration, my mother said to the stone-throwers that we'd just moved in to the house\n18. and we didn't have enough money to pay to move out,\n19. so she asked the people to collectively find enough money to give us so we could move out.\n20. People didn't give us any money,\n21. but they did leave us alone.\n22. However, the whole experience made my father unwell.",
    "5c3cc3bad06aa00001ebc484": "1. We had just gotten moved to Third and Horton.\n2. My mother went to get food\n3. and my father left with the horses\n4. to take the pack of horses back.\n5. I was alone in the house with the kids.\n6. Then they started throwing the stones.\n7. I was so scared,\n8. I was only 10 years old.\n9. I got the kids out of there\n10. and ran and ran to Fourth which was a Jewish neighbourhood.\n11. Then I found my mother\n12. and told her what had happened.\n13. She told a policeman what had happened\n14. but I was so scared that my voice shook.\n15. He said, \"It's an Irish neighbourhood, you'll have to move\".\n16. My mother, the smartest person I know,\n17. she's the only person I know that completed high school,\n18. she went to Lackawanna high school.\n19. My mother said she's not moving,\n20. we just moved and haven't got any money to move again.\n21. The policeman said we had to move.\n22. He was Irish himself.\n23. The year was around 1925\n24. and times were what they were.\n25. My mother told him to drive us home in the patrol car,\n26. it went clang, clang a great bell that rang, clang, clang.\n27. A crowd of people were on the streets.\n28. My mother got out of the police patrol around where the horses came.\n29. She told the people that they we didn't have enough money to move\n30. and if the people wanted her to move they had to get together and find the money for them to move.\n31. We already paid 1 months rent\n32. and couldn't afford to move again.\n33. Of course that never happened\n34. and when my father got sick the neighbours were as nice as could be.",
    "5fb2e72ac95e4c9ab7a082da": "1. The brief summary of the story is that a family moved into a new neighborhood.\n2. When they arrived a stone was thrown into their window.\n3. The police arrived and explained to the family that it is because they are in an Irish community.\n4. and that their kind if not welcome, they are most likely a black family.\n5. The cop says there is nothing they can do and suggest that the family moves.\n6. The family is in shock and can't believe that this how the police answered them.",
    "55881a68fdf99b1c9154fe4a": "1. The dad was a drunk\n2. and was at home\n3. and had to put the furniture in the right place.\n4. Then the dad left\n5. and the mum left to go to the shops\n6. and they were left with the kids.\n7. Then someone through stones thorough the window.\n8. So they moved the kids to hide\n9. so they would not get hurt.\n10. They went through the door\n11. but was scared as they did not know what would be thrown.\n12. They went to look for they mom who was at fourth street.\n13. The shops shut late as they wanted to make as much money as possible.\n14. They found there mom\n15. and told them what happened\n16. it took a while to make her understand.\n17. A policeman was passing\n18. and the sound of their voice stopped the policeman.\n19. They told the policeman what happened\n20. and he said that it was a bad area\n21. the people were Irish\n22. and they did not like black people.\n23. They should move.\n24. The mum said they had just moved there\n25. and could not afford to move.\n26. the Policeman said there was nothing he could do,\n27. and the mum said where was the precinct\n28. so she could find someone who could help her.\n29. At the precinct she spoke to the captain,\n30. he said there was nothing he could do\n31. and she should move.\n32. the mum asked for a lift home\n33. and they were taken home by horse and cart\n34. and there was a clang noise from the cart.\n35. Once home all the neighbours were watching\n36. and the mum asked them why they did what they did,\n37. and that she would be here for at least a month,\n38. as she had no money to move.\n39. or if they wanted her to move they needed to give her the money to move.\n40. While they were there the dad got sick\n41. and the neighbours were kind and helpful.",
    "6416d1aad8b7e8743fac6df0": "1. They moved to third and wantan.\n2. Dad was a drinker\n3. and mum went to shops on fourth street\n4. where there were horses and carts.\n5. During this time both parents were gone\n6. the neighbours threw stones through the window\n7. the narrator took their siblings to the stairwell\n8. to keep them safe from the glass.\n9. She told them to stay there\n10. while she went to look for mother.\n11. She found mother\n12. and explained what had happened.\n13. Fourth street was a lot of Jews\n14. but it was an Irish community.\n15. A policeman approached\n16. and they explained what had happened\n17. he said it is because they were black.\n18. Mother took her to the police station\n19. to do something about it.\n20. She spent a long time talking there\n21. and the police said there was nothing they could do\n22. and she should move.\n23. She said she couldn't as they had no money\n24. and that the police needed to drop them home.\n25. The police did to stop the long and tiresome talking.\n26. When they arrived home the mother explained to neighbours they would be staying\n27. as they had no money\n28. and that if the neighbours didn't want them there\n29. then they should put money together to pay them to pay elsewhere.\n30. Father got sick while they lived there\n31. and the neighbours were nice.",
    "5f35050d72e95343c64aef66": "1. We moved down Third and Waton with our father and mother.\n2. My father drank a lot.\n3. My mother had gone to get food from the market.\n4. My father left us at this new home to take horses back.\n5. I was left alone to look after the other kids.\n6. There was an awful crash.\n7. I went to look.\n8. A big stone had been thrown through the window.\n9. There was glass everywhere.\n10. I got the other kids into the stairway.\n11. I told them to stay there as I need to go find mum.\n12. They were crying because they were scared.\n13. I needed to go to 4th street where the Jewish shops were.\n14. I was 10 years old when this happened.\n15. I eventually found mum.\n16. Mum went to the police.\n17. I was nervous and shaking.\n18. The police told mum it was a bad neighbourhood, mainly Irish people.\n19. They didn't like black people.\n20. The policeman didn't say black but its what he meant.\n21. He also was Irish.\n22. The police said there's not much we can do about it.\n23. They asked did I see who did it.\n24. I said no that I hadn't seen.\n25. He said the only thing to do was move.\n26. My mother said we only just moved in.\n27. We had no money as we had paid a month's rent in advance.\n28. We couldn't move.\n29. It was Winter and very cold.\n30. Mother said the least you can do is take us home in the police wagon.\n31. They took us home.\n32. Mother told the neighbourhood we would be staying a month at least.\n33. We were just the same as everyone else apart from having a different colour skin.\n34. Father got ill during the time there.\n35. The neighbour was very good to us.",
    "5ee7b0a316b7d10662171450": "1. There was a family\n2. which was Irish\n3. and lived in a place\n4. where they were racist towards Black people\n5. however nobody was educated there\n6. apart from the mother\n7. so she had sense.\n8. Someone did something\n9. and they went to the police station\n10. and the neighbours all were scared."
  }
}